
import Foundation

struct ReportClass{
    var reportName: String = ""
    var reportID: Int = 0
    //0, 报最大,
    //1, 报最大次大，
    //2，报1大2大3大，
    //3，报最小
    //4，报最小次小
    //5，报排名（6名）
    //6，报大1大2，小1小2
    //7, 报原始排名4432
    var rankReport: Int = -1
    //0, 报活门
    //1，报活门半活门
    //2, 报活门，人数>4, 报第一活门第二活门
    //3，4432生死门
    //4，报死门
    var aliveDeathReport: Int = -1
    //0，报几个对子
    //1，无对子
    //2, 一共多少个对子
    var pairReport: Int = -1
    //0，报有平点
    //1，报无平点
    //2, 报有一共多少家平点
    //3，报最大点数有没有平点
    var DrawPointReport: Int = -1
    //0, 报无9点
    var NPReport: Int = -1
    //0，报最大家牌
    //1, 报各家点数
    var isReportWinnerSingleFeatures: Int = -1

    //0,XY张
    //1,上下5张
    //2,下XY张
    //3，上10张
    //4，上Y张
    //5，上下XY张
    //6，看手牌
    //7, 范围切牌
    //8，去掉6789张牌
    //9，固定第Y张
    //10, 多种洗牌方式
    //11, 0-上Y张
    var reportCutRange: Int = -1
    //0,报大小
    //1,保位置大小
    //2,哪个位置拿最大最多
    //3,保2个位置必有一家大小
    //4,报每一个切牌位置的最大或者最小家
    //5，保位置最大最小次数最多
    //6，保位置活门且报最大
    //7，保无牛或最多一家有牛
    //8，保至少一家有牛牛
    //9，保单个位置大小, 不跳出全部
    //10, 保2个位置必有一家大小，不跳出全部
    
    var reportTarget: Int = -1
    //0,留色再根据色牌点数去牌
    //1,去色再根据色牌点数去牌
    //2，留色
    //3，去色
    //4，去色补到底部
    //5, 去掉色牌1张
    //6，色牌先发（面牌移动到色牌下面）
    //7, 去掉面牌补到底，去掉底牌补到顶
    //8, 上下XY张色牌先发
    //9，上下XY张留色
    //10, 上下XY张去色1张
    //11，指定牌为底,切牌
    //12, 指定牌为顶，切牌
    //13，去掉Y张面牌
    //14, 去掉Y张面牌，再根据面牌点数去牌(越界)
    //15，去掉面牌和底牌，点数相加几点就去掉面上几张牌
    //16，比第一张牌，从最大发
    //17，比第一张牌，从最小发
    //18，看手牌
    //19，从点数最大继续发
    //20，看手牌留色
    //21，看手牌去色
    //22，范围切牌去色
    //23，去掉面牌（从0开始）
    //24，去掉面牌放到底部（从0开始）
    //25，下XY张留色面牌移动到色牌下面
    //26，下XY张色先发
    //27, 指定牌上一张去色
    //28，指定牌下一张去色
    //29, 看牌留色
    var singlefeaturesTransformation: Int = -1
    //0，保多轮位置最大次大次数最多
    //1，保多轮同点报最大次大生死门
    //2，保多轮同点无九点，
    //3，多轮同点无对子
    var consecutiveReport: Int = -1
    //-1，不报
    //0, 保目标位置
    //1，保X
    //2，保Y
    //3，保X或者Y
    var positionToReport: Int = -1
    //0,切牌为色牌
    //1，底牌为色牌
    //2，飞2张两张牌和为色
    //3，底两张和为色
    //4,底牌+打色的牌为色
    //5,去色一张+提前去掉的牌为色
    //6,指定牌上一张牌为色(越界问题)
    //7,指定牌下一张为色
    //8,固定第Y张牌为色
    //9,面牌为色牌
    //10，切牌后面牌为色
    //11，6789为色
    //12，看色留色+色牌上X张为色
    //13，去色补不补看Y
    //14，固定第10张为色
    //15,下XY张打色
    //16,指定牌去顶，底为色
    //17，看牌为色
    //18，看牌两次和为色

    var colorSingleFeaturePos: Int = -1
    //0, 有指定牌，x花色 y数字
    //1, 看色，根据看的色牌来打色
    var hasSpecialSingleFeature: Int = -1
    //0, 报指定玩家手里的牌
    //1，报最大家牌，Y=10 点数，其他点数+花色
    var specifiedRCHand :Int = -1
    //0, 不同发牌，根据Y值决定
    //1, 看手牌报下轮
    //2，看手牌从第一轮开始报
    //4, 飞2张
    //5, 随意混合打色
    var differentDeal: Int = -1
    
    var reportFormation: Int = -1
    
    //0, 看手牌处理
    //1, 看色留色
    //2, 看色去色
    //3, 正常切牌
    var cutSingleFeatureProcession: Int
    
    init(reportName: String, reportID: Int, rankReport: Int, aliveDeathReport: Int, pairReport: Int, drawPointReport: Int, ninePointReport: Int, reportCutRange: Int, reportTarget: Int, singlefeaturesTransformation: Int, consecutiveReport: Int, positionToReport: Int, colorSingleFeaturePos: Int, hasSpecialSingleFeature: Int, specifiedRCHand : Int, differentDeal: Int, reportFormation: Int, cutSingleFeatureProcession: Int) {
        self.reportName = reportName
        self.reportID = reportID
        self.rankReport = rankReport
        self.aliveDeathReport = aliveDeathReport
        self.pairReport = pairReport
        self.DrawPointReport = drawPointReport
        self.NPReport = ninePointReport
        self.reportCutRange = reportCutRange
        self.reportTarget = reportTarget
        self.singlefeaturesTransformation = singlefeaturesTransformation
        self.consecutiveReport = consecutiveReport
        self.positionToReport = positionToReport
        self.colorSingleFeaturePos = colorSingleFeaturePos
        self.hasSpecialSingleFeature = hasSpecialSingleFeature
        self.specifiedRCHand = specifiedRCHand
        self.differentDeal = differentDeal
        self.reportFormation = reportFormation
        self.cutSingleFeatureProcession = cutSingleFeatureProcession
    }
}

struct DatasetReturnRCInfo{
    var rcID: Int = 0
    var rcRank: Int = 0
    var rcSingleFeaturesType: String = ""
    var rcSingleFeaturesSuit: String = ""
    var rcDatasetRank: Int = 0
    //是否是对子
    var isPair: Int = 0
    //每个玩家的手牌
    var RCSingleFeatures: [SingleFeature] = []
    var communitySingleFeature: [SingleFeature] = []
}

class ReportManager{
    
    static let noColorDic: [Int: Int] = [
        0: 1,
        1: 4,
        2: 3,
        3: 2
    ]
    
    static let allReportName: [Int: String] = [
        0:"[1]:报最大",
        1:"[2]:报最小",
        2:"[3]:报最大次大",
        3:"[4]:最小次小",
        4:"[5]:报1大2大3大",
        5:"[6]:报活门",
        6:"[7]:报活门半活门对子",
        7:"[8]:报最大次大和生死门",
        8:"[8_1]:报最大次大活门半活门平点对子",
        9:"[10]:报最大和最大家牌",
        10:"[12]:报排名",
        11:"[13]:报原始排名 4432和生死门*",
        12:"[14]:报最大次大不打几平点对子",
        13:"[45]:上10张打色留色再根据色牌点数去牌保位置最大",
        14:"[46]:上10张打色留色再根据色牌点数去牌保位置最大次大",
        15:"[47]:上10张打色去色全部再根据色牌点数去牌保位置最大",
        16:"[48]:上10张打色去色全部再根据色牌点数去牌保位置最大次大",
        17:"[49]:上10张打色留色保位置最大跑的快专用*",
        18:"[50]:上10张打色留色保位置最大",
        19:"[51]:上10张打色留色保位置最大次大",
        20:"[52]:上10张打色留色保位置最小",
        21:"[53]:上10张打色留色保位置最小次小",
        22:"[54]:上10张打色去色全部+底为色保位置最大",
        23:"[55]:上10张打色去色全部保位置最大",
        24:"[56]:上10张打色去色全部保位置最大次大",
        25:"[57]:上10张打色去色全部保位置最小",
        26:"[58]:上10张打色去色全部保位置最小次小",
        27:"[60]:上10张打色去色1张保位置最大",
        28:"[61]:上10张打色去色1张保位置最大次大",
        29:"[62]:上10张打色去色1张保位置最小",
        30:"[63]:上10张打色去色1张保位置最小次小",
        31:"[64]:上10张打色去色1张+提前去掉的牌为色保庄最大*",
        32:"[66]:上10张打色色牌先发保位置最大",
        33:"[67]:上10张打色色牌先发保位置最大次大",
        34:"[68]:上10张打色色牌先发保位置最小",
        35:"[69]:上10张打色色牌先发保位置最小次小",
        36:"[70]:上10张去牌保多轮位置最大次大次数最多*",
        37:"[71]:上10张去牌保位置最大",
        38:"[71_1]:上10张去牌保位置最大对优先*",
        39:"[72]:上10张去牌保位置最大次大",
        40:"[73]:上10张去牌保位置最小",
        41:"[74]:上10张去牌保位置最小次小",
        42:"[75]上10张去牌保有活门报活门",
        43:"[76]:上10张去牌保有活门报最大",
        44:"[77]:上10张去牌保多轮同点报最大次大生死门*",
        45:"[78_1]:上10张去牌保多轮同点且无9点*",
        46:"[78]:上10张去牌保多轮同点且无对子*",
        47:"[79]:上10张去牌面为色去色保位置最大次大次数最多*",
        48:"[80]:上10张去牌底为色保位置最大次大",
        49:"[81]:上10张去牌保位置最小无对子*",
        50:"[82]:上10张去牌保34门有最大报最大",
        51:"[83]:上10张去牌保34门有最大次大",
        52:"[84]:上10张抽面牌保位置最大",
        53:"[84_1]:上10张抽面牌保位置最小",
        54:"[85]:上10张去牌保多轮位置最大次数最多*",
        55:"[86]:上10张去牌面为色色先发保位置最大次大",
        56:"[87]:上10张去牌面为色色先发保位置最大",
        57:"[88]:上10张去牌面为色色先发保位置最小",
        58:"[91]:上10张去牌保无牛或最多一家有牛",
        59:"[92]:上10张去牌保至少一家有牛牛",
        60:"[94]:上下5张去牌保1门最小有2家同点",
        61:"[95]:上下5张去牌保4门最大",
        62:"[96]:上下5张去牌保34门有最大报最大",
        63:"[97]:上下5张去牌保第2门是活门报最大",
        64:"[98]:上下5张打色色先发保位置最小",
        65:"[99]:上下5张打色色先发保位置最大",
        66:"[100]:上下5张打色留色保位置最大",
        67:"[101]:上下5张打色留色保位置最大次大",
        68:"[102]:上下5张打色留色保位置最小",
        69:"[103]:上下5张打色留色保位置最小次小",
        70:"[105]:上下5张打色去色1张保位置最大",
        71:"[106]:上下5张打色去色1张保位置最大次大",
        72:"[107]:上下5张打色去色1张保位置最小",
        73:"[108]:上下5张打色去色1张保位置最小次小",
        74:"[110]:下10张打色留色保位置最大次大",
        75:"[111]:下10张打色留色保位置最小次小",
        76:"[112]:下10张打色留色面牌移动到色牌下面保位置最大",
        77:"[120]:下10张打色色先发保位置最大次大",
        78:"[121]:下10张打色色先发保位置最小次小",
        79:"[130]:看手牌报生死门*",
        80:"[131]:看手牌报最大",
        81:"[132]:看手牌报最大次大",
        82:"[133]:看手牌报最大次大生死门",
        83:"[134]:看手牌比第一张牌从最大牌继续发报最大*",
        84:"[135]:看手牌比第一张牌从最大牌继续发报最大次大*",
        85:"[143]:看手牌面为色留色报最大",
        86:"[144]:看手牌面为色留色报最大次大",
        87:"[145]:看手牌面为色留色报最大次大生死门",
        88:"[147]:看手牌面为色去色报最大",
        89:"[148]:看手牌面为色去色报最大次大",
        90:"[149]:看手牌面为色去色报最大次大生死门",
        91:"[200]:飞2张保位置最大",
        92: "[201]:飞2张保位置最小",
            93: "[202]:飞2张看色留色保位置最大",
            94: "[203]:飞2张看色留色保位置最小",
            95: "[206]:飞2张看色去色1张保位置最大",
            96: "[207]:飞2张看色去色1张保位置最小",
            97: "[208]:飞2张看色色先发保位置最大",
            98: "[209]:飞2张看色色先发保位置最小",
            99: "[211]:飞2张骰子打色保位置最大*",
            100: "[212]:飞2张面为色留色保位置最大",
            101: "[213]:飞2张面为色留色保位置最小",
            102: "[214]:飞2张面为色去色保位置最大",
            103: "[215]:飞2张面为色去色保位置最小",
            104: "[216]:飞2张底为色保位置最大",
            105: "[217]:飞2张底为色保位置最小",
            106: "[218]:飞2张底2张相加为色保位置最大",
            107: "[221]:飞2张看色留色再看底保位置最大",
            108: "[284]:固定范围切牌报对子和同点数目*",
            109: "[285]:固定范围切牌报哪个位置拿最大最多*",
            110: "[286]:固定范围切牌报哪个位置拿最大次大最多*",
            111: "[289]:范围切牌保指定2家有最大",
            112: "[290]:范围切牌保有最好活门*",
            113: "[291]:范围切牌保有最好死门*",
            114: "[292]:范围切牌保位置活门*",
            115: "[293]:范围切牌保位置死门*",
            116: "[296]:范围切牌保位置最小次小",
            117: "[297]:范围切牌面为色去色保位置最大次大",
            118: "[298]:范围切牌面为色色先发保位置最大次大",
            119: "[299_1]:范围切牌保位置最大",
            120: "[299]:范围切牌保位置最大次大",
            121: "[300]:范围打色留色保位置最大",
            122: "[301]:范围打色留色保位置最大次大",
            123: "[304]:范围打色去色全部保位置最大",
            124: "[305]:范围打色去色全部保位置最大次大",
            125: "[310]:范围打色去色1张保位置最大",
            126: "[3111:范围打色去色1张保位置最大次大",
            127: "[316]:范围打色色先发保位置最大",
            128: "[317]:范围打色色先发保位置最大次大",
            129: "[330]:范围打色留色保位置最小",
            130: "[331]:范围打色留色保位置最小次小",
            131: "[334]:范围打色去色全部保位置最小",
            132: "[335]:范围打色去色全部保位置最小次小",
            133: "[338]:范围打色去色1张保位置最小",
            134: "[339]:范围打色去色1张保位置最小次小",
            135: "[342]:范围打色色先发保位置最小",
            136: "[343]:范围打色色先发保位置最小次小",
            137: "[400]:随意打色留色保位置最大次大*",
            138: "[401]:随意打色留色保位童最小次小*",
            139: "[402]:随意打色去色全部保位置最大次大*",
            140: "[403]:随意打色去色全部保位置最小次小*",
            141: "[410]:随意打色去色1保位置最大次大*",
            142: "[411]:随意打色去色1保位置最小次小*",
            143: "[415]:随意打色色先发保位置最大次大*",
            144: "[416]:随意打色色先发保位置最小次小*",
            145: "[420]:随意混合打色保位置最大次大",
            146: "[421]:随意混合打色保位置最小次小",
            147: "[422]:随意混合打色报大1大2小1小2",
            148: "[450]:指定底牌报最大次大",
            149: "[451]:指定底牌报最大",
            150: "[452]:指定底牌报最小次小",
            151: "[453]:指定底牌报最小",
            152: "[454]:指定底牌报生死门*",
            153: "[500]:指定顶牌报最大次大",
            154: "[501]:指定顶牌报最大",
            155: "[502]:指定顶牌报最小次小",
            156: "[503]:指定顶牌报最小",
            157: "[504]:指定顶牌报生死门*",
            158: "[510]:指定顶牌底牌为色报位置最大次大",
            159: "[511]:指定顶牌底牌为色报位置最大",
            160: "[512]:指定顶牌底牌为色报位置最小次小",
            161: "[513]:指定顶牌底牌为色报位置最小",
            162: "[514]:指定牌上一张打色留色报位置最大次大",
            163: "[515]:指定牌上一张打色去色全部报位置最大次大",
            164: "[516]:指定牌下一张打色留色报位置最大次大",
            165: "[517]:指定牌下一张打色去色全部报位置最大次大",
            166: "[518]:底为色4种发牌方式报最小*",
            167: "[519]:底为色4种发牌方式报最大*",
            168: "[520]:底为色报位置最大次大",
            169: "[521]:底为色报位置最大",
            170: "[522]:底为色报位置最小次小",
            171: "[523]:底为色报位置最小",
            172: "[524]:底为色报位置排名",
            173: "[525]:底为色报发牌方式保位置最大次大*",
            174: "[526]:底2张相加为色报位置最大次大*",
            175: "[527]:骰子打色报发牌方式保位置最大次大*",
            176: "[528]:底2张相加为色报发牌方式保位置最大*",
            177: "[530]:面为色报位置最大次大",
            178: "[531]:面为色报位置最大",
            179: "[532]:面为色报位置最小次小",
            180: "[533]:面为色报位置最小",
            181: "[534]:面为色报位置排名",
            182: "[540]:面为色去色报位置最大次大",
            183: "[541]:面为色去色报位置最大",
            184: "[5421:面为色去色报位置最小次小",
            185: "[543]:面为色去色报位置最小",
            186: "[544]:面为色去色报位置排名",
            187: "[670]:报4张单张",
            188: "[671]:报4张单张2*",
            189: "[672]:报4张单张3*",
            190: "[675]:报公牌*",
            191: "[680]:打色留色报发牌方式保位置最大次大*",
            192: "[681]:打色留色报发牌方式保位置最小次小*",
            193: "[700]:去掉14张面牌报哪家最大",
            194: "[701]:去掉14张面牌报哪家最小",
            195: "[702]:去掉14张面牌报哪家最大次大",
            196: "[703]:去掉14张面牌报哪家1大2大3大",
            197: "[704]:去掉14张面牌报哪家最小次小",
            198: "[705]:去掉14张面牌根据第14张牌点数再去牌报最大",
            199: "[706]:去掉14张面牌根据第14张牌点数再去牌报最小",
            200: "[707]:去面牌底牌根据面牌底牌点数和去牌报最大次大",
            201: "[708]:固定去掉6、7、8、9张牌，以去牌数为色报位置最大*",
            202: "[710]:跑的快报下家大牌*",
            203: "[719]:比第一张牌从最大牌继续发报最大次大",
            204: "[720]:比第一张牌从最大牌继续发报最大",
            205: "[721]:比第一张牌从最小牌继续发报最大",
            206: "[722]:比第一张牌从最小牌继续发报最大次大",
            207: "[723]:比第一张牌从最大牌继续发飞2张保庄家最大次大*",
            208: "[724]:比第一张牌从最小牌继续发飞2张保庄家最大次大*",
            209: "[725]:比第一张牌从最大牌继续发报各家点数*",
            210: "[740]:报指定玩家手里牌*",
            211: "[741]:报玩家手里牌+照牌报后面4张单张*",
            212: "[745]:看切牌报上下部分牌张数*",
            213: "[755]看色留色上10张去牌保位置最大",
            214: "[758]:看色留色+色牌上X张为色报最大次大",
            215: "[759]:看色留色2次打色保位置最大*",
            216: "[760]:看色留色报最大",
            217: "[761]:看色留色报最大次大",
            218: "[762]:看色留色报最小",
            219: "[763]:看色留色报最小次小",
            220: "[764]:看色留色报排名",
            221: "[766]:看色牌去色全部报最大",
            222: "[767]:看色牌去色全部报最大次大",
            223: "[768]:看色牌去色全部报最小",
            224: "[769]:看色牌去色全部报最小次小",
            225: "[770]:看色牌去色全部报排名",
            226: "[790]:固定第10张牌作色留色报最大",
            227: "[791]:固定第10张牌作色留色报最大...",
            228: "[793]:固定第10张牌作色留色报最小次小",
            229: "[7941:固定第10张牌作色留色报排名",
            230: "[795]:固定第10张牌作色留色4种发牌方式报最大*",
            231: "[796]:固定第10张牌作色留色4种发牌方式报最小*",
            232: "[800]:固定第10张牌作色去色全部报最大",
            233: "[801]:固定第10张牌作色去色全部报最大次大",
            234: "[802]:固定第10张牌作色去色全部报最小",
            235: "[803]:固定第10张牌作色去色全部报最小次小",
            236: "[804]:固定第10张牌作色去色全部报排名",
            237: "[805]:固定第10张牌作色去色全部4种发牌方式报最大*",
            238: "[806]:固定第10张牌作色去色全部4种发牌方式报最小*",
            239: "[810]:固定去面上Y张牌,从X-Y张选择色牌，保1大2大",
            240: "[815]:报从第几门开始发保最大*",
            241: "[816]:报发牌方式保2家同点3家不同点无9点*",
            242: "[817]:报发牌方式保位置最大次大*",
            243: "[818]:报发牌方式保位置最大*",
            244: "[821]:调位置报1段位多门活门*",
            245: "[822]:报多段位多门活门*",
            246: "[840]:调位置多门报切牌位置保位置是死门*",
            247: "[850]:报发几家牌可保最后2家牌任何家最大次大*",
            248: "[860]:多次同时抽底牌面牌底为色保位置最大*",
            249: "[2000]:测试报法*",
            250: "[2001]:测试报法2*",
        251:"[756]:看色留色上10张去牌",
        252:"[792]:固定第10张牌作色留色报最小",
        257: "[226]:飞2张底为色 色先发保位置最大",
        258: "[227]:飞2张底为色 色先发保位置最小",
        259: "[228]:飞2张底2张相加为色保位置最小",
        260: "[229]:飞2张看色留色再看底保位置最小",
    ]
    static let allReportInfo: [Int: String] = [
        0:"""
报哪家最大。最大家如果是多个，把所有最大家报出来
""",
        1:"""
报哪家最小
""",
        2:"""
报哪2家最大次大
""",
        3:"""
报哪2家最小
""",
        4:"""
报1大2大3大
""",
        5:"""
报哪个位置是活门。
""",
        6:"""
有活门报活门，有半活门为男声，有对子报对子，没有活门报0。
""",
        7:"""
报哪2家最大和哪个位置是活门,合成语音不支持连报多轮.人数>4 :报1大2大+第1活门+第2活门
""",
        8:"""
报最大次大，有活门报活门，女声=活门，男声=半活门=平点，有对子报对子
""",
        9:"""
报哪家最大和最大家是什么牌。Y=10报点数。 Y不等于10:报点数和花色
""",
        10:"""
报各家大小排名，人数超过6家只报前6家
""",
        11:"""
Y=10:发牌的第一家开始报，4最大，1最小。比如报 33214 表示 第1家第2家点数最大且同点。第3家第3大，第4家最小。活门4
Y=11:发牌的第一家开始报，4最大，1最小。比如报 3321 表示 第1家第2家点数最大且同点。第3家第3大，第4家最小。不报活门。
Y=20:发牌的第一家开始报，1最大，4最小。比如报 33214 表示 第1家第2家点数最小且同点。第3家次大，第4家最大。活门4
Y=21:发牌的第一家开始报，1最大，4最小。比如报 33214表示 第1家第2家点数最小且同点。第3家次大，第4家最大。不报活门。
""",
        12:"""
只能设置人数为4
报:12不打2大对子1平点，
表示第1家最大，第2家次大，
不打色2可确保庄家位置不拿最小，如果是三家小一家大不报，庄家任意位置都赢
有1个对子
有平点且平点相邻第2大（平点分为杂平点，双平点，平点，杂平点有大小则表示大->平点为最大两家，小->为最小两家
""",
        13:"""
报在第几张牌处打色留色，再根据色牌点数去面牌，可保位置最大。比如报3，上面3张打色留色，色牌是5再去5张面牌，J是去掉11张。打色范围有参数XY设定:默认X=1Y=10。表示在上10张内打色。修改为:X=5,Y=10表示在第5张到第10张内打色
""",
        14:"""
报在第几张牌处打色留色，再根据色牌点数去面牌，可保位置最大次大。比如报3，上面3张打色留色，色牌是5再去5张面牌，J是去掉11张。打色范围有参数XY设定:默认X=1，Y=10。表示在上10张内打色。修改为:X=5,Y=10表示在第5张到第10张内打色
""",
        15:"""
报在第几张牌处打色，色牌和色牌上部分的牌补到底部，再根据色牌点数去面牌，可保位置最大。比如报3，上面3张打色去色全部，色牌是5再去5张面牌，J是去掉11张
打色范围有参数XY设定:默让X=1,Y=10。表示在上10张内打色，修改为：X=5，Y=10表示在第5张到第10张内打色。
""",
        16:"""
报在第几张牌处打色，色牌和色牌上部分的牌补到底部，再根据色牌点数去面牌，可保位置最大次大。比如报3，上面3张打色去色全部，色牌是5再去5张面牌，J是去掉11张。打色范围有参数XY设定:默认X=1，Y=10.表示在上10张内打色。修改为:X=5,Y=10。表示在第5张到第10张内打色
""",
        17:"""
报5，如果第5张点数是6点，发牌第1轮发6张，第2轮发10张。既根据色牌点数确定第轮发几张。
""",
        18:"""
报在第几张牌处打色，色牌放回原处，可保位置最大。打色范围由参数XY设置，默认X=1,Y=10.表示在上10张内打色。修改为X=5,Y=10表示在第5张到第10张内打色
""",
        19:"""
报在第几张牌处打色，色牌放回原处，可保位置最大次大。打色范围有参数XY设定:默认X=1，Y=10。表示在上10张内打色。修改为:X=5,Y=10。表示在第5张到第10张内打色。
""",
        20:"""
报在第几张牌处打色，色牌放回原处，可保位置最小。打色范围有参数XY设定:默认X=1，Y=10。表示在上10张内打色。 修改为X=5,Y=10表示在第5张到第10张内打色
""",
        21:"""
报在第几张牌处打色，色牌放回原处，可保位置最小次小。打色范围有参数XY设定:默认X=1，Y=10。表示在上10张内打色。 修改为:X=5,Y=10表示在第5张到第10张内打色
""",
        22:"""
报在第几张牌处打色，色牌和色牌上部分的牌补到底部，底牌+打色的牌做为色牌，可保位置最大。
打色范围有参数X Y设定:默认X=1，Y=10.表示在上10张内打色。修改为:X=5，Y=10表示在第5张到第10张内打色
两张牌相加点超过10，则取结果个位数为色点。如两张牌相加结果为15,色点则为5。
""",
        23:"""
报在第几张牌处打色，色牌和色牌上部分的牌补到底部，可保位置最大。打色范围有参数XY设定:默认X=1，Y=10。表示在上10张内打色。修改为:X=5，Y=10表示在第5张到第10张内打色。
""",
        24:"""
报在第几张牌处打色，色牌和色牌上部分的牌补到底部，可保位置最大次大。打色范围有参数XY设定:默认X=1,Y=10。表示在上10张内打色。 修改为:X=5,Y=10表示在第5张到第10张内打色。
""",
        25:"""
报在第几张牌处打色，色牌和色牌上部分的牌补到底部，可保位置最小。打色范围有参数XY设定:默认X=1，Y=10。表示在上10张内打色。修改为:X=5，Y=10表示在第5张到第10张内打色。
""",
        26:"""
报在第几张牌处打色，色牌和色牌上部分的牌补到底部，可保位置最小次小。打色范围有参数XY设定:默认X=1,Y=10.表示在上10张内打色。 修改为:X=5,Y=10表示在第5张到第10张内打色。
""",
        27:"""
报在第几张牌处打色，去掉色牌，从上开始发可保位置最大。打色范围有参数XY设定:默认X=1，Y=10.表示在上10张内打色。 修改为:X=5,Y=10表示在第5张到第10张内打色
""",
        28:"""
报在第几张牌处打色，去掉色牌，从上开始发可保位置最大次大。打色范围有参数XY设定默认X=1，Y=10.表示在上10张内打色。 修改为:X=5,Y=10表示在第5张到第10张内打色
""",
        29:"""
报在第几张牌处打色，去掉色牌，从上开始发可保位置最小。打色范围有参数XY设定:默认X=1,Y=10.表示在上10张内打色。 修改为X=5,Y=10表示在第5张到第10张内打色。
""",
        30:"""
报在第几张牌处打色，去掉色牌，从上开始发可保位置最小次小。打色范围有参数XY设定默认X=1，Y=10。表示在上10张内打色。修改为:X=5,Y=10表示在第5张到第10张内打色。
""",
        31:"""
去掉1张再洗牌，上10张中抽一张牌出来，抽出的牌+洗牌前去掉的牌相加做色点。点数大于10 要去10，比如 10+5=15点，色点为15-10=5点
""",
        32:"""
        报在第几张牌处打色，色牌先发，可保位置最大。打色范围有参数XY设定:默认X=1,Y=10表示在上 10张内打色。修改为:X=5,Y=10表示在第5张到第10张内打色
""",
        33:"""
        报在第几张牌处打色，色牌先发，可保位置最大次大。打色范围有参数XY设定:默认X=1,Y=10。表示在上10张内打色。修改为:X=5,Y=10表示在第5张到第10张内打色
""",
        34:"""
        报在第几张牌处打色，色牌先发，可保位置最小。打色范围有参数XY设定:默认X=1,Y=10.表示在上10张内打色。修改为:X=5，Y=10表示在第5张到第10张内打色。
""",
        35:"""
        报在第几张牌处打色，色牌先发，可保位置最小次小。打色范围有参数XY设定: 默认X=1,Y=10.表示在上10张内打色X=5,Y=10表示在第5张到第10张内打色
""",
        36:"""
        报去掉多少张面牌，可保多轮位置最大次大次数最多。去面牌范围由参数XY设定:默认X=1,Y=10.表示在上 10张内去掉面牌。修改为:X=1,Y=5表示在前5张内去掉面牌。女声0=不用去牌也能满足条件。男声0=找不到满足条件的牌。如果需要玩4轮，就把连报轮数设定为4。报 1 3 4= 去掉1张面牌。第3轮4轮位置最大次大
        
""",
        37:"""
        报去掉多少张面牌，可保位置最大。去面牌范围由参数XY设定:默认X=1,Y=10。表示在上10张内去掉面牌。修改为:X=1,Y=5表示在前5张内去掉面牌。女声0=不用去牌也能保位置最大。男声 0=找不到满足条件的牌
""",
        38:"""
        梭哈专用。报去掉多少张面牌，可保位置最大。优先保位置有最大对子。按报下轮，报后续4张单张数字。去面牌范围由X，Y决定。默认X=1,Y=10.表示在 上10张内去掉面牌。修改为:X=1,Y=5表示在前5张内去掉面牌。女声0=不用去牌也能保位置最大。男声0=找不到满足条件的牌
""",
        39: """
        报去掉多少张面牌，可保位置最大次大。去面牌范围由参数XY设定:默认X=1，Y=10。表示在上10张内去掉面牌。修改为:X=1，Y=5表示在前5张内去掉面牌。女声0=不用去牌也能保位置最大。男声0=找不到满足条件的牌
        """,
            40: """
        报去掉多少张面牌，可保位置最小。去面牌范围由参数XY设定:默认X=1,Y=10.表示在上10张内去掉面牌。 修改为:X=1,Y=5表示在前5张内去掉面牌。女声0=不用去牌也能保位置最小。男声0=找不到满足条件的牌
        """,
            41: """
        报去掉多少张面牌，可保位置最小次小。去面牌范围由参数XY设定:默认X=1，Y=10.表示在上10张内去掉面牌。修改为:X=1，Y=5表示在前5张内去掉面牌。女声0=不用去牌也能保位置最小次小。男声0=找不到满足条件的牌
        """,
            42: """
        比如报52表示去掉5张面牌有活门2。支持多门活门。女声=活门概率>70%.男声=活门概率60%-70%。去牌范围可通过打色范围XY修改
        """,
            43: """
        报去掉多少张面牌，可保有活门同时报哪家最大。去面牌范围由参数XY设定:默认X=1,Y=10.表示在上10张内去掉面牌，修改为:X=1，Y=5表示在前5张内去掉面牌。女声0=不用去牌也能保位置最大。男声0=找不到满足条件的牌
        """,
            44: """
        报去掉多少张面牌，可保保多轮同点。去面牌范围由参数XY设定:默认X=1,Y=10.表示在上10张内去掉面牌。修改为:X=1，Y=5表示在前5张内去掉面牌。有活门=女声。平点=男声，半活门=男声，无对子优先.
        """,
            45: """
        报去掉多少张面牌，可保多轮同点且无9点。去面牌范围由参数XY设定:默认X=1，Y=10。表示在上10张内三掉面牌。修改为:X=1，Y=5表示在前5张内，去掉面牌。女声0=不用去牌也能满足条件。男声0=找不到满足条件的牌,如果需要玩4轮，就把连报轮数设定为4，报134=去掉1张面牌。第3轮4轮同点且无9点
        """,
            46: """
            报去掉多少张面牌，可保多轮同点且无对子。去面牌范围由参数XY设定:默认X=1，Y=10。表示在上10张内去掉面牌。修改为:X=1，Y=5表示在前5张内去掉面牌。女声0=不用去牌也能满足条件。男声0=找不到满足条件的牌。如果需要玩4轮，就把连报轮数设定为4。报134=去掉1张面牌。第3轮，第4轮同点且无对子
        """,
            47: """
            比如报去5 23，表示去掉5张面牌，每轮面牌做色去掉色牌，第2轮，第3轮可保庄最大次大。注意:人定要把连报轮数参数调为2以上2表示在前 2轮中找最大次大，3表示在前3轮中找最大次大
        """,
            48: """
            报5:去掉5张面牌，以底牌为色从上开始发牌可保位置最大次大
        """,
            49: """
            报234:表示去掉2张面牌,可保第1家最小。第3家最大，第4家次大。如果有活门，最后再报活门。女声0=不用去牌也能保位置最小。男声0=找不到满足条件的牌。
        """,
            50: """
        比如报24，表示去掉2张面牌补到底部可保第3门或第4门是最大，最大家是4。保34门由XY修改设定。
        """,
            51: """
        比如报2，表示去掉2张面牌补到底部可保第3门第4门是最大次大，最大家是4。保34门由XY修改设定。
        """,
            52: """
        报3，表示把前3张面牌一张一张地抽到底部，不是一次去3张。女声0=不用去牌也能保位置最大。男声0=找不到满足条件的牌
        """,
            53: """
        报3，表示把前3张面牌一张一张地抽到底部，不是一次去3张。女声0=不用去牌也能保位置最小。男声找不到满足条件的牌
        """,
            54: """
        报去掉多少张面牌，可保多轮位置最大次数最多。去面牌范围由参数X Y设定:默认X=1,Y=10. 表示在上10张内去掉面牌。修改为:X=1,Y=5表示在前5张内去掉面牌。女声0=不用去牌也能满足条件。男声0=找不到满足条件的牌。如果需要玩4轮，就把连报轮数设定为4。报13 4=去掉1张面牌。第3轮4轮位置最大
        """,
            55: """
        报5:去掉5张面牌，以面牌为色色牌先发，从上开始发牌可保位置最大次大
        """,
            56: """
        报5:去掉5张面牌，以面牌为色色牌先发，从上开始发牌可保位置最大
        """,
            57: """
        报5:去掉5张面牌，以面牌为色色牌先发，从上开始发牌可保位置最小
        """,
            58: """
        报5，表示去掉5张面牌，可保没有牛或最多一家有牛.女=无牛。男=1家有牛。0=不去牌，特殊:位置=2:保无牛或最多2家有牛
        """,
            59: """
        报52，表示去掉5张面牌，至少有一玩家是牛牛。第2家是牛牛
        """,
            60: """
        比如报23，表示去掉2张面牌补到底部可保第1门最小且有2家同点。表示去掉3张底牌补到顶部可保第1门最小且有2家同点。保第几门由Y修改设定
        """,
            61: """
        比如报23，表示去掉2张面牌补到底部可保第4门最大。表示去掉3张底牌补到顶部可保第4门最大。保第4门由Y修改设定，
        """,
            62: """
        比如报2344，表示去掉2张面牌补到底部可保第3门或第4门是最大，最大家是3。表示去掉4张底牌补到顶部可保第3门或第4门是最大，最大家是4.保 34门由XY修改设定。
        """,
            63: """
        比如报2341，表示去掉2张面牌补到底部第2门是活门，最大家是第4家。去掉3张底牌补到顶部，第2门是活门，最大家是第1家.保第几门活门用Y参数设定。
        """,
            64: """
        报在第几张牌处打色，色牌抽出来先发，可保位置最小。打色范围有参数XY设定:默认X=1,Y=10.表示在上下10张内打色。 修改为:X=5,Y=10表示在第5张到第10张内打色或倒数第5张到倒数第10张
        """,
            65: """
        报在第几张牌处打色，色牌抽出来先发，可保位置最大。打色范围有参数XY设定:默认X=1.Y=10.表示在上下10张内打色。 修改为:X=5,Y=10表示在第5张到第10张内打色或倒数第5张到倒数第10张
        """,
            66: """
        报在第几张牌处打色，色牌放回原处，可保位置最大。打色范围有参数XY设定，默认X=1，Y=10,表示在上下10张内打色。修改为:X=5,Y=10 表示在第5张到第10张内打色和倒数第5张到倒数第10张内打色
        """,
            67: """
        报在第几张牌处打色，色牌放回原处，可保位置最大次大。打色范围有参数XY设定:默认X=1,Y=10。表示在上下10张内打色。 修改为:X=5,Y=10表示在第5张到第10张内打色和倒数第5张到倒数第10张内打色
        """,
            68: """
        报在第几张牌处打色，色牌放回原处，可保位置最小。打色范围有参数XY设定:默认X=1,Y=10。表示在上下10张内打色。修改为:X=5,Y=10表示在第5张到第10张内打色和倒数第5张到倒数第10张内打色
        """,
            69: """
        报在第几张牌处打色，色牌放回原处，可保位置最小次小。打色范围有参数XY设定:默认X=1,Y=10。表示在上下10张内打色。 修改为:X=5,Y=10表示在第5张到第10张内打色和倒数第5张到倒数第10张内打色
        """,
            70: """
        报在第几张牌处打色，去掉色牌本身，从上开始发，可保位置最大。打色范围有参数XY设定:默认X=1,Y=10.表示在上下10张内打色。修改为:X=5，Y=10表示在第5张到第10张内打色或倒数第5张到倒数第10张
        """,
            71: """
        报在第几张牌处打色，去掉色牌本身，从上开始发，可保位置最大次大。打色范围有参数XY设定:默认X=1,Y=10。表示在上下10张内打色。修改为:X=5,Y=10表示在第5张到第10张内打色或倒数第5张到倒数第10张。
        """,
            72: """
        报在第几张牌处打色，去掉色牌本身，从上开始发，可保位置最小。打色范围有参数XY设定:默认X=1,Y=10.表示在上下10张内打色。修改为:X=5,Y-10表示在第5张到第10张内打色或倒数第5张到倒数第10张
        """,
            73: """
        报在第几张牌处打色，去掉色牌本身，从上开始发，可保位置最小次小。打色范围有参数XY设定:默认X=1，Y=10.表示在上作10张内打色。修改为:X=5，Y=10表示在第5张到第10张内打色或倒数第5张到倒数第10张。
        """,
            74: """
        报在第几张牌处打色，色牌放回原处，可保位置最大。打色范围有参数XY设定:默认X=1,Y=10.表示在下10张内打色。 修改为:X=5,Y=10表示在倒数第5张到倒数第10张内打色。女=最大，男=次大
        """,
            75: """
        报在第几张牌处打色，色牌放回原处，可保位置最小次小。打色范围有参数XY设定:默认X=1.Y=10.表示在下10张内打色。修改为:X=5,Y=10表示在倒数第5张到倒数第10张内打色。女=最小，男=次小
        """,
            76: """
        报5: 倒数第5张牌打色留色，面牌移动到色牌下面，可保位置最大
        """,
            77: """
        报在第几张牌处打色，色牌先发，可保位置最大次大。打色范围有参数XY设定:默认X=1,Y=10.表示在下10张内打色。 修改为:X=5,Y=10表示在倒数第5张到倒数第10张内打色。女=最大，男=次大
        """,
            78: """
        报在第几张牌处打色，色牌先发，可保位置最小次小。打色范围有参数XY役道:默认X修改为:X=1,Y=10.表示在下10张内打色。X=5，Y=10表示在倒数第5张到倒数第10张内打色。女=最小，男=次小
        """,
            79: """
        特殊牌选择看牌。看自己手里的第一张牌，报下轮是否有生死门。会报4个结果，根据自己的第一张牌是发牌中的第几张选择一个结果。比如报:1张2，2张0，3张0，4张0.如果自己是发牌的第1张，选择“1张2”表示下轮有活门 2.如果自己是发牌的第2张，选择“2张0-”表示下轮没有活门
            5-10人玩:报1张高2，2张3，高2表示活门是第2门，赢的概率大于70%。没有报高赢的概率大于60%小于70%
        """,
            80: """
                特殊牌选择看牌。看自己手里的第一张牌，报下轮最大家。会报4个结果，根据自己的第一张牌是发牌中的第几张选择一个结果。比如报:1张 2，2张 3，3张4，4张1.如果自己是发牌的第1张，选择“1张2”表示下轮第2家最大如果自己是发牌的第2张，选“2张3-”表示下轮第3家最大
        """,
            81: """
                特殊牌选择看牌。看自己手里的第一张牌，报下轮最大次大家。会报4个结果，根据自己的第一张牌是发牌中的第几张选择一个结果。
                比如报:1张21，2张32，3张41，4张12.如果自己是发牌的第1张，选择“1张21”表示下轮第2家最大，第1家次大如果自己是发牌的第2张，选择“2张32”表示下轮第3家最大，第2家次大
        """,
            82: """
                特殊牌选择看牌。看自己手里的第一张牌，报下轮最大次大家和生死门。会报4个结果，根据自己的第一张牌是发牌中的第几张选择一个结果。比如报:1张212，2张 32，3张41，4张12如果自己是发牌的第1张，选择“1张21”表示下轮第2家最大，第1家次大，有活门2如果自己是发牌的第2张，选择“2张32-”表示下轮第3家最大，第2家次大
        """,
            83: """
                特殊牌选择看牌。每人先发一张牌，哪家牌点数最大，后续牌从最大家继续发。报哪家最大。拿第一张牌的定义为第1家比如报:1张2，2张 3，3张4，4张1.如果自己是发牌的第1张，选择“1张2”表示第2家最大.
                如果自己是发牌的第2张，选择“2张3”表示第3家最大
                注意:第1轮开始报!
        """,
            84: """
                特殊牌选择看牌。看自己手里的第一张牌。每人先发一张牌，哪家牌点数最大，后续牌从最大家继续发。报哪家最大次大。拿第一张牌的定义为第1家。比如报:1张 21，2张 31，3张 41，4张12.如果自己是发牌的第1张，选择“1张21”表示第2家最大，第1家次大.如果自己是发牌的第2张，选择“2张31”表示第3家最大第1家次大。注意:第1轮开始报！
        """,
            85: """
                        特殊牌选择看牌。看自己手里的第一张牌，根据色牌发牌，报下轮最大位置。会报4个结果，根据自己的第一张牌是发牌中的第几张选择一个结果。
                比如报:1张2，2张3，3张4，4张1.如果自己是发牌的第1张，选择“1张2”表示下轮位置2最大如果自己是发牌的第2张，选择“2张3”表示下轮位置3最大
                
        """,
            86: """
                        特殊牌选择看牌。看自己手里的第一张牌，根据色牌发牌，报下轮最大次大位置。会报4个结果，根据自己的第一张牌是发牌中的第几张选择一个结果。比如报:1张 21，2张 32，3张41，4张12.如果自己是发牌的第1张，选择“1张21”表示下轮位置2最大，位置1次大，如果自己是发牌的第2张，选“2张32”表示下轮位置3最大，位置2次大
        """,
            87: """
                        特殊牌选择看牌。看自己手里的第一张牌，根据色牌发牌，报下轮最大次大位置和生死门。
                会报4个结果，根据自己的第一张牌是发牌中的第几张选择一个结果。比如报:1张 212，2张322，3张410，4张 120.
                如果自己是发牌的第1张，选择“1张212”表示下轮位置2最大，位置1次大，活门2如果自己是发牌的第2张，选择“2张322”表示下轮位置3最大，位置2次大，活门2......
                
                
        """,
            88: """
                        特殊牌选择看牌。看自己手里的第一张牌，根据色牌发牌，报下轮最大位置。会报4个结果，根据自己的第一张牌是发牌中的第几张选择今个结果比如报:1张2，2张 3，3张4，4张1.如果自己是发牌的第1张，选择“1张2”表示下轮位置2最大。如果自己是发牌的的第2张，选择“2张3”表示下轮位置3最大......
        """,
            89: """
                        特殊牌选择看牌。看自己手里的第一张牌，根据色牌发牌，报下轮最大次大位置。
                会报 4个结果，根据自己的第一张牌是发牌中的第几张选择一个结果比如报:1张 21，2张 32，3张 41，4张12.如果自己是发牌的第1张，选择“1张 21”表示下轮位置 2最大，位置1次大如果自己是发牌的第2张，选择“2张32”表示下轮位置3最大，位置2次大
                

        """,
            90: """
                        特殊牌选择看牌。看自己手里的第一张牌，根据色牌发牌，报下轮最大次大位置和生死门。会报4个结果，根据自己的第一张牌是发牌中的第几张选择一个结果。
                        比如报:1张 212，2张 322，3张 410，4张120.
                        如果自己是发牌的第1张，选择“1张212”表示下轮位置2最大，位置1次大，活门2.如果自己是发牌的第2张，选择“2张322”表示下轮位置3最大，位置2次大，活门2
        """,
            91: """
        比如:报 1，2=发牌的第1轮的第2张和第3张交换，可保位置最大。报 1，2;2，3=发牌的第1轮的第2张和第3张交换，第2轮的第3张和第4张交换。可保位置最大。
        """,
            92: """
        比如:报1，2=发牌的第1轮的第2张和第3张交换，可保位置最小。报1，2;2，3=发牌的第1轮的第2张和第3张交换，第2轮的第3张和第4张交换。可保位置最小
        """,
            93: """
        特殊牌选择看色，识别色牌后放回原处牌堆不变。若同时选择先看底/看顶，则是第一次看顶/看底，第二次看色后再报牌。如果需要直接看底打色作为色牌，使用【216】底为色报法。
        比如报1，2=发牌的第1轮的第2张和第3张交换，可保位置最大。报 1，2；2，3发牌的第1轮的第2张和第3张交换，第2轮的第3张和第4张交换。可保位置最大
        """,
            94: """
        特殊牌选择看色，识别色牌后放回原处牌堆不变。若同时选择先看底/看顶，则是第一次看顶/看底，第二次看色后再报牌。如果需要直接看底打色作为色牌，使用【217】底为色报法。
        比如:报 1，2=发牌的第1轮的第2张和第3张交换，可保位置最小。报 1，2;2，3=发牌的第1轮的第2张和第 3张交换，第2轮的第3张和第4张交换。可保位置最小
        """,
            95: """
        特殊牌选择看色，识别色牌后放回原处牌堆不变。若同时选择先看底/看顶，则是第一次看顶/看底，第二次看色后再报牌。
        去掉色牌本身。比如:报1，2=发牌的第1轮的第2张和第3张交换，可保位置最大。报1，2;2，3=发牌的第1轮的第2张和第3张交换，第2轮的第3张和第4张交换。可保位置最大
        """,
            96: """
        特殊牌选择看色，识别色牌后放回原处牌堆不变。若同时选择先看底/看顶，则是第一次看顶/看底，第二次看色后再报牌。
        去掉色牌本身。比如:报1，2=发牌的第1轮的第2张和第3张交换，可保位置最小。报1，2;2，3=发牌的第1轮的第2张和第3张交换，第2轮的第3张和第4张交换。可保位置最小
        """,
            97: """
        特殊牌选择看色，识别色牌后放回原处牌堆不变。若同时选择先看底/看顶，则是第一次看顶/看底，第二次看色后再报牌。如果需要直接看底打色作为色牌，使用【226】底为色报法。
        色牌先发。比如，报1，2=发牌的第1轮的第2张和第3张交换、可保位置最大。报1，2;2，3=发牌的第1轮的第2张和第3张交换，第2轮的第3张和第 4张交换。可保位置最大
        """,
            98: """
        特殊牌选择看色，识别色牌后放回原处牌堆不变。若同时选择先看底/看顶，则是第一次看顶/看底，第二次看色后再报牌。如果需要直接看底打色作为色牌，使用【227】底为色报法。
        色牌先发。比如:报1，2=发牌的第1轮的第2张和第3张交换，可保位置最大。报1，2;2，3=发牌的第1轮的第2张和第3张交换,，第2轮的第3张和第 4张交换。可保位置最小
        """,
            99: """
        骰子打色比如:报 色1，1，2=发牌的第1轮的第2张和第3张交换，可保色=1的情况下位置最大。
                        如果人数=4，会报4个结果，选择其中1个
        """,
            100: """
        特殊牌选择无，面牌为色留色。比如:报 1，2=发牌的第1轮的第2张和第3张交换，可保位置最大。报1，2;2，3=发牌的第1轮的第2张和第3张交换，第2轮的第3张和第4张交换。可保位置最大
        """,
            101: """
        特殊牌选择无，面牌为色留色。比如:报 1，2=发牌的第1轮的第2张和第3张交换，可保位置最小。报1，2;2，3=发牌的第1轮的第2张和第 3张交换，第2轮的第3张和第4张交换。可保位置最小
        """,
            102: """
                特殊牌选择无，面牌为色去掉色牌。比如:报1，2=发牌的第1轮的第2张和第3张交换，可保位置最大。报1，2;2，3=发牌的第1轮的第2张和第3张交换，第2轮的第3张和第4张交换。可保位置最大
        """,
            103: """
                特殊牌选择无，面牌为色去掉色牌。比如:报 1，2=发牌的第1轮的第2张和第3张交换，可保位置最小。报1，2;2，3=发牌的第1轮的第2张和第3张交换，第2轮的第3张和第4张交换。可保位置最小
        """,
            104: """
                特殊牌选择无，底牌为色牌。比如:报 1，2=发牌的第1轮的第2张和第3张交换，可保位置最大。报1，2;2，3=发牌的第1轮的第2张和第3张交换，第2轮的第3张和第4张交换。可保位置最大
        """,
            105: """
                特殊牌选择无，底牌为色牌。比如:报 1，2=发牌的第1轮的第2张和第3张交换，可保位置最小。报1，2;2，3=发牌的第1轮的第2张和第3张交换，第2轮的第3张和第 4张交换。可保位置最小
        """,
            106: """
                        特殊牌选择无，底2张相加为色:比如底2张是7和9。7+9=16，最终色=16-10=6点。比如:报1，2=发牌的第1轮的第2张和第3张交换，可保位置最大。报 1，2;2，3=发牌的第1轮的第2张和第3张交换，第2轮的第3张和第4张交换，可保位置最大
        """,
            107: """
        切牌选不切牌， 特殊牌选看色牌，比如:报 1，2=发牌的第1轮的第2张和第3张交换，可保位置最大。报 1，2;2，3=发牌的第1轮的第2张和第3张交换，第2轮的第3张和第4张交换。可保位置最大
        """,
            108: """
        XY设定切牌范围。比如设定X=1，Y=10报 5，6。表示10种切牌情况共有5个对子，6家平点。
        """,
            109: """
        比如X=1 Y=10 报3，80%表示在1到10张内切牌，位置3拿最大牌概率是80%
        """,
            110: """
        比如X=1，Y=10报3，80%表示在1到10张内切牌，位置3拿最大次大概率是80%

        """,
            111: """
        比如报15 18，表示在第15张或16张或17张或18张处切牌，指定的2个玩家中必有一个拿到最大牌。指定2个玩家由打色范围的XY设定。X=1 Y=3 表示玩家1和玩家3
        """,
            112: """
        报 15 18，表示在第15张或16张或17张或18张处切牌，可保位置3是活门。请把打色范围Y修改为 54.
        """,
            113: """
        报 15 18 3表示在第15张或16张或17张或18张处切牌，可保位置3是死门，请把打色范围Y修改为 54。
        """,
            114: """
        报 15 18 表示在第 15张或16张或17张或18张处切牌，可保位置是活门。请把打色范围Y修改为 54.
        """,
            115: """
        报 15 18 表示在第 15张或16张或17张或18张处切牌，可保位置是死门。请把打色范围Y修改为 54.
        """,
            116: """
        报 15 18，表示在第15张或16张或17张或18张处切牌，可保位置最小次小。请把打色范围Y修改为 54.
        """,
            117: """
        报 15 18，表示在第15张或16张或17张或18张处切牌，切牌后的面牌为色，去掉色牌再发牌，可保位置最大次大。请把打色范围Y修改为54.
        """,
            118: """
        报 15 18,表示在第15张或16张或17张或18张处切牌，切牌后的面牌为色，色牌先发，可保位置最大次大。请把打色范围Y修改为 54
        """,
            119: """
        报 15 18，表示在第15张或16张或17张或18张处切牌，可保位置最大。请把打色范围Y修改为54.
        """,
            120: """
        报 15 18，表示在第15张或16张或17张或18张处切牌，可保位置最大次大。请把打色范围Y修改为 54.
        """,
            121: """
        报 15,19=第15张到19张都可用来打色，可保位置最大。打色范围可由XY参数修改，默认是X=1,Y=10,一般修改为X=1.Y=54,整幅牌里面查找打色牌
        """,
            122: """
        报 15,19=第15张到19张都可用来打色，可保位置最大次大。打色范围可由XY参数修改，默认是X=1，Y=10,一般修改为X=1.Y=54,整幅牌里面查找打色牌
        """,
            123: """
        色牌和色牌上部分的牌补到底部，报15,19=第15张到19张都可用来打色，可保位置最大。打色范围可有参数X，Y修改，默认是X=1，Y=10,，一般修改为x=1，y=54,整幅牌里面查找打色牌
        """,
            124: """
        色牌和色牌上部分的牌补到底部，报15,19=第15张 到19张都可用来打色，可保位置最大次大。打色范围可由XY参数修改，默认是X=1,Y=10,一般修改为 X=1.Y=54,整幅牌里面查找打色牌
        """,
            125: """
        去掉色牌本身。报 15,19=第15张到19张都可用来打色，可保位置最大。打色范围可由XY参数修改，默认是X=1，Y=10,一般修改为X-1.Y=54,整幅牌里面查找打色牌
        """,
            126: """
        去掉色牌本身。报 15,19 =第15张到19张都可用来打色，可保位置最大次大。打色范围可由XY参数修改，默认是X=1，Y=10,一般修改为X=1.Y=54,整幅牌里面查找打色牌
        """,
            127: """
        色牌先发。报15,19=第15张到19张都可用来打色，可保位置最大。打色范围可由XY参数修改，默认是X=1Y=10,一般修改为X=1.Y=54,整幅牌里面查找打色牌
        """,
            128: """
        色牌先发。报15,19=第15张到19张都可用来打色，可保位置最大次大。打色范围可由XY参数修改，默认是X=1Y=10,一般修改为X=1.Y=54,整幅牌里面查找打色牌
        """,
            129: """
        报 15,19=第15张到19张都可用来打色，可保位置最小。打色范围可由XY参数修改，默认是X=1,Y=10,一般修改为X=1.Y=54,整幅牌里面查找打色牌
        """,
            130: """
                报 15,19=第15张到19张都可用来打色，可保位置最小次小。打色范围可由XY参数修改，默认是 X=1,Y=10。一般修改为X=1.Y=54,整幅牌里面查找打色牌

        """,
            131: """
        色牌和色牌上部分的牌补到底部，报 15,19=第15张到19张都可用来打色，可保位置最小。打色范围可由XY参数修改，默认是X=1.Y=10,般修改为 X=1.Y=54,整幅牌里面查找打色牌
        """,
            132: """
        色牌和色牌上部分的牌补到底部，报15,19第15张 到19张都可用来打色，可保位置最小次小。打色范围可由XY参数修改，默认是X=1,Y=10,A般修改为X=1.Y=54,整幅牌里面查找打色牌
        """,
            133: """
        去掉色牌本报15,19=第15张到19张都可用来打色，可保位置最小。打色范围可由XY参数修改，默认是X = 1，Y = 10,一般修改为X=1.Y=54,整幅牌里面查找打色牌
        """,
            134: """
        去掉色牌本身。报 15,19=第15张到19张都可用来打色，可保位置最小次小。打色范围可由XY参数修改，默认是X=1,Y=10,一般修改为X=1.Y=54 整幅牌里面查找打色牌
        """,
            135: """
        色牌先发。报 15,19=第15张到19张都可用来打色，可保位置最小。打色范围可由XY参数修改，默认是X=1,Y=10,一般修改为 X=1.Y=54,整幅牌里面查找打色牌
        """,
            136: """
        色牌先发。报 15,19=第15张到19张都可用来打色，可保位置最小次小。打色范围可由XY参数修改，默认是X=1.Y=10,一般修改为X=1.Y=54,整幅牌里面查找打色牌
        """,
            137: """
        任意照牌打色后放回原处保位置最大次大，0照牌本身打色留色,上1=照牌上一张打色留色，下1=照牌不一张打色留色。男声=次大，女声=最大。请设定正确的XY值。X=3,Y=3,表示色牌查找范围上3到下3.如果X=6,Y=6等于掉6张打色留色保位置最大次大
        """,
            138: """
        任意照牌打國后放回原处保位置最小次小，0=招牌本身打色留色，上1=照牌上一张打色留色，下1=照牌不一张打色留色。男声=次大，女声=最大。请设定正确的XY值。X=3,Y=3,表示色牌查找范围上3到下3.如果X=6,Y=6等于掉6张打色留色保位置最小次小
        """,
            139: """
        任意照牌牌切到底部。保位置最大次大，0=照牌本身打色去色全部，上1=照牌上一张打色去色全部，下1=照牌下一张打色去色全部.男声=次大，女声=最大。 请设定正确的XY值。X=3,Y=3,表示色牌查找范围上3到下3.如果X=6,Y=0等于掉6张打色去色全部保位置最大次大
        """,
            140: """
        任意照牌牌切到底部。保位置最小次小，0=照牌本身打色去色全部，上1=照牌上一张打色去色全部，下1=照牌下一张打色去色全部,男声=次小女声=最小。请设定正确的XY值，X=3,Y-3,表示色牌查找范围上3到下3.如果X=6,Y-0等于掉6张打色去色全部保位置最小次小
        """,
            141: """
        任意照牌打色后色牌扔掉保位置最大次大，0=照牌本身打色去色1，上1=照牌上一张打色去色1，下1= 照牌下一张打色去色1。.男声=次小,女声=最小。请设定正确的XY值。X=3,Y=3,表示色牌查找范围上3到下3.如果X=6,Y=0等于掉6张打色去色1保位置最大次大
        """,
            142: """
        任意照牌打色后色牌扔掉保位置最小次小，0照牌本身打色去色1,上1=照牌上一张打色去色1，下1= 照牌下一张打色去色1。.男声=次小,女声=最小。请设定正确的XY值。X=3,Y=3,表示色牌查找范围上3到下3.如果X=6,Y=0等于掉6张打色去色1保位置最小次小
        """,
            143: """
        任意照牌打色后色牌先发保位置最大次大，0=照牌本身打色,上1=照牌上一张打色，下1=照牌下一张打色.男声=次大，女声=最大。请设定正确的XY值。X=3,Y=3,表示色牌查找范围上3到下 3.如果X=6,Y=0等于 掉6张打色色先发保位置最大次大
                        
        """,
            144: """
        任意照牌打色后色牌先发保位置最小次小，0=照牌本身打色,上1=照牌上一张打色，下1=照牌下一张打色.男声=次大，女声=最大。请设定正确的XY值。X=3,Y=3,表示色牌查找范围上3到下 3.如果X=6,Y=0等于 掉6张打色色先发保位置最小次小
        """,
            145: """
        设置中特殊牌选择色牌
        打色保位置最大次大，1=照牌打色留色.2=照牌打色去色全部，3=照牌打色去色1张。没有报结果为空.男声=次大，女声=最大第一次打色报 结果为空，可继续打色直到报出有效结果
        """,
            146: """
        设置中特殊牌选择色牌 打色保位置最小次小，1=照牌打色留色,2=照牌打色去色全部，3=照牌打色去色1张。没有报结果为空.男声=次小，女声=最小
        """,
            147: """
        设置中特殊牌选择色牌
        任意切牌为色，报大1=放回从上发保位置最大，报大2=放回从上发保位置次大 报小1=切牌补到底部从上发保位置最大。报小2=切牌补到底部从上发保位置次大。
        """,
            148: """
        指定某张牌为底牌(切牌实现)，报指定牌位置和哪家最大次大。指定牌通过X和Y参数设定:X=花色:1=♠️，2=♥️，3=♣️，4=♦️。Y=数字:1=A,2-2,3-3,4=4,5=5，6=6,7=7,8=8,9+9,10=10，11=J,12=Q,13=K,14=小王,15=大王。比如指定牌是♦️8，设定X=4,Y=8
        """,
            149: """
        指定某张牌为底牌(切牌实现)，报指定牌位置和哪家最大。指定牌通过X和Y参数设定:X=花色:1=♠️，2=♥️，3=♣️，4=♦️。Y=数字:1=A,2-2,3-3,4=4,5=5，6=6,7=7,8=8,9+9,10=10，11=J,12=Q,13=K,14=小王,15=大王。比如指定牌是♦️8，设定X=4,Y=8
        """,
            150: """
        指定某张牌为底牌(切牌实现)，报指定牌位置和哪2家最小次小。指定牌通过X和Y参数设定:X=花色:1=♠️，2=♥️，3=♣️，4=♦️。Y=数字:1=A,2-2,3-3,4=4,5=5，6=6,7=7,8=8,9+9,10=10，11=J,12=Q,13=K,14=小王,15=大王。比如指定牌是♦️8，设定X=4,Y=8
        """,
            151: """
        指定某张牌为底牌(切牌实现)，报指定牌位置和哪家最小,指定牌通过X和Y参数设定:X=花色:1=♠️，2=♥️，3=♣️，4=♦️。Y=数字:1=A,2-2,3-3,4=4,5=5，6=6,7=7,8=8,9+9,10=10，11=J,12=Q,13=K,14=小王,15=大王。比如指定牌是♦️8，设定X=4,Y=8
        """,
            152: """
        指定某张牌类底牌(切牌实现)，报指定牌位置和生死门.指定牌通过X和Y参数设定:X=花色:1=♠️，2=♥️，3=♣️，4=♦️。Y=数字:1=A,2-2,3-3,4=4,5=5，6=6,7=7,8=8,9+9,10=10，11=J,12=Q,13=K,14=小王,15=大王。比如指定牌是♦️8，设定X=4,Y=8
        """,
            153: """
        指定某张牌为顶牌(切牌实现)，报指定牌位置和哪家最大次大。指定牌通过X和Y参数设定:X=花色:1=♠️，2=♥️，3=♣️，4=♦️。Y=数字:1=A,2-2,3-3,4=4,5=5，6=6,7=7,8=8,9+9,10=10，11=J,12=Q,13=K,14=小王,15=大王。比如指定牌是♦️8，设定X=4,Y=8
        """,
            154: """
        指定某张牌为顶牌(切牌实现)，报指定牌位置和哪家最大。指定牌通过X和Y参数设定:X=花色:1=♠️，2=♥️，3=♣️，4=♦️。Y=数字:1=A,2-2,3-3,4=4,5=5，6=6,7=7,8=8,9+9,10=10，11=J,12=Q,13=K,14=小王,15=大王。比如指定牌是♦️8，设定X=4,Y=8
        """,
            155: """
        指定某张牌为预牌(切牌实现)，报指定牌位置和最小次小，指定牌通过X和Y参数设定:X=花色:1=♠️，2=♥️，3=♣️，4=♦️。Y=数字:1=A,2-2,3-3,4=4,5=5，6=6,7=7,8=8,9+9,10=10，11=J,12=Q,13=K,14=小王,15=大王。比如指定牌是♦️8，设定X=4,Y=8
        """,
            156: """
        指定某张牌为顶牌(切牌实现)，报指定牌位置和最小.指定牌通过X和Y参数设定:X=花色:1=♠️，2=♥️，3=♣️，4=♦️。Y=数字:1=A,2-2,3-3,4=4,5=5，6=6,7=7,8=8,9+9,10=10，11=J,12=Q,13=K,14=小王,15=大王。比如指定牌是♦️8，设定X=4,Y=8
        """,
            157: """
        指定某张牌为顶牌(切牌实现)，报指定牌位置和生死门.指定牌通过X和Y参数设定:X=花色:1=♠️，2=♥️，3=♣️，4=♦️。Y=数字:1=A,2-2,3-3,4=4,5=5，6=6,7=7,8=8,9+9,10=10，11=J,12=Q,13=K,14=小王,15=大王。比如指定牌是♦️8，设定X=4,Y=8
        """,
            158: """
        指定某张牌去顶牌(切牌实现)，底牌为色，根据色牌发牌照报指定牌位置和最人次大位置.指定牌通过X和Y参数设定:X=花色:1=♠️，2=♥️，3=♣️，4=♦️。Y=数字:1=A,2-2,3-3,4=4,5=5，6=6,7=7,8=8,9+9,10=10，11=J,12=Q,13=K,14=小王,15=大王。比如指定牌是♦️8，设定X=4,Y=8
        """,
            159: """
        指定某张牌为顶牌(切牌实现)，底牌为色，根据色牌发牌，报指定牌位置和最大位置.指定牌通过X和Y参数设定:X=花色:1=♠️，2=♥️，3=♣️，4=♦️。Y=数字:1=A,2-2,3-3,4=4,5=5，6=6,7=7,8=8,9+9,10=10，11=J,12=Q,13=K,14=小王,15=大王。比如指定牌是♦️8，设定X=4,Y=8
        """,
            160: """
        指定某张牌为顶牌(切牌实现)，底牌为色，根据色牌发牌，报指定牌位置和最小次小位置.指定牌通过X和Y参数设定:X=花色:1=♠️，2=♥️，3=♣️，4=♦️。Y=数字:1=A,2-2,3-3,4=4,5=5，6=6,7=7,8=8,9+9,10=10，11=J,12=Q,13=K,14=小王,15=大王。比如指定牌是♦️8，设定X=4,Y=8
        """,
            161: """
        指定某张牌为顶牌(切牌实现)，底牌为色，根据色牌发牌，报指定牌位置和最小位置,指定牌通过X和Y参数设定:X=花色:1=♠️，2=♥️，3=♣️，4=♦️。Y=数字:1=A,2-2,3-3,4=4,5=5，6=6,7=7,8=8,9+9,10=10，11=J,12=Q,13=K,14=小王,15=大王。比如指定牌是♦️8，设定X=4,Y=8
        """,
            162: """
        指定牌通过X和Y参数设定:X=花色:1=♠️，2=♥️，3=♣️，4=♦️。Y=数字:1=A,2-2,3-3,4=4,5=5，6=6,7=7,8=8,9+9,10=10，11=J,12=Q,13=K,14=小王,15=大王。比如指定牌是♦️8，设定X=4,Y=8。假如指定牌是♦️8，报20，3，4，表示指定牌是在第20张，第19张打色留色，第3家4家是最大次大
        
        """,
            163: """
        指定牌通过X和Y参数设定:X=花色:1=♠️，2=♥️，3=♣️，4=♦️。Y=数字:1=A,2-2,3-3,4=4,5=5，6=6,7=7,8=8,9+9,10=10，11=J,12=Q,13=K,14=小王,15=大王。比如指定牌是♦️8，设定X=4,Y=8。假如指定牌是♦️8，报20，3，4，表示指定牌是在第20张，第19张打色去色全部，第3家4家是最大次大
        """,
            164: """
        指定牌通过X和Y参数设定:X=花色:1=♠️，2=♥️，3=♣️，4=♦️。Y=数字:1=A,2-2,3-3,4=4,5=5，6=6,7=7,8=8,9+9,10=10，11=J,12=Q,13=K,14=小王,15=大王。比如指定牌是♦️8，设定X=4,Y=8。假如指定牌是♦️8，报20，3，4，表示指定牌在第 20张，第21张打色留色，第3家4家是最大次大
        """,
            165: """
        指定牌通过X和Y参数设定:X=花色:1=♠️，2=♥️，3=♣️，4=♦️。Y=数字:1=A,2-2,3-3,4=4,5=5，6=6,7=7,8=8,9+9,10=10，11=J,12=Q,13=K,14=小王,15=大王。比如指定牌是♦️8，设定X=4,Y=8。假如指定牌是♦️8，报20，3，4，表示指定牌是在第20张，第21张打色去色全部，第3家4家是最大次大
        """,
            166: """
        比如金花，设定 Y=3,:报2341。表示发牌方式是111情况，第2家最小。 发牌方式是 12的情况:第3家最小。发牌方式是21的情况，第4家最小。发牌方式是3的情况，第1家最小。拨到中间=拨的最后一张牌做色牌.发牌方式由Y参数设定:
        Y=2:【11，2】
        Y=3:【111,12,21，3】
        Y=4:【1111,112,121,13,211,22,31,4】;
        Y=5:【1112,113,122,131,14 2111 212,221, 23,311，32，41，5;
        Y53:【113,122,131,212,221,311】
        Y=54:【11111 1112 1121113,1211122,13114,2111.212221,23,31132.41】
        Y=55:【23，32，14，41】
        """,
            167: """
                比如金花:Y设定为 3:报2341,表示发牌方式是 111的情况，第2家最大。 发牌方式是12的情况，第3家最大。发牌方式是 21的情况，第4家最大。 发牌方式是 3的情况，第1家最大拨到中间=拨的最后一张牌做色牌发牌方式由Y参数设定:
        Y=2:【11，2】
        Y=3:【111,12,21，3】
        Y=4:【1111,112,121,13,211,22,31,4】;
        Y=5:【1112,113,122,131,14 2111 212,221, 23,311，32，41，5;
        Y53:【113,122,131,212,221,311】
        Y=54:【11111 1112 1121113,1211122,13114,2111.212221,23,31132.41】
        Y=55:【23，32，14，41】
        """,
            168: """
        底牌为色，从上开始发，报哪个位置最大次大，如果选择倒发，相当于中间打色，自色上部分牌翻转过来开始发牌。
        """,
            169: """
        底牌为色，从上开始发，报哪个位置最大，如果选择倒发，相当于中间打色，色上部分牌翻转过来开始发牌。
        """,
            170: """
        底牌为色，从上开始发，报哪个位置最小次小。如果选择倒发，相当于中间打色，色上部分牌翻转过来开始发牌
                
        """,
            171: """
        底牌为色，从上开始发，报哪个位置最小。如果选择倒发，相当于中间打色，色上部分牌翻转过来开始发牌
        """,
            172: """
        底牌为色，从上开始发，报位置排名。如果选择倒发，相当于中间打色，色上部分牌翻转过来开始发牌
        """,
            173: """
        发牌方式由Y参数设定:
        Y=2:【11，2】
        Y=3:【111,12,21，3】
        Y=4:【1111,112,121,13,211,22,31,4】;
        Y=5:【1112,113,122,131,14 2111 212,221, 23,311，32，41，5;
        Y53:【113,122,131,212,221,311】
        Y=54:【11111 1112 1121113,1211122,13114,2111.212221,23,31132.41】
        Y=55:【23，32，14，41】
        比如斗牛:Y设定为5，报 122，按照122方式发牌，可保位置最大次大
        """,
            174: """
        底牌2张相加为色，从上开始发，报哪个位置最大次大 如果选择倒发，相当于中间打色，色上部分牌翻转过来开始发牌，比如 底2张为 10 和5，相加点数和=10+5=15，最终色点数=15-10=5点
                
                
        """,
            175: """
        比如金花:Y设定为3，比如报 1321，4个数字，骰子为1取第一个数=1(发牌方式 111)，骰子为2取第2个数字3(发牌方式 21)，骰子为3取第3个数字 2(发牌方式 12)，骰子为4取第4个数字1(发牌方式 111).发牌方式由丫参数设定:
        Y=2:【11，2】
        Y=3:【111,12,21，3】
        Y=4:【1111,112,121,13,211,22,31,4】;
        Y=5:【1112,113,122,131,14 2111 212,221, 23,311，32，41，5;
        Y53:【113,122,131,212,221,311】
        Y=54:【11111 1112 1121113,1211122,13114,2111.212221,23,31132.41】
        Y=55:【23，32，14，41】
        """,
            176: """
        发牌方式由Y参数设定:
        Y=2:【11，2】
        Y=3:【111,12,21，3】
        Y=4:【1111,112,121,13,211,22,31,4】;
        Y=5:【1112,113,122,131,14 2111 212,221, 23,311，32，41，5;
        Y53:【113,122,131,212,221,311】
        Y=54:【11111 1112 1121113,1211122,13114,2111.212221,23,31132.41】
        Y=55:【23，32，14，41】
        报32=第1轮发3张，第2轮发2张注意:请选择正确的色点设置，比如 底2张为 10 和5，相加点数和=10+5=15，最终色点数=15-10=5点
        """,
            177: """
        面牌为色，从上开始发，报哪个位置最大次大

        """,
            178: """
        面牌为色，从上开始发，报哪个位置最大

        """,
            179: """
        面牌为色，从上开始发，报哪个位置最小次小
        """,
            180: """
        面牌为色，从上开始发，报哪个位置最小
        """,
            181: """
        面牌为色，从上开始发，报位置排名
        """,
            182: """
        面牌为色，去掉色牌，从上开始发，报哪个位置最大次大

        """,
            183: """
        面牌为色，去掉色牌，从上开始发，报哪个位置取大
        """,
            184: """
        面牌为色，去掉色牌，从上开始发，报哪个位置最小次小
        """,
            185: """
        面牌为色，去掉色牌，从上开始发，报哪个位置最小

        """,
            186: """
        面牌为色，去掉色牌，从上开始发，报哪个位置排名
        """,
            187: """
        X=要报的第一张牌的位置。
        人数=要报的扑克张数。
        位置=报的2张牌之间的间隔，
        Y=10:报单张点数
        Y>10:报单张点数+花色
        比如X=1 人数=4 位置=4 Y=10:报1 5 9 13张点数。
        比如X=2 人数=5 位置=1 Y11:报23456张点数+花色
        支持报底 4张 :发牌方式设定为反发。X=1 人数=4 位置=1Y=10
                
                
        """,
            188: """
        X=要报的第一张牌的位置。
        人数=要报的扑克张数。
        位置=报的2张牌之间的间隔，
        Y=10:报单张点数
        Y>10:报单张点数+花色
        比如X=1 人数=4 位置=4 Y=10:报1 5 9 13张点数。
        比如X=2 人数=5 位置=1 Y11:报23456张点数+花色
        支持报底 4张 :发牌方式设定为反发。X=1 人数=4 位置=1Y=10.
        照任意牌，报照的牌后面的4张。报几张由人数参数设定。
        """,
            189: """
        X=要报的第一张牌的位置。
        人数=要报的扑克张数。
        位置=报的2张牌之间的间隔，
        Y=10:报单张点数
        Y>10:报单张点数+花色
        比如X=1 人数=4 位置=4 Y=10:报1 5 9 13张点数。
        比如X=2 人数=5 位置=1 Y11:报23456张点数+花色
        支持报底 4张 :发牌方式设定为反发。X=1 人数=4 位置=1Y=10
        照任意牌，报照的牌和后面的3张。报几张由人数参数设定
        """,
            190: """
        Y=10:报单张点数Y>10:报单张点数+花色
        """,
            191: """
        发牌方式由Y参数设定:
        Y=2:【11，2】
        Y=3:【111,12,21，3】
        Y=4:【1111,112,121,13,211,22,31,4】;
        Y=5:【1112,113,122,131,14 2111 212,221, 23,311，32，41，5;
        Y53:【113,122,131,212,221,311】

        比如斗牛:Y设定为5，报 122，按照122方式发牌，可保位置最大次大
                
                
        """,
            192: """
        发牌方式由参数Y设定:
        Y=2:【11，2】
        Y=3:【111,12,21，3】
        Y=4:【1111,112,121,13,211,22,31,4】;
        Y=5:【1112,113,122,131,14 2111 212,221, 23,311，32，41，5;
        Y53:【113,122,131,212,221,311】
        Y=54:【11111 1112 1121113,1211122,13114,2111.212221,23,31132.41】
        Y=55:【23，32，14，41】
        比如斗牛:Y设定为 5，报 122，按照122方式发牌，可保位置最小次小
        """,
            193: """
        去掉多少张牌由参数Y设定。默认Y=10,请修改为 Y=14.
        """,
            194: """
        去掉多少张牌由参数Y设定。默认Y=10,请修改为 Y=14.

        """,
            195: """
        去掉多少张牌由参数Y设定。默认Y=10,请修改为 Y=14.

        """,
            196: """
        去掉多少张牌由参数Y设定。默认Y=10,请修改为 Y=14.

        """,
            197: """
        去掉多少张牌由参数Y设定。默认Y=10,请修改为 Y=14、

        """,
            198: """
        去掉多少张牌由参数Y设定。默认Y=10,请修改为Y=14.去掉14张牌后，如果第14张是2点,那么再去掉2张面牌，报哪家最大

        """,
            199: """
        去掉多少张牌由参数Y设定。默认Y=10,请修改为 Y=14.去掉14张牌后，如果第14张是2点，那么再去掉2张面牌，报哪家最小
        """,
            200: """
        去掉面牌和底牌，两张牌相加的点数为几点，就去掉面上几张牌，报出最大次大.
        注意 10点以上取个位数，比如两张牌相加为13点，只需去3张牌。比如 面牌 J,底牌=Q, J+Q=23点，23-20=3点，去掉3张牌。
        有对子或同点用男声报如果最大家同点需要报最大两家和次大
        """,
            201: """
        比如报4231，表示去掉6张时以6为色，位置比如报较4最大、去掉7张时以7为色，位置2最大，去掉8张时以8为色位置3最大，去掉9张时以9为色，位置1最大
        """,
            202: """
        报下家大于9的牌，上家炸弹。910 JQKA王，Y=9,报大于9的牌。Y=10,报大于10的牌
        """,
            203: """
        每人先发一张牌，哪家牌点数最大，后续牌从最大家继续发。报哪家最大次大。拿第一张牌的定义为第1家
        """,
            204: """
        每人先发一张牌，哪家牌点数最大，后续牌从最大家继续发。报哪家最大。拿第一张牌的定义为第1家
        """,
            205: """
        每人先发一张牌，哪家牌点数最小，后续牌从最小家继续发。报哪家最大。拿第一张牌的定义为第1家
        """,
            206: """
        每人先发一张牌，哪家牌点数最小，后续牌从最小家继续发。报哪家最大次大。拿第一张牌的定义为第1家
        """,
            207: """
        每人先发一张牌，哪家牌点数最大，后续牌从最大家继续发。通过飞张 保庄家最大次大。拿第一张牌的定义为第1家
        X=1:保位置最大次大
        X>1:保位置最大
        庄家=每人先发一张牌，哪家牌点数最大为庄家
        """,
            208: """
        每人先发一张牌，哪家牌点数最小，后续牌从最小家继续发。通过飞张，保庄家最大次大。拿第一张牌的定义为第1家。
        X=1:保位置最大次大
        X>1:保位置最大
        庄家=每人先发一张牌，哪家牌点数最大为庄家
        """,
            209: """
        每人先发一张牌，哪家牌点数最大，大家继续发报各家点数。明牌最大的那家定义为第1家。
        牛牛专用，比如4个玩家，报10，8，0，2表示第一家牛10，第2家牛8，第3家无牛，第4家牛2.
        """,
            210: """
        洗看底后报位置参数指定的玩家手里的牌。位置参数变化后，再报当前位置指定的玩家的牌。比如洗看底时，位置=4，报第4家的手里的牌调位置=1，报玩家1手里的牌。X=1报单张的点数。X>1报单张的点数和花色
        """,
            211: """
        如果不能看底，设定切牌设置=看手牌，选择好看的是第几张。先报各玩家手里的牌，照任意牌，报该牌的后续4张。
        X=1报单张的点数。
        X>1 报单张的点数和花色
        """,
            212: """
        切的牌不补到底部。比如切牌=黑桃 A,报12,42.表示^A上部分的牌有12张。下部分的牌有42张
        """,
            213: """
        看色牌，放回原处。根据色牌发牌，保位置最大报去掉多少张面牌，
        """,
            214: """
        看色留色+色牌上X张为色报最大次大
        Y=10:2张色牌点数相加如果为 16，色点就为 6.
        Y=20:2张色牌点数相加如果为 16，色点就为 16.
        """,
            215: """
        看色牌(第1张色牌)，色牌下面查找第2张色牌，第1张色牌和第2张色牌点数和为最终色点，
        根据最终色点发牌，保位置最大最终色点计算规则:
        比如2张色牌为10，5，
        Y=10 情况下:最终色点=10 +5 =15-10=5
        Y 不等于 10情况下:最终色点= 10 +5 =15
        报牌张数 =1:报第2张色牌位置+2张色牌点数。比如报5、2:第2张色牌是第5张，且点数-2点。
        报牌张数>1: 报第2张色牌位置。比如报牌张数=3.报 2,3.4:第2张色牌可以是第2张或3张或4张
        """,
            216: """
        报哪个位置看色牌，放回原处。根据色牌发牌，报哪个位置最大

        """,
            217: """
        看色牌，放回原处。根据色牌发牌，报哪个位置最大次大
        """,
            218: """
        根据色牌发牌，报哪个位置最小
        """,
            219: """
        看色牌，放回原处。根据色牌发牌，报哪个位置最小次小

        """,
            220: """
        看色牌，放回原处。根据色牌发牌，报哪个位置排名

        """,
            221: """
        又名【切牌为色报最大】:照色牌，去掉色牌和色牌上面部分。报哪家最大。Y=1:色牌和色牌上部分的牌补到底部。Y>1色牌和色牌上部分的牌不补到底部。
        """,
            222: """
        又名【切牌为色报最大次大】:照色牌，去掉色牌和色牌上面部分。报哪家最大。Y=1:色牌和色牌上部分的牌补到底部。Y>1色牌和色牌上部分的牌不补到底部。
        """,
            223: """
        又名【切牌为色报最小】:照色牌，去掉色牌和色牌上面部分。报哪家最大。Y1:色牌和色牌上部分的牌补到底部。Y>1色牌和色牌上部分的牌不补到底部。
        """,
            224: """
        又名【切牌为色报最小次小】:照色牌，去掉色牌和色牌上面部分。报哪家最大。Y=1:色牌和色牌上部分的牌补到底部。Y>1色牌和色牌上部分的牌不补到底部。
        """,
            225: """
        又名【切牌为色报最排名】:照色牌，去掉色牌和色牌止面部分。报哪家最大。Y1:色牌和色牌上部分的牌补到底部。Y>1色牌和色牌上部分的牌不补到底部。
        """,
            226: """
        固定第几张牌通过Y参数设定

        """,
            227: """
        固定第几张牌通过Y参数设定

        """,
            228: """
        固定第几张牌通过Y参数设定
                
        """,
            229: """
        固定第几张牌通过Y参数设定。

        """,
            230: """
        比如金花:Y设定为 3:报 2341,表示发牌方式是111的情况，第2家最大。发牌方式是12的情况，第3家最大。发牌方式是21的情况，第4家最大。 发牌方式是3的情况，第1家最大，发牌方式由Y参数设定:
        Y=2:【11，2】
        Y=3:【111,12,21，3】
        Y=4:【1111,112,121,13,211,22,31,4】;
        Y=5:【1112,113,122,131,14 2111 212,221, 23,311，32，41，5;
        Y53:【113,122,131,212,221,311】
        Y=54:【11111 1112 1121113,1211122,13114,2111.212221,23,31132.41】
        Y=55:【23，32，14，41】
        """,
            231: """
        比如金花:Y设定为 3:
                报2341,表示发牌方式是 111的情况，第2家最小。发牌方式是12的情况，第3家最小。发牌方式是 21的情况，第4家最小。 发牌方式是3的情况，第1家最小。发牌方式由Y参数设定:
        Y=2:【11，2】
        Y=3:【111,12,21，3】
        Y=4:【1111,112,121,13,211,22,31,4】;
        Y=5:【1112,113,122,131,14 2111 212,221, 23,311，32，41，5;
        Y53:【113,122,131,212,221,311】
        Y=54:【11111 1112 1121113,1211122,13114,2111.212221,23,31132.41】
        Y=55:【23，32，14，41】
        """,
            232: """
        第10张牌处别牌，切掉的牌补翻底部。报哪个位置最大。固定第几张牌通过Y参数设定

        """,
            233: """
        第10张牌处切牌，切掉的牌补到底部。报哪个位置最大次大。固定第几张牌通过Y参数设定，

        """,
            234: """
        第10张牌处切牌，切掉的牌补到底部。报哪个位置最小。固定第几张牌通过Y参数设定。
        """,
            235: """
        第10张牌处切牌，切掉的牌补到底部。报哪个位置最小次小。固定第几张牌通过Y参数设定。
        """,
            236: """
        第10张牌处切牌，切掉的牌补到底部。报排名。固定第几张牌通过Y参数设定。

        """,
            237: """
        比如金花:Y设定为 3:报2341,表示发牌方式是 111的情况，第2家最大。发牌方式是12的情况，第3家最大。发牌方式是 21的情况，第4家最大。 发牌方式是3的情况，第1家最大。发牌方式由Y参数设定:
        Y=2:【11，2】
        Y=3:【111,12,21，3】
        Y=4:【1111,112,121,13,211,22,31,4】;
        Y=5:【1112,113,122,131,14 2111 212,221, 23,311，32，41，5;
        Y53:【113,122,131,212,221,311】
        Y=54:【11111 1112 1121113,1211122,13114,2111.212221,23,31132.41】
        Y=55:【23，32，14，41】
        """,
            238: """
        比如金花:Y设定为 3:报2341,表示发牌方式是 111的情况，第2家最小。发牌方式是12的情况，第3家最小。发牌方式是 21的情况，第4家最小。 发牌方式是 3的情况，第1家最小。发牌方式由Y参数设定
        Y=2:【11，2】
        Y=3:【111,12,21，3】
        Y=4:【1111,112,121,13,211,22,31,4】;
        Y=5:【1112,113,122,131,14 2111 212,221, 23,311，32，41，5;
        Y53:【113,122,131,212,221,311】
        Y=54:【11111 1112 1121113,1211122,13114,2111.212221,23,31132.41】
        Y=55:【23，32，14，41】

        """,
            239: """
        固定去几张牌通过Y参数设定

        """,
            240: """
        从第几门开始发牌可以保庄家最大

        """,
            241: """
        比如斗牛:Y设定为 5，报 122 3，按照122方式发牌，可保有2家同点3家不同点，且没有9
                点.第3家最小发牌方式由Y参数设定:
        Y=2:【11，2】
        Y=3:【111,12,21，3】
        Y=4:【1111,112,121,13,211,22,31,4】;
        Y=5:【1112,113,122,131,14 2111 212,221, 23,311，32，41，5;
        Y53:【113,122,131,212,221,311】
        Y=54:【11111 1112 1121113,1211122,13114,2111.212221,23,31132.41】
        Y=55:【23，32，14，41】
        """,
            242: """
        发牌方式由Y参数设定:
        Y=2:【11，2】
        Y=3:【111,12,21，3】
        Y=4:【1111,112,121,13,211,22,31,4】;
        Y=5:【1112,113,122,131,14 2111 212,221, 23,311，32，41，5;
        Y53:【113,122,131,212,221,311】
        Y=54:【11111 1112 1121113,1211122,13114,2111.212221,23,31132.41】
        Y=55:【23，32，14，41】
        比如斗牛:Y设定为 5，报 122，按照122方式发牌，可保位置最大次大
        """,
            243: """
        发牌方式由Y参数设定:
        Y=2:【11，2】
        Y=3:【111,12,21，3】
        Y=4:【1111,112,121,13,211,22,31,4】;
        Y=5:【1112,113,122,131,14 2111 212,221, 23,311，32，41，5;
        Y53:【113,122,131,212,221,311】
        Y=54:【11111 1112 1121113,1211122,13114,2111.212221,23,31132.41】
        Y=55:【23，32，14，41】
        比如斗牛:Y设定为 5，报 122，按照122方式发牌，可保位置最大
        """,
            244: """
        报3、6张，5、3张=当前段位中位置3有6张牌满足，位置5有3张牌满足。X=段位开始位置，位置=要报的段位。固定10张牌为1个段位
        """,
            245: """
        X= 段位开始Y=段位结束
        位置=总段位数。
        比如X=13,Y=42,位置=5:总共5个段位，第一个段位 13-18，第2个段位 19-24，第3个段位25-30，第4个段位 31-36，第5个段位37-42。
        报43245，表示第1个段位 活门是4，第2个段位活门是3，第3个段位活门是2，第4个段会位活门是 4，第5个段位活门是 5
        """,
            246: """
        先报哪儿切牌可以保当前位置是死门，手动调位置之后，继续报在哪儿切牌可保修改后的位置是死门
        """,
            247: """
        如当前设置人数为4，报5,4则发5门牌可保第4门最大次大，报6，5，则发6门可保第5门是最大次大报出的门数只能大于或等于原有门数女声=最大。男声=次大
        """,
            248: """
        比如报2，表示抽2次底牌面牌抽第1次把右手的底牌面牌放到左手，抽第2次继续把右手的底牌面牌放到左手，右手剩下牌的底牌为色牌，再把左手的牌补到又手牌的底部，根据色牌发牌，可保位置最大最大抽牌次数用Y参数设定
        """,
            249: """
        临时测试报法泌如果人数=4就是 看第4张脾报最4就是,看第5张牌报最如果米h
                        
        """,
            250: """
        临时测试报法， 如果人数=4，就是 看第 4张牌报大次大。 如果人数=5，就是 看第 5张牌报最大次大
        """,
        
        251: """
""",
        252: """
""",
        253: """
    特殊牌选择无，面牌为色留色。色牌先发。比如:报 1，2=发牌的第1轮的第2张和第3张交换，可保位置最大。报1，2;2，3=发牌的第1轮的第2张和第3张交换，第2轮的第3张和第4张交换。可保位置最大
    """,
        254: """
    特殊牌选择无，面牌为色留色。色牌先发。比如:报 1，2=发牌的第1轮的第2张和第3张交换，可保位置最小。报1，2;2，3=发牌的第1轮的第2张和第 3张交换，第2轮的第3张和第4张交换。可保位置最小
    """,
        255: """
            特殊牌选择无，面牌为色去掉色牌。色牌先发。比如:报1，2=发牌的第1轮的第2张和第3张交换，可保位置最大。报1，2;2，3=发牌的第1轮的第2张和第3张交换，第2轮的第3张和第4张交换。可保位置最大
    """,
        256: """
            特殊牌选择无，面牌为色去掉色牌。色牌先发。比如:报 1，2=发牌的第1轮的第2张和第3张交换，可保位置最小。报1，2;2，3=发牌的第1轮的第2张和第3张交换，第2轮的第3张和第4张交换。可保位置最小
    """,
        257: """
            特殊牌选择无，底牌为色牌。色牌先发。比如:报 1，2=发牌的第1轮的第2张和第3张交换，可保位置最大。报1，2;2，3=发牌的第1轮的第2张和第3张交换，第2轮的第3张和第4张交换。可保位置最大
    """,
        258: """
            特殊牌选择无，底牌为色牌。色牌先发。比如:报 1，2=发牌的第1轮的第2张和第3张交换，可保位置最小。报1，2;2，3=发牌的第1轮的第2张和第3张交换，第2轮的第3张和第 4张交换。可保位置最小
    """,
        259:"""
        特殊牌选无，底2张相加为色:比如底2张是7和9。7+9=16，最终色=16-10=6点。比如:报1，2=发牌的第1轮的第2张和第3张交换，可保位置最大。报 1，2;2，3=发牌的第1轮的第2张和第3张交换，第2轮的第3张和第4张交换，可保位置最大
""",
        260:"""
        切牌选不切牌， 特殊牌选看色牌

"""
        
    ]
    
    static func cutRankConvert(cutNumSetting: Int, singlefeatureIndex: Int)->Int{
        var newSingleFeatureRank:Int = 0
        let singlefeatureRank = singlefeatureIndex % 13
        let singlefeatureSuit = singlefeatureIndex / 13
        switch cutNumSetting{
        //"点数打色, J = 11, Q = 12, K = 13, 王 = 6"
        case 0:
            if singlefeatureIndex == 53 || singlefeatureIndex == 54{
                newSingleFeatureRank = 6
                
            } else {
                newSingleFeatureRank = singlefeatureRank + 1
            }
            break
        //"点数打色, J = 1, Q = 2, K = 3，王 = 6"
        case 1:
            if singlefeatureIndex == 53 || singlefeatureIndex == 54{
                newSingleFeatureRank = 6
            } else if singlefeatureRank >= 10{
                newSingleFeatureRank = (singlefeatureRank + 1) % 10
            } else {
                newSingleFeatureRank = singlefeatureRank + 1
            }
            break
        //点数打色, J = 1, Q = 2, K = 1, 王 = 1
        case 2:
            if singlefeatureIndex == 53 || singlefeatureIndex == 54{
                newSingleFeatureRank = 1
            } else if singlefeatureRank == 10 || singlefeatureRank == 12{
                newSingleFeatureRank = 1
            } else if singlefeatureRank == 11 {
                newSingleFeatureRank = 2
            } else {
                newSingleFeatureRank = singlefeatureRank + 1
            }
            break
        //点数打色, J = 4, Q = 3, K = 2, 王 = 1
        case 3:
            if singlefeatureIndex == 53 || singlefeatureIndex == 54{
                newSingleFeatureRank = 1
            } else if singlefeatureRank >= 10{
                newSingleFeatureRank = 4 - singlefeatureRank % 10
            } else {
                newSingleFeatureRank = singlefeatureRank + 1
            }
            break
        //花色打色, 黑 = 1，红 = 2，梅 = 3，方 = 4
        case 4:
            newSingleFeatureRank = singlefeatureSuit + 1
            break
        //花色打色, 黑 = 4，红 = 3，梅 = 2，方 = 1
        case 5:
            newSingleFeatureRank = 4 - singlefeatureSuit
            break
        default:
            break
        }
        
        return newSingleFeatureRank
    }
    
    //将rank相同的玩家放在同一个int数组中
    //默认input都是从大到小
    static func extractWinnerSet(inputInfo:[DatasetReturnRCInfo]) -> [[DatasetReturnRCInfo]] {
        var resultList:[[DatasetReturnRCInfo]] = []
        var rankResultList: [DatasetReturnRCInfo] = [inputInfo[0]]
        for index in 1..<inputInfo.count {
            if inputInfo[index].rcRank == inputInfo[index - 1].rcRank {
                rankResultList.append(inputInfo[index])
            } else {
                resultList.append(rankResultList)
                rankResultList = [inputInfo[index]]
            }
            if index == inputInfo.count - 1 {
                resultList.append(rankResultList)
            }
        }
        return resultList
    }
    
    
    
    static func GetSingleFeatureRank(reportRule:ReportClass, cutNumSetting: Int, cutNumRangeSetting: [Int], inputSingleFeatures: [Int], singlefeatureIndex: Int, specialSingleFeaturePos: Int,upDownID: Int, cutStructList: [cutStruct]) -> (Int, [Int]){
        
        //色点设置
        var singlefeatureRank: Int = 0
        var singlefeatureIndex: Int = singlefeatureIndex
        var colorSingleFeatureIndexList: [Int] = []
        //下x张打色
        if upDownID == 1 {
            singlefeatureIndex = inputSingleFeatures.count - singlefeatureIndex - 1
        }
        
        switch reportRule.colorSingleFeaturePos {
            //面牌为色牌
        case 0:
            singlefeatureRank = cutRankConvert(cutNumSetting: cutNumSetting, singlefeatureIndex: inputSingleFeatures[singlefeatureIndex])
            colorSingleFeatureIndexList.append(inputSingleFeatures[singlefeatureIndex])
            break
            //底牌为色牌
        case 1:
            singlefeatureRank = cutRankConvert(cutNumSetting: cutNumSetting, singlefeatureIndex: inputSingleFeatures[inputSingleFeatures.count - 1])
            colorSingleFeatureIndexList.append(inputSingleFeatures[inputSingleFeatures.count - 1])
            break
            //2，飞2张两张牌和为色
        case 2:
            break
            //3，底两张和为色
        case 3:
            let singlefeatureRank1 = cutRankConvert(cutNumSetting: cutNumSetting, singlefeatureIndex: inputSingleFeatures[inputSingleFeatures.count - 1])
            let singlefeatureRank2 = cutRankConvert(cutNumSetting: cutNumSetting, singlefeatureIndex: inputSingleFeatures[inputSingleFeatures.count - 2])
            
            colorSingleFeatureIndexList.append(inputSingleFeatures[inputSingleFeatures.count - 1])
            colorSingleFeatureIndexList.append(inputSingleFeatures[inputSingleFeatures.count - 2])
            
            singlefeatureRank = (singlefeatureRank1 + singlefeatureRank2) % 10
            
            break
            //4，底牌+打色的牌为色
        case 4:
            singlefeatureRank = (cutRankConvert(cutNumSetting: cutNumSetting, singlefeatureIndex: inputSingleFeatures[singlefeatureIndex]) + cutRankConvert(cutNumSetting: cutNumSetting, singlefeatureIndex: inputSingleFeatures[inputSingleFeatures.count - 1])) % 10
            
            colorSingleFeatureIndexList.append(inputSingleFeatures[singlefeatureIndex])
            colorSingleFeatureIndexList.append(inputSingleFeatures[inputSingleFeatures.count - 1])
            break
            //去色一张+提前去掉的牌为色
        case 5:
            break
            //指定牌上一张为色
        case 6:
            var colorSingleFeaturePos: Int = specialSingleFeaturePos - 1
            if specialSingleFeaturePos == 0{
                colorSingleFeaturePos = inputSingleFeatures.count - 1
            }
            singlefeatureRank = cutRankConvert(cutNumSetting: cutNumSetting, singlefeatureIndex: inputSingleFeatures[colorSingleFeaturePos])
            colorSingleFeatureIndexList.append(inputSingleFeatures[colorSingleFeaturePos])
            break
            //指定牌下一张为色
        case 7:
            var colorSingleFeaturePos: Int = specialSingleFeaturePos + 1
            if specialSingleFeaturePos == inputSingleFeatures.count - 1{
                colorSingleFeaturePos = 0
            }
            singlefeatureRank = cutRankConvert(cutNumSetting: cutNumSetting, singlefeatureIndex: inputSingleFeatures[colorSingleFeaturePos])
            colorSingleFeatureIndexList.append(inputSingleFeatures[colorSingleFeaturePos])
            break
            //固定第Y张牌为色
        case 8:
            singlefeatureRank = cutRankConvert(cutNumSetting: cutNumSetting, singlefeatureIndex: inputSingleFeatures[cutNumRangeSetting[1] - 1])
            colorSingleFeatureIndexList.append(inputSingleFeatures[cutNumRangeSetting[1] - 1])
            break
        //面牌为色牌
        case 9:
            singlefeatureRank = cutRankConvert(cutNumSetting: cutNumSetting, singlefeatureIndex: inputSingleFeatures[0])
            colorSingleFeatureIndexList.append(inputSingleFeatures[0])
            break
        //10，切牌后面牌为色
        case 10:
            let colorSingleFeaturePos = (singlefeatureIndex + 1) % inputSingleFeatures.count
            singlefeatureRank = cutRankConvert(cutNumSetting: cutNumSetting, singlefeatureIndex: inputSingleFeatures[colorSingleFeaturePos])
            colorSingleFeatureIndexList.append(inputSingleFeatures[colorSingleFeaturePos])
            break
        //看色，色牌 + 上X张为色
        case 11:
            let cutPos = searchSingleFeaturePos(inputSingleFeatures: inputSingleFeatures, singlefeatureIndex: cutStructList[cutStructList.count - 1].cutcardIndex)
            let colorPos = max(0, cutPos - cutNumRangeSetting[0])
            
            singlefeatureRank = cutRankConvert(cutNumSetting: cutNumSetting, singlefeatureIndex: inputSingleFeatures[colorPos]) + cutRankConvert(cutNumSetting: cutNumSetting, singlefeatureIndex: cutStructList[cutStructList.count - 1].cutcardIndex)
            
            if cutNumRangeSetting[1] == 10 {
                singlefeatureRank = singlefeatureRank % 10
            }
            
            colorSingleFeatureIndexList.append(cutStructList[cutStructList.count - 1].cutcardIndex)
            colorSingleFeatureIndexList.append(inputSingleFeatures[colorPos])
            
            break
        //下XY张打色
        case 15:
            singlefeatureRank = cutRankConvert(cutNumSetting: cutNumSetting, singlefeatureIndex: inputSingleFeatures[inputSingleFeatures.count - 1 - singlefeatureIndex])
            colorSingleFeatureIndexList.append(inputSingleFeatures[inputSingleFeatures.count - 1 - singlefeatureIndex])
            break
        //指定牌去顶，底为色
        case 16:
            var colorSingleFeaturePos: Int = specialSingleFeaturePos - 1
            if specialSingleFeaturePos == 0{
                colorSingleFeaturePos = inputSingleFeatures.count - 1
            }
            singlefeatureRank = cutRankConvert(cutNumSetting: cutNumSetting, singlefeatureIndex: inputSingleFeatures[colorSingleFeaturePos])
            colorSingleFeatureIndexList.append(inputSingleFeatures[colorSingleFeaturePos])
            break
        //17，看牌为色
        case 17:
            let length = cutStructList.count
            singlefeatureRank = cutRankConvert(cutNumSetting: cutNumSetting, singlefeatureIndex: cutStructList[length - 1].cutcardIndex)
            colorSingleFeatureIndexList.append(cutStructList[length - 1].cutcardIndex)
            break
        //18，看牌两次和为色
        case 18:
            singlefeatureRank = (cutRankConvert(cutNumSetting: cutNumSetting, singlefeatureIndex: cutStructList[cutStructList.count - 1].cutcardIndex) + cutRankConvert(cutNumSetting: cutNumSetting, singlefeatureIndex: cutStructList[cutStructList.count - 2].cutcardIndex)) % 10
            colorSingleFeatureIndexList.append(cutStructList[cutStructList.count - 1].cutcardIndex)
            colorSingleFeatureIndexList.append(cutStructList[cutStructList.count - 2].cutcardIndex)
            break

            
        default:
            break
        }
        
        return (singlefeatureRank, colorSingleFeatureIndexList)
    }
    static func searchSingleFeaturePos(inputSingleFeatures: [Int], singlefeatureIndex: Int) -> Int{
        
        for pos in 0..<inputSingleFeatures.count {
            if inputSingleFeatures[pos] == singlefeatureIndex {
                return pos
            }
        }
        return -1
    }
    
    struct SingleReportResultInfo{
        
        //都存一轮的结果
        
        //第几张保位置最大最小
        var singlefeatureIndexToConfirmMaxMin: [[Int]] = []
        //第几张保位置活门
        var singlefeatureIndexToConfirmAliveDeath: [[Int]] = []
        //活门2，4(下，上）
        var aliveNumber: Int = 0
        //看手牌的 aliveNumber List
        var handCardAliveNumberList: [Int] = []
        //保XY门最大/最小，X 还是 Y最大/小
        var XorYMax: [[Int]] = []
        //有牛牛的rcID
        var BullBullRCID: [Int] = []
        //指定牌位置
        var specialSingleFeaturePos: Int = -1
        //报最大最小次打次小等目标集合
        var targetRCList: [[Int]] = []
        //每轮有无平点
        var hasDrawPoint: Int = -1
        //每轮的平点类型
        //1,平点，2杂平点，3双平点，4三平点
        var drawType: Int = 0
        //平点大小
        var drawSize: String = ""
        //平点的第一个ID
        var drawID : Int = 0
        //每轮几个对子
        var pairNum: Int = 0
        //每轮有对子的玩家序号
        var pairIDList: [Int] = []
        //不打几
        var NoColorNum: Int = 0
        //每个玩家的手牌公牌信息
        var RCReturnInfoList: [DatasetReturnRCInfo] = []
        //色牌
        var ColorSingleFeatures:[Int] = []
        //公牌
        var community: [Int] = []
        //无牛或最多一家牛
        var NoBullOrMaxOneBull: Int = 0
        //返回飞二张的结果
        var flyTCSolution: [FlyTCsNode] = []
        //随意混合打色变化
        var randomColorFlag: [Int] = []
        //报4张单张
        var fourCardReport: String = ""
    }
    
    struct MultipleReportResultInfo{
        //单轮结果记录
        var singleResultList: [SingleReportResultInfo] = []
        //保多轮的singlefeatureIndex
        var singlefeatureIndexForMultipleRound: Int = -1
        //保多轮最大最小目标最大最小的轮数 1为第一轮
        var winRoundIndex: [Int] = []
        //多轮对子总数
        var totalPairNum: Int = -1
        //多轮平点点数
        var totalDrawNum: Int = -1
        //最大/最小最多的位置
        var maxWinPosition: Int = -1
        //多轮的播报结果, 每一轮是一个[SpeakResultStruct]
        var reportResult: [[SpeakResultStruct]] = []
        //返回的切牌后的数组
        var returnSingleFeatureArray: [Int] = []
        //反回多轮之后剩余的牌
        var leftSingleFeatures: [Int] = []

        
    }
    
    
    struct FlyTCsNode {
        var X: Int
        var Y: Int
    }
    
    
    static func FlyTCsSolution(rcNum: Int, round: Int, everyDealNum: [Int]) -> [[FlyTCsNode]]{
        
        var returnSolutionSet: [[FlyTCsNode]] = []
        var FlyTCResultMatrix : [[FlyTCsNode]] = []
        var FlyTCResultArray: [FlyTCsNode] = []
        
        for i in 0..<round {
            FlyTCResultMatrix.append([])
            for j in 0..<(rcNum * everyDealNum[i]) {
//                第一轮的第一张, 不飞
                if i == 0 && j == 0 {
                    continue
                }
                FlyTCResultMatrix[i].append(FlyTCsNode(X: i, Y: j))
            }
        }
        //整合矩阵成为一个1*MNarray
        for i in 0..<round {
            FlyTCResultArray = FlyTCResultArray + FlyTCResultMatrix[i]
        }
        //最多飞两次
        //第一次
        for i in 0..<FlyTCResultArray.count {
            returnSolutionSet.append([FlyTCResultArray[i]])
        }
        //第二次
        let combinations = FlyTCResultMatrix.combinations(ofCount: 2)
        for combination in combinations {
            let nodesSet = allCombinations(combination)
            returnSolutionSet += nodesSet
        }
        return returnSolutionSet
    }
    
    static func allCombinations(_ arrays: [[FlyTCsNode]]) -> [[FlyTCsNode]] {
        if arrays.isEmpty {
            return [[]]
        }
        
        var result: [[FlyTCsNode]] = []
        let head = arrays[0]
        let tail = Array(arrays.dropFirst())
        let combinationsOfTail = allCombinations(tail)
        
        for element in head {
            for combination in combinationsOfTail {
                result.append([element] + combination)
            }
        }
        
        return result
    }
    // startIndex, start from 0
    static func LeftDealCardCal(startIndex: Int, diyDealStatus: [[Bool]], diyDealNum:[Int], dealType: Int, handNum: Int, minimumCardsNum: Int) -> Int{
        
        var leftNum: Int = 0
        
        //mo ren mei lun fa yi zhang
        if dealType == 0 {
            leftNum = minimumCardsNum - startIndex
        //zi ding yi fa pai
        } else {
            var currentNum = 0
            
            for i in 0..<diyDealNum.count {
                let num = diyDealNum[i]
                //派牌
                if diyDealStatus[i][0] == true {
                    currentNum += startIndex * num
                    break
                //公牌
                } else if diyDealStatus[i][1] == true {
                    currentNum += num
                //去牌
                } else {
                    currentNum += num
                }
            }
            leftNum = minimumCardsNum - currentNum
        }
        
        return leftNum
    }
    
    static func cutSingleFeatures(inputSingleFeatures: [Int], inputCutStruct: cutStruct, colorTransform: Int) -> [Int]{
        
        let pos = searchSingleFeaturePos(inputSingleFeatures: inputSingleFeatures, singlefeatureIndex: inputCutStruct.cutcardIndex)
        
        var returnSingleFeatures : [Int] = inputSingleFeatures
        //0，看底，1，看顶，2，看色，3，看手
        switch inputCutStruct.cutMode{
        //看底
        case 0:
            returnSingleFeatures = Array(inputSingleFeatures[(pos + 1)...]) + Array(inputSingleFeatures[0...pos])
            break
        //看顶
        case 1:
            //看顶
            var watchSingleFeatureIndexPos = pos + 1
            if pos == inputSingleFeatures.count - 1{
                watchSingleFeatureIndexPos = 0
            }
            print("看顶的位置 \(watchSingleFeatureIndexPos) 底牌的位置 \(watchSingleFeatureIndexPos)")
            returnSingleFeatures = Array(inputSingleFeatures[(pos + 1)...]) + Array(inputSingleFeatures[0...pos])
            break
        //看色
        case 2:
            //留色
            if colorTransform == 0{
            //去色
            } else if colorTransform == 1 {
                returnSingleFeatures = Array(inputSingleFeatures[(pos + 1)...])
            //去色1张
            } else if colorTransform == 2 {
                returnSingleFeatures.remove(at: pos)
            //色先发
            } else if colorTransform == 3{
                let colorSingleFeature = returnSingleFeatures.remove(at: pos)
                returnSingleFeatures = [colorSingleFeature] + returnSingleFeatures
            //切牌
            } else if colorTransform == 4{
                returnSingleFeatures = Array(inputSingleFeatures[(pos + 1)...]) + Array(inputSingleFeatures[0...pos])
            }
            else {
                print("look color error")
            }
            break
        default:
            break
        }
        
        return returnSingleFeatures
    }
    
    
    
    //[[SpeakResultStruct]]--> 每一轮的结果 [
    static func DatasetReporter(DatasetIndex: Int, inputSingleFeatures: [Int], diyDealStatus: [[Bool]], diyDealNum:[Int], newArgs: [Int], rankRules:[Int], suitRules:[Int], reportID: Int, cutNumSetting: Int, cutNumRangeSetting: [Int], targetPos: Int, coloringTypeArg: Int, consecutiveNum: Int, cutStructList: [cutStruct]) -> MultipleReportResultInfo{
        
        //不打色默认正面打色
        var coloringType = coloringTypeArg
        if coloringTypeArg == 2{
            coloringType = 0
        }
        
        let DatasetFunctions:[Int: ([[Bool]],[Int], [Int], [Int], [Int], [Int]) -> ([DatasetReturnRCInfo], [Int])] = [
            0: TP.FindWinner,
            1: PB.FindWinner,
            2: ZJHDataset.FindWinner,
            3: TNDataset.FindWinner,
            4: TMDataset.FindWinner,
            5: TEGDataset.FindWinner,
            6: NPFiveDataset.FindWinner,
            7: BZDataset.FindWinner,
            8: JJBDataset.FindWinner,
            9: CNDataset.FindWinner,
            10: NPDataset.FindWinner,
            11: FCDataset.FindWinner(diyDealStatus:diyDealNum:inputSingleFeatures:args:rankRules:suitRules:),
            12: TCDataset.FindWinner(diyDealStatus:diyDealNum:inputSingleFeatures:args:rankRules:suitRules:),
            13: TCPDataset.FindWinner(diyDealStatus:diyDealNum:inputSingleFeatures:args:rankRules:suitRules:),
            14: TPFiveDataset.FindWinner(diyDealStatus:diyDealNum:inputSingleFeatures:args:rankRules:suitRules:),
            15: CBDataset.FindWinner(diyDealStatus:diyDealNum:inputSingleFeatures:args:rankRules:suitRules:),
            16: TWDataset.FindWinner,
            17: Ain.FindWinner(diyDealStatus:diyDealNum:inputSingleFeatures:args:rankRules:suitRules:),
        ]
        
        let minSingleFeatureFunctions: [Int: (Int, Int, Int, Int,[Int], [[Bool]]) -> Int] = [
            0: TP.getMinSingleFeatureNum,
            1: PB.GetMinSingleFeatureNum,
            2: ZJHDataset.getMinSingleFeatureNum,
            3: TNDataset.getMinSingleFeatureNum,
            4: TMDataset.getMinSingleFeatureNum,
            5: TEGDataset.getMinSingleFeatureNum,
            6: NPFiveDataset.getMinSingleFeatureNum,
            7: BZDataset.getMinSingleFeatureNum,
            8: JJBDataset.getMinSingleFeatureNum,
            9: CNDataset.getMinSingleFeatureNum,
            10: NPDataset.getMinSingleFeatureNum,
            11: FCDataset.getMinSingleFeatureNum,
            12: TCDataset.getMinSingleFeatureNum,
            13: TCPDataset.getMinSingleFeatureNum,
            14: TPFiveDataset.getMinSingleFeatureNum,
            15: CBDataset.getMinSingleFeatureNum,
            16: TWDataset.getMinSingleFeatureNum,
            17: Ain.getMinSingleFeatureNum,
            
        ]
        
        let DatasetFunction = DatasetFunctions[DatasetIndex]
        let DatasetMinSingleFeatureFunction = minSingleFeatureFunctions[DatasetIndex]
            
        var inputSingleFeatures = inputSingleFeatures
                
        //剩余的牌
        var leftSingleFeatures:[Int] = []
        //玩家数量
        let rcNum = newArgs[2]

        //每个位置拿最大次数
        var rcWinTimesDic : [Int:Int] = [:]
        for id in 0..<rcNum {
            rcWinTimesDic[id] = 0
        }
        //指定牌位置
        var specialSingleFeaturePos: Int = -1
        //切每一张牌的目标玩家
        var allReportResult: [[Int]] = []
        
        //装下总结果
        var multipleResultInfo = MultipleReportResultInfo()
        
        //获得一轮最少的牌数(TODO handNum, communityNum)
        let handNum = newArgs[3]
        let communityNum = newArgs[4]
        let minSingleFeatureNum = DatasetMinSingleFeatureFunction!(rcNum, handNum, communityNum, newArgs[0], diyDealNum, diyDealStatus)
        
        //存多轮的第一张牌
        var firstMultiCutFeatures: [Int] = []
        var firstMultiCutRCreturnInfo: [DatasetReturnRCInfo] = []
        var firstMultiCutColorFeatures: [Int] = []
        
        if let reportRule = DetectSettingArgs.allPreSetReportRules[reportID]{
            
            print("切的牌 \(cutStructList)")
            print("当前的牌组 \(inputSingleFeatures)--\(inputSingleFeatures.count)")
            var cutStructList = cutStructList
        //是否切牌的位置，看手牌，切牌留色，切牌去色
            if cutStructList.count > 0  && reportRule.cutSingleFeatureProcession != 6{
                //如果看底看顶先操作
                if cutStructList[cutStructList.count - 1].cutMode == 0 || cutStructList[cutStructList.count - 1].cutMode == 1 {
                    inputSingleFeatures = cutSingleFeatures(inputSingleFeatures: inputSingleFeatures, inputCutStruct: cutStructList[cutStructList.count - 1], colorTransform: -1)
                }
            }
            print("提前操作之后的牌组 \(inputSingleFeatures) --\(inputSingleFeatures.count)")
            leftSingleFeatures = inputSingleFeatures
            multipleResultInfo.returnSingleFeatureArray = inputSingleFeatures


            //看手牌
            if reportRule.cutSingleFeatureProcession == 0{
            
                if cutStructList[cutStructList.count - 1].cutMode == 3{
                    if cutStructList.count < 1 || cutStructList[cutStructList.count - 1].cutMode != 3 {
                        print("看手牌留色，剩余牌 \(leftSingleFeatures)")
                        multipleResultInfo.leftSingleFeatures = leftSingleFeatures
                        return multipleResultInfo
                    }

                    let handSingleFeatureIndex = cutStructList[cutStructList.count - 1].cutcardIndex
                    let pos = searchSingleFeaturePos(inputSingleFeatures: inputSingleFeatures, singlefeatureIndex: handSingleFeatureIndex)
                    if pos == inputSingleFeatures.count - 1 {
                        inputSingleFeatures = [inputSingleFeatures[pos]] + Array(inputSingleFeatures[0..<pos])
                    } else if pos != 0 {
                        inputSingleFeatures = Array(inputSingleFeatures[pos...]) + Array(inputSingleFeatures[0...(pos - 1)])
                    }
                }
            //看色两次, 留色
            } else if reportRule.cutSingleFeatureProcession == 1{
                
                if cutStructList.count < 2 || (cutStructList[cutStructList.count - 1].cutMode != 2 && cutStructList[cutStructList.count - 2].cutMode != 2) {
                    
                    multipleResultInfo.leftSingleFeatures = leftSingleFeatures
                    return multipleResultInfo
                }
                
                for cutStruct in cutStructList{
                    if cutStruct.cutMode == 2 {
                        inputSingleFeatures = cutSingleFeatures(inputSingleFeatures: inputSingleFeatures, inputCutStruct: cutStruct, colorTransform: 0)
                    } else {
                        inputSingleFeatures = cutSingleFeatures(inputSingleFeatures: inputSingleFeatures, inputCutStruct: cutStruct, colorTransform: -1)
                    }
                }
            //看色留色
            } else if reportRule.cutSingleFeatureProcession == 2{
                print("看色留色")
                if cutStructList.count < 1 || cutStructList[cutStructList.count - 1].cutMode != 2 {
                    print("看色留色，剩余牌 \(leftSingleFeatures)")
                    multipleResultInfo.leftSingleFeatures = leftSingleFeatures
                    return multipleResultInfo
                }
                
                for cutStruct in cutStructList{
                    if cutStruct.cutMode == 2 {
                        inputSingleFeatures = cutSingleFeatures(inputSingleFeatures: inputSingleFeatures, inputCutStruct: cutStruct, colorTransform: 0)
                    } else {
                        inputSingleFeatures = cutSingleFeatures(inputSingleFeatures: inputSingleFeatures, inputCutStruct: cutStruct, colorTransform: -1)
                    }
                }
                

            //看色去色
            } else if reportRule.cutSingleFeatureProcession == 3{
                
                if cutStructList.count < 1 || cutStructList[cutStructList.count - 1].cutMode != 2 {
                    multipleResultInfo.leftSingleFeatures = leftSingleFeatures
                    return multipleResultInfo
                }
                
                for cutStruct in cutStructList{
                    if cutStruct.cutMode == 2 {
                        if cutNumRangeSetting[1] > 1{
                            inputSingleFeatures = cutSingleFeatures(inputSingleFeatures: inputSingleFeatures, inputCutStruct: cutStruct, colorTransform: 1)
                            
                        } else {
                            inputSingleFeatures = cutSingleFeatures(inputSingleFeatures: inputSingleFeatures, inputCutStruct: cutStruct, colorTransform: 1)
                        }
                    } else {
                        inputSingleFeatures = cutSingleFeatures(inputSingleFeatures: inputSingleFeatures, inputCutStruct: cutStruct, colorTransform: -1)
                    }
                }
                
            //飞二张看色去色1张
            } else if reportRule.cutSingleFeatureProcession == 4 {
                print("去色1张 \(inputSingleFeatures) --\(inputSingleFeatures.count)")
                if cutStructList.count < 1 || cutStructList[cutStructList.count - 1].cutMode != 2 {
                    multipleResultInfo.leftSingleFeatures = leftSingleFeatures
                    return multipleResultInfo
                }
                
                for cutStruct in cutStructList{
                    if cutStruct.cutMode == 2 {
                        inputSingleFeatures = cutSingleFeatures(inputSingleFeatures: inputSingleFeatures, inputCutStruct: cutStruct, colorTransform: 2)
                    } else {
                        inputSingleFeatures = cutSingleFeatures(inputSingleFeatures: inputSingleFeatures, inputCutStruct: cutStruct, colorTransform: -1)
                    }
                }
                
            //飞2张看色色先发
            } else if reportRule.cutSingleFeatureProcession == 5 {
                if cutStructList.count < 1 || cutStructList[cutStructList.count - 1].cutMode != 2 {
                    multipleResultInfo.leftSingleFeatures = leftSingleFeatures
                    return multipleResultInfo
                }
                
                for cutStruct in cutStructList{
                    if cutStruct.cutMode == 2 {
                        inputSingleFeatures = cutSingleFeatures(inputSingleFeatures: inputSingleFeatures, inputCutStruct: cutStruct, colorTransform: 3)
                    } else {
                        inputSingleFeatures = cutSingleFeatures(inputSingleFeatures: inputSingleFeatures, inputCutStruct: 
                                                                    cutStruct, colorTransform: -1)
                    }
                }
            //飞2张看色留色再看底
            } else if reportRule.cutSingleFeatureProcession == 6{
                if cutStructList.count < 2 || cutStructList[cutStructList.count - 1].cutMode != 2 {
                    multipleResultInfo.leftSingleFeatures = leftSingleFeatures
                    return multipleResultInfo
                }
                print("看色留色再看底 \(inputSingleFeatures)")
                cutStructList = Array(cutStructList.reversed())
                
                cutStructList[0].cutMode = 0
                
                print("操作 \(cutStructList[0].cutcardIndex) \(cutStructList[1].cutcardIndex)")
                for cutStruct in cutStructList{
                    if cutStruct.cutMode == 2 {
                        inputSingleFeatures = cutSingleFeatures(inputSingleFeatures: inputSingleFeatures, inputCutStruct: cutStruct, colorTransform: 0)
                    } else {
                        inputSingleFeatures = cutSingleFeatures(inputSingleFeatures: inputSingleFeatures, inputCutStruct: cutStruct, colorTransform: -1)
                    }
                }
                
                print("看色留色再看底后 \(inputSingleFeatures)")
                
            }
            //普通切牌
            else if cutStructList.count > 0 {
                for cutStruct in cutStructList{
                        inputSingleFeatures = cutSingleFeatures(inputSingleFeatures: inputSingleFeatures, inputCutStruct: cutStruct, colorTransform: -1)
                    
                }
            }
            
            //底为色色先发
            if reportRule.cutSingleFeatureProcession == 7{
                
                let colorSingleFeature = inputSingleFeatures.remove(at: inputSingleFeatures.count - 1)
                inputSingleFeatures = [colorSingleFeature] + inputSingleFeatures
                cutStructList.append(cutStruct(cutcardIndex: inputSingleFeatures[0], cutMode: 0))
            }
        
            
            leftSingleFeatures = inputSingleFeatures
            multipleResultInfo.returnSingleFeatureArray = inputSingleFeatures
        
        
            for roundID in 1...consecutiveNum {
            
                inputSingleFeatures = leftSingleFeatures
                
                if inputSingleFeatures.count == 0{
                    break
                }
            
                var currentResultInfo = SingleReportResultInfo()
                var cutList: [[Int]] = []
                var flyTCSolution : [[FlyTCsNode]] = []
                var currentFlyTCSolution: [FlyTCsNode] = []
                var firstCutSaved = false
                //切牌范围（遍历范围）
                switch reportRule.reportCutRange{
                //XY张
                case 0:
                    cutList.append([cutNumRangeSetting[0] - 1, cutNumRangeSetting[1] - 1])
                    break
                //上下5张，0-5张牌
                case 1:
                    cutList.append([0,5])
                    cutList.append([0,5])
                    break
                //下XY张
                case 2:
                    cutList.append([cutNumRangeSetting[0] - 1, cutNumRangeSetting[1] - 1])
                    break
                //上10张
                case 3:
                    cutList.append([0,9])
                    break
                //4，上Y张
                case 4:
                    cutList.append([0, cutNumRangeSetting[1] - 1])
                    break
                //5，上下XY张
                case 5:
                    cutList.append([cutNumRangeSetting[0] - 1, cutNumRangeSetting[1] - 1])
                    cutList.append([cutNumRangeSetting[0] - 1, cutNumRangeSetting[1] - 1])
                    break
                //6，看手牌, 0-player num - 1
                case 6:
                    cutList.append([0, rcNum - 1])
                    break
                //7, 范围切牌
                case 7:
                    cutList.append([0, cutNumRangeSetting[1] - 1])
                    break
                //8，去掉6789张牌
                case 8:
                    cutList.append([5,8])
                    break
                //9，固定第Y张
                case 9:
                    cutList.append([cutNumRangeSetting[0] - 1, cutNumRangeSetting[1] - 1])
                    break
                //10, 多种洗牌方式
                case 10:
                    cutList.append([0,3])
                    break
                //11, 0-Y张
                case 11:
                    cutList.append([0, cutNumRangeSetting[1]])
                    break
                //12, 0-10张
                case 12:
                    cutList.append([0, 10])
                    break
                //13, 范围切牌全牌打色
                case 13:
                    cutList.append([0, 53])
                    break
                //14, 飞2张
                case 14:
                    //每轮默认发一张牌
                    var everyDealNum: [Int] = []
                    if newArgs[0] == 0 {
                        for _ in 0..<handNum {
                            everyDealNum.append(1)
                        }
                        flyTCSolution = FlyTCsSolution(rcNum: rcNum, round: handNum, everyDealNum: everyDealNum)
                    } else {
                        var dealRoundNum = 0
                        for i in 0..<diyDealStatus.count {
                            if diyDealStatus[i][0] == true {
                                dealRoundNum += 1
                                everyDealNum.append(diyDealNum[i])
                            }
                        }
                        flyTCSolution = FlyTCsSolution(rcNum: rcNum, round: dealRoundNum, everyDealNum: everyDealNum)
                    }
                    
                    flyTCSolution.insert([FlyTCsNode(X: -1, Y: -1)], at: 0)
                    if flyTCSolution.count > 0 {
                        cutList.append([0, flyTCSolution.count - 1])
                    }
                    break
                //随意混合打色
                case 15:
                    cutList.append([0, 1])
                    break
                //随意混合打色2
                case 16:
                    cutList.append([0,2])
                    break
                default:
                    cutList.append([0,0])
                    break
                }
                
                
                //看手牌的牌型
                var lookHandSingleFeatures: [[Int]] = []
                //看手牌和不同发牌
                switch reportRule.differentDeal {
                //0, 不同发牌，根据Y值决定
                case 0:
                    break
                //1, 看手牌报下轮，传入下一轮牌堆
                case 1:
                    for orderNum in 0..<rcNum{
                        let leftNum = LeftDealCardCal(startIndex: orderNum, diyDealStatus: diyDealStatus, diyDealNum: diyDealNum, dealType: newArgs[0], handNum: handNum, minimumCardsNum: minSingleFeatureNum)
                        var originalSingleFeatures: [Int] = []
                        // print("剩余没发的牌数量 \(leftNum)")

                        //正发
                        if newArgs[1] == 0 {
                            originalSingleFeatures = Array(inputSingleFeatures[leftNum...])
                        //反发
                        } else {
                            let length = inputSingleFeatures.count
                            originalSingleFeatures = Array(inputSingleFeatures[0...(length - leftNum)])
                        }
                        lookHandSingleFeatures.append(originalSingleFeatures)
                    }
                    
                    print("看手牌的牌组 \(lookHandSingleFeatures.count)")

                    
                    
                    break
                //看手牌比第一张牌从最大牌继续发, 从第一轮开始报
                case 2:
                    for orderNum in 0..<rcNum{
                        //获得第一轮的牌
                        let prevCardsNum = rcNum - orderNum - 1
                        let length = inputSingleFeatures.count
                        var firstRoundCard: [Int] = []
                        //正发
                        if newArgs[1] == 0{
                            if orderNum == 0{
                                firstRoundCard = Array(inputSingleFeatures[0..<rcNum])
                            } else{
                                firstRoundCard = Array(inputSingleFeatures[0...prevCardsNum]) + Array(inputSingleFeatures[(length - orderNum)...])
                            }
                        //反发
                        } else {
                            if orderNum == rcNum - 1{
                                firstRoundCard = Array(inputSingleFeatures[0..<rcNum]).reversed()
                            } else{
                                firstRoundCard =
                                Array(inputSingleFeatures[(length - prevCardsNum)...]) + Array(inputSingleFeatures[0...orderNum])
                                firstRoundCard = firstRoundCard.reversed()
                            }
                        }
                        
                    }
                    break
                //lian xu qu pai dase 某些
                case 3:
                    break
                //fei 2 zhang
                case 4:
                    break
                case 99:
                    break
                default:
                    break
                }
                                
                //有无指定牌
                //指定牌的singlefeatureIndex
                var specialSingleFeatureIndex:Int = -1
                switch reportRule.hasSpecialSingleFeature{
                    //0, 有指定牌，x花色 y数字
                case 0:
                    if cutNumRangeSetting[1] == 14 {
                        specialSingleFeatureIndex = 53
                    } else if cutNumRangeSetting[1] == 15 {
                        specialSingleFeatureIndex = 54
                    } else {
                        specialSingleFeatureIndex = (cutNumRangeSetting[0] - 1) * 13 + cutNumRangeSetting[1] - 1
                    }
                    for singlefeatureIndex in 0..<inputSingleFeatures.count{
                        if inputSingleFeatures[singlefeatureIndex] == specialSingleFeatureIndex{
                            specialSingleFeaturePos = singlefeatureIndex
                        }
                    }
                    break
                default:
                    break
                }
                
                currentResultInfo.specialSingleFeaturePos = specialSingleFeaturePos
                
                var upDownID = 0
                
                for cutRange in cutList{
                    let cutRange1 = cutRange[0]
                    let cutRange2 = cutRange[1]
                    currentResultInfo.singlefeatureIndexToConfirmMaxMin.append([])
                    currentResultInfo.singlefeatureIndexToConfirmAliveDeath.append([])
                    currentResultInfo.XorYMax.append([])
                    print("cuRange \(cutRange1)  \(cutRange2)")
                    
                    for singlefeatureIndex in cutRange1...cutRange2{
                        // print("发牌位置 \(singlefeatureIndex)")
                        var coloringInputSingleFeatures = inputSingleFeatures
                        
                        if reportRule.differentDeal == 1 || reportRule.differentDeal == 2 {
                            coloringInputSingleFeatures = lookHandSingleFeatures[singlefeatureIndex]
                        }
                        
                        //反向打色
                        if coloringType == 1 {
                             coloringInputSingleFeatures = coloringInputSingleFeatures.reversed()
                        }
                        
                        var singlefeatureRank: Int = 0
                        var colorSingleFeatureIndexList: [Int] = []
                        
                        (singlefeatureRank, colorSingleFeatureIndexList) = GetSingleFeatureRank(reportRule: reportRule, cutNumSetting: cutNumSetting, cutNumRangeSetting: cutNumRangeSetting, inputSingleFeatures: coloringInputSingleFeatures, singlefeatureIndex: singlefeatureIndex, specialSingleFeaturePos: specialSingleFeaturePos, upDownID: upDownID, cutStructList: cutStructList)

                        
                        var newInputSingleFeatures: [Int] = []
                        //牌堆变化
                        switch reportRule.singlefeaturesTransformation{
                        //0，留色再根据色牌点数去牌
                        case 0:
                            if singlefeatureRank < coloringInputSingleFeatures.count - 1{
                                newInputSingleFeatures = Array(coloringInputSingleFeatures[(singlefeatureRank)...])
                            } else {
                                newInputSingleFeatures = []
                            }
                            
                            break
                        //1，去色再根据色牌点数去牌
                        case 1:
                            if singlefeatureRank < coloringInputSingleFeatures.count - 1 {
                                newInputSingleFeatures = Array(coloringInputSingleFeatures[(singlefeatureRank  + singlefeatureIndex + 1)...]) + Array(coloringInputSingleFeatures[0...singlefeatureIndex])
                            } else {
                                newInputSingleFeatures = []
                            }
                            break
                        //2，留色
                        case 2:
                            newInputSingleFeatures = coloringInputSingleFeatures
                            break
                        //3，去色
                        case 3:
                            newInputSingleFeatures = Array(coloringInputSingleFeatures[(singlefeatureIndex + 1)...])
                            break
                        //4，去色补到底部
                        case 4:
                            newInputSingleFeatures = Array(coloringInputSingleFeatures[(singlefeatureIndex + 1)...]) + Array(coloringInputSingleFeatures[0...singlefeatureIndex])
                            break
                        //5，去掉色牌1张
                        case 5:
                            newInputSingleFeatures = coloringInputSingleFeatures
                            newInputSingleFeatures.remove(at: singlefeatureIndex)
                            break
                        //6，色牌先发
                        case 6:
                            var colorSingleFeatureIndex = coloringInputSingleFeatures.remove(at: singlefeatureIndex)
                            //正发正面打色，反发反面打色
                            if newArgs[1] == coloringType {
                                newInputSingleFeatures = [colorSingleFeatureIndex] + coloringInputSingleFeatures
                            //正发反面打色，反发正面打色
                            } else if newArgs[1] != coloringType {
                                newInputSingleFeatures = coloringInputSingleFeatures + [colorSingleFeatureIndex]
                            }
                            
                            break
                        //7，去掉面牌补到底，去掉底牌补到顶
                        case 7:
                            if upDownID == 0 {
                                if singlefeatureIndex == 0{
                                    newInputSingleFeatures = coloringInputSingleFeatures
                                } else {
                                    newInputSingleFeatures = Array(coloringInputSingleFeatures[singlefeatureIndex...]) + Array(coloringInputSingleFeatures[0...singlefeatureIndex - 1])
                                }
                            } else {
                                if singlefeatureIndex == 0{
                                    newInputSingleFeatures = coloringInputSingleFeatures
                                } else {
                                    let length  = coloringInputSingleFeatures.count
                                    newInputSingleFeatures = Array(coloringInputSingleFeatures[length - singlefeatureIndex...length - 1])  + Array(coloringInputSingleFeatures[0...length - singlefeatureIndex - 1])
                                }
                            }
                        break
                        //8，上下XY张色牌先发
                        case 8:
                            if upDownID == 0{
                                if singlefeatureIndex == 0 {
                                    //正发正面打色，反发反面打色
                                    if newArgs[1] == coloringType{
                                        newInputSingleFeatures = coloringInputSingleFeatures
                                    //正发反面打色，反发正面打色
                                    } else if newArgs[1] != coloringType {
                                        newInputSingleFeatures = coloringInputSingleFeatures[1...] + [coloringInputSingleFeatures[singlefeatureIndex]]
                                    }
                                } else {
                                    var colorSingleFeatureIndex = coloringInputSingleFeatures.remove(at: singlefeatureIndex)
                                    if newArgs[1] == coloringType {
                                        newInputSingleFeatures = [colorSingleFeatureIndex] + coloringInputSingleFeatures
                                    } else {
                                        newInputSingleFeatures = coloringInputSingleFeatures + [colorSingleFeatureIndex]
                                    }
                                }
                            } else {
                                let length = inputSingleFeatures.count
                                if singlefeatureIndex == 0{
                                    if newArgs[1] == coloringType {
                                        newInputSingleFeatures = [coloringInputSingleFeatures[length - 1]] + Array(coloringInputSingleFeatures[0..<length - 1])
                                    } else {
                                        newInputSingleFeatures =  Array(coloringInputSingleFeatures[0..<length - 1]) + [coloringInputSingleFeatures[length - 1]]
                            
                                    }
                                } else {
                                    
                                    if newArgs[1] == coloringType {
                                        newInputSingleFeatures = [coloringInputSingleFeatures[length - 1 - singlefeatureIndex]] + Array(coloringInputSingleFeatures[0..<length - 1 - singlefeatureIndex]) + Array(coloringInputSingleFeatures[(length - singlefeatureIndex)...])
                                    } else {
                                        newInputSingleFeatures =  Array(coloringInputSingleFeatures[0..<length - 1 - singlefeatureIndex]) + Array(coloringInputSingleFeatures[(length - singlefeatureIndex)...]) + [coloringInputSingleFeatures[length - 1 - singlefeatureIndex]]
                                    }
                                    
                                }
                                
                            }
                            break
                        //9，上下XY张留色
                        case 9:
                            newInputSingleFeatures = Array(coloringInputSingleFeatures)
                            break
                        //10，上下XY张去色1张
                        case 10:
                            let length = coloringInputSingleFeatures.count
                            if upDownID == 0{
                                if singlefeatureIndex == 0{
                                    newInputSingleFeatures = Array(coloringInputSingleFeatures[(singlefeatureIndex + 1)...])
                                } else {
                                    newInputSingleFeatures = Array(coloringInputSingleFeatures[0..<singlefeatureIndex]) + Array(coloringInputSingleFeatures[(singlefeatureIndex + 1)...])
                                }
                            } else {
                                if singlefeatureIndex == 0{
                                    newInputSingleFeatures = Array(coloringInputSingleFeatures[0..<(length - 1)])
                                } else {
                                    newInputSingleFeatures = Array(coloringInputSingleFeatures[0..<(length - 1 - singlefeatureIndex)]) + Array(coloringInputSingleFeatures[(length - 1 - singlefeatureIndex + 1)...])
                                }
                                
                            }
                            break
                        //11，指定牌为底,切牌
                        case 11:
                            if specialSingleFeaturePos == coloringInputSingleFeatures.count - 1 {
                                newInputSingleFeatures = coloringInputSingleFeatures
                            } else {
                                newInputSingleFeatures = Array(coloringInputSingleFeatures[(specialSingleFeaturePos + 1)...]) + Array(coloringInputSingleFeatures[0...specialSingleFeaturePos])
                            }
                            break
                        //12,指定牌为顶，切牌
                        case 12:
                            if specialSingleFeaturePos == 0 {
                                newInputSingleFeatures = coloringInputSingleFeatures
                            } else {
                                newInputSingleFeatures = Array(coloringInputSingleFeatures[specialSingleFeaturePos...]) + Array(coloringInputSingleFeatures[0...specialSingleFeaturePos - 1])
                            }
                            break
                        //13，去掉Y张面牌
                        case 13:
                            newInputSingleFeatures = Array(coloringInputSingleFeatures[cutNumRangeSetting[1]...])
                            break
                        //14，去掉Y张面牌，再根据面牌点数去牌
                        case 14:
                            let YSingleFeatureRank: Int = coloringInputSingleFeatures[cutNumRangeSetting[1]] % 13 + 1
                            newInputSingleFeatures = Array(coloringInputSingleFeatures[(cutNumRangeSetting[1] + YSingleFeatureRank)...])
                            break
                        //15，去掉面牌和底牌，点数相加几点就去掉面上几张牌
                        case 15:
                            let AddSingleFeatureRank = (coloringInputSingleFeatures[0] % 13 + 1 + coloringInputSingleFeatures[coloringInputSingleFeatures.count - 1] % 13 + 1) % 10
                                            
                            newInputSingleFeatures = Array(coloringInputSingleFeatures[(AddSingleFeatureRank + 1)..<(inputSingleFeatures.count  - 1)])
                            break
                        //16，比第一张牌，从最大发
                        case 16:
                            //找出谁拿最大的牌
                            var maxRank: Int = 0
                            var maxIndex: Int = 0
                            
                            //正发反面打色，反发正面打色
                            if newArgs[1] != coloringType {
                                coloringInputSingleFeatures = coloringInputSingleFeatures.reversed()
                            }
                            
                            
                            for rcID in 0..<rcNum{
                                var compSingleFeatureRank:Int
                                if coloringInputSingleFeatures[rcID] == 53 {
                                    compSingleFeatureRank = 14
                                } else if inputSingleFeatures[rcID] == 54 {
                                    compSingleFeatureRank = 15
                                } else {
                                    compSingleFeatureRank = (inputSingleFeatures[rcID] % 13 + 1)
                                }
                                
                                if compSingleFeatureRank > maxRank {
                                    maxRank = compSingleFeatureRank
                                    maxIndex = rcID
                                }
                            }
                            var newPrefixArray: [Int] = []
                            for i in 0..<rcNum{
                                newPrefixArray.append(coloringInputSingleFeatures[(maxIndex + i) % rcNum])
                            }
                            
                            newInputSingleFeatures = newPrefixArray + coloringInputSingleFeatures[rcNum...]
                            
                            //正发反面打色，反发正面打色
                            if newArgs[1] != coloringType {
                                coloringInputSingleFeatures = coloringInputSingleFeatures.reversed()
                            }
                            
                            break
                        //17，比第一张牌，从最小发
                        case 17:
                            var minRank: Int = 100
                            var minIndex: Int = 0
                            
                            //正发反面打色，反发正面打色
                            if newArgs[1] != coloringType {
                                coloringInputSingleFeatures = coloringInputSingleFeatures.reversed()
                            }
                            
                            for rcID in 0..<rcNum{
                                var compSingleFeatureRank:Int
                                if coloringInputSingleFeatures[rcID] == 53 {
                                    compSingleFeatureRank = 14
                                } else if inputSingleFeatures[rcID] == 54 {
                                    compSingleFeatureRank = 15
                                } else {
                                    compSingleFeatureRank = (coloringInputSingleFeatures[rcID] % 13 + 1)
                                }
                                
                                if compSingleFeatureRank < minRank {
                                    minRank = compSingleFeatureRank
                                    minIndex = rcID
                                }
                            }
                            var newPrefixArray: [Int] = []
                            for i in 0..<rcNum{
                                newPrefixArray.append(coloringInputSingleFeatures[(minIndex + i) % rcNum])
                            }
                            
                            newInputSingleFeatures = newPrefixArray + coloringInputSingleFeatures[rcNum...]
                            
                            //正发反面打色，反发正面打色
                            if newArgs[1] != coloringType {
                                newInputSingleFeatures = newInputSingleFeatures.reversed()
                            }
                            break
                        //看手牌留色
                        case 19:
                            newInputSingleFeatures = lookHandSingleFeatures[singlefeatureIndex]
                            break
                        //看手牌去色
                        case 20:
                            newInputSingleFeatures = lookHandSingleFeatures[singlefeatureIndex]
                            newInputSingleFeatures = Array(newInputSingleFeatures[1...])
                            break
                        //22，范围切牌去色
                        case 22:
                            newInputSingleFeatures = Array(coloringInputSingleFeatures[(singlefeatureIndex + 1)...]) + Array(coloringInputSingleFeatures[0...singlefeatureIndex])
                            newInputSingleFeatures = Array(newInputSingleFeatures[1...])
                            break
                        //去掉X-Y张面牌，去掉面牌（从0开始）
                        case 23:
                            newInputSingleFeatures = Array(coloringInputSingleFeatures[singlefeatureIndex...])
                            break
                        //去掉面牌补在下方，去掉面牌放到底部（从0开始）
                        case 24:
                            if singlefeatureIndex > 0 {
                                newInputSingleFeatures = Array(coloringInputSingleFeatures[singlefeatureIndex...] + coloringInputSingleFeatures[0...singlefeatureIndex - 1])
                            } else {
                                newInputSingleFeatures = Array(coloringInputSingleFeatures[singlefeatureIndex...])
                            }
                        //下XY张留色面牌移动到色牌下面
                        case 25:
                            let colorSingleFeaturePos = coloringInputSingleFeatures.count - 1 - singlefeatureIndex
                            if singlefeatureIndex == 0{
                                newInputSingleFeatures = Array(coloringInputSingleFeatures[1...colorSingleFeaturePos]) + [coloringInputSingleFeatures[0]]
                            } else {
                                newInputSingleFeatures = Array(coloringInputSingleFeatures[1...colorSingleFeaturePos]) + [coloringInputSingleFeatures[0]] + Array(coloringInputSingleFeatures[(colorSingleFeaturePos + 1)...])
                                
                            }
                        // 下XY张色先发
                        case 26:
                            let colorSingleFeaturePos = coloringInputSingleFeatures.count - 1 - singlefeatureIndex
                            if singlefeatureIndex == 0{
                                //正发正面打色，反发反面打色
                                if newArgs[1] == coloringType {
                                    newInputSingleFeatures = [coloringInputSingleFeatures[colorSingleFeaturePos]] + Array(coloringInputSingleFeatures[0...colorSingleFeaturePos - 1])
                                //正发反面打色，正发反面打色
                                } else {
                                    newInputSingleFeatures = Array(coloringInputSingleFeatures[0...colorSingleFeaturePos - 1]) + [coloringInputSingleFeatures[colorSingleFeaturePos]]
                                }
                                
                            } else {
                                //正发正面打色，反发反面打色
                                if newArgs[1] == coloringType {
                                    newInputSingleFeatures = [coloringInputSingleFeatures[colorSingleFeaturePos]] + Array(coloringInputSingleFeatures[0..<colorSingleFeaturePos]) + Array(coloringInputSingleFeatures[(colorSingleFeaturePos + 1)...])
                                //正发反面打色，正发反面打色
                                } else {
                                    newInputSingleFeatures = Array(coloringInputSingleFeatures[0..<colorSingleFeaturePos]) + Array(coloringInputSingleFeatures[(colorSingleFeaturePos + 1)...]) + [coloringInputSingleFeatures[colorSingleFeaturePos]]
                                }
                            }
                        //指定牌上一张去色
                        case 27:
                            newInputSingleFeatures = Array(coloringInputSingleFeatures[specialSingleFeaturePos...])
                            break
                        //指定牌下一张去色
                        case 28:
                            newInputSingleFeatures = Array(coloringInputSingleFeatures[((specialSingleFeaturePos + 1) % (coloringInputSingleFeatures.count))...])
                            break
                        //去掉一张面牌
                        case 29:
                            newInputSingleFeatures = Array(coloringInputSingleFeatures[1...])
                            break
                        //随意混合打色
                        case 30:
                            switch singlefeatureIndex {
                                //放回从上发
                            case 0:
                                newInputSingleFeatures = coloringInputSingleFeatures
                                print("放回上面 \(newInputSingleFeatures)")
                                break
                                //切牌补到底部
                            case 1:
                                let pos = searchSingleFeaturePos(inputSingleFeatures: coloringInputSingleFeatures, singlefeatureIndex: cutStructList[cutStructList.count - 1].cutcardIndex)
                                if pos == coloringInputSingleFeatures.count - 1 {
                                    newInputSingleFeatures = coloringInputSingleFeatures
                                } else {
                                    newInputSingleFeatures = Array(coloringInputSingleFeatures[(pos + 1)...]) + Array(coloringInputSingleFeatures[0...pos])
                                }
                                print("切牌补到底部 \(newInputSingleFeatures)")
                                break
                            default:
                                break
                            }
                        break
                        //随意混合打色
                        case 31:
                            let pos = searchSingleFeaturePos(inputSingleFeatures: coloringInputSingleFeatures, singlefeatureIndex: cutStructList[cutStructList.count - 1].cutcardIndex)
                            switch singlefeatureIndex {
                            //放回从上发
                            case 0:
                                newInputSingleFeatures = coloringInputSingleFeatures
                                print("放回上面 \(newInputSingleFeatures)")
                                break
                            //去色全部
                            case 1:
                                newInputSingleFeatures = Array(coloringInputSingleFeatures[(pos + 1)...])
                                print("去色 \(newInputSingleFeatures)")
                                break
                            //去色1张
                            case 2:
                                newInputSingleFeatures = coloringInputSingleFeatures
                                newInputSingleFeatures.remove(at: pos)
                                print("去色1张 \(newInputSingleFeatures)")
                            default:
                                break
                            }
                            break
                        default:
                            newInputSingleFeatures = coloringInputSingleFeatures
                            break
                        }
                        
                        //飞2张
                        if reportRule.differentDeal == 4 {
                            //正发，反面打色，反发正面打色, 调整成发牌顺序
                            if newArgs[1] != coloringType {
                                newInputSingleFeatures = newInputSingleFeatures.reversed()
                            }
                            
                            currentFlyTCSolution = flyTCSolution[singlefeatureIndex]
                            
                            for dealNode in currentFlyTCSolution {
                                
                                let round = dealNode.X
                                let dealOrder = dealNode.Y
                                var singlefeatureIndex: Int = 0
                                //默认每轮发一张
                                if round == -1 && dealOrder == -1 {
                                    print("第一种情况牌组不变 \(newInputSingleFeatures)")
                                } else {
                                    
                                    if newArgs[0] == 0{
                                        singlefeatureIndex = round * rcNum + dealOrder
                                        let temp = newInputSingleFeatures[singlefeatureIndex]
                                        newInputSingleFeatures[singlefeatureIndex] = newInputSingleFeatures[singlefeatureIndex + 1]
                                        newInputSingleFeatures[singlefeatureIndex + 1] = temp
                                    } else {
                                        var currentDealRound = -1
                                        var otherNum = 0
                                        for i in 0..<diyDealStatus.count {
                                            if diyDealStatus[i][0] == true {
                                                //每轮发牌
                                                currentDealRound += 1
                                                let currentRoundDealNum = diyDealNum[i] * rcNum
                                                for j in 0..<currentRoundDealNum{
                                                    if currentDealRound == round && j == dealOrder {
                                                        singlefeatureIndex = otherNum
                                                        let temp = newInputSingleFeatures[singlefeatureIndex]
                                                        newInputSingleFeatures[singlefeatureIndex] = newInputSingleFeatures[singlefeatureIndex + 1]
                                                        newInputSingleFeatures[singlefeatureIndex + 1] = temp
                                                        print("飞2张之后的牌堆 \(newInputSingleFeatures)")
                                                    }
                                                    otherNum += 1
                                                }
                                            } else {
                                                otherNum += diyDealNum[i]
                                            }
                                        }
                                    }
                                    
                                }

                            }
                            if newArgs[1] != coloringType {
                                newInputSingleFeatures = newInputSingleFeatures.reversed()
                            }
                        }
                        
//                        if reportRule.differentDeal == 4 {
//                            print("飞2张之后的牌堆 \(newInputSingleFeatures)")
//                        }
                        
                        //返回游戏的结果
                        
                        //每一个牌堆对应一个色点
                        var newSingleFeatureRank = singlefeatureRank
                        //装所有目标位置
                        var resultTargetPos:[Int] = []
                        //装所有目标位置对应的排名
                        var resultTargetRank: [Int] = []

                        //反面打色，打色完变回去
                        if coloringType == 1 {
                            newInputSingleFeatures = newInputSingleFeatures.reversed()
                        }
                        
                        let (winnersInfo, currentLeftSingleFeatures) = DatasetFunction!(diyDealStatus, diyDealNum, newInputSingleFeatures, newArgs, rankRules, suitRules)
                        
                        leftSingleFeatures = currentLeftSingleFeatures
                        if winnersInfo.count != 0 {
                            
                            //重新按照rcID排序
                            currentResultInfo.RCReturnInfoList = winnersInfo.sorted(by: {$0.rcID < $1.rcID})
                            
                            currentResultInfo.community = winnersInfo[0].communitySingleFeature.map { $0.singlefeatureIndex }
                            
                            //重新整理后的winner info
                            let rankedWinnersInfo = extractWinnerSet(inputInfo: winnersInfo)
                            //设置排名ID
                            for rank in (1...rankedWinnersInfo.count){
                                for rcInfo in rankedWinnersInfo[rank - 1]{
                                    currentResultInfo.RCReturnInfoList[rcInfo.rcID].rcDatasetRank = rank
                                }
                            }
                            
                            //根据报法获得需要的结果
                            switch reportRule.rankReport{
                            //最大
                            case 0:
                                for maxWinner in rankedWinnersInfo[0]{
                                    resultTargetPos.append(maxWinner.rcID)
                                }
                            //最大次大
                            case 1:
                                for i in 0..<min(rankedWinnersInfo.count - 1, 2){
                                    for winner in rankedWinnersInfo[i]{
                                        resultTargetPos.append(winner.rcID)
                                        resultTargetRank.append(i)
                                    }
                                }
                                break
                            //2，1大2大3大，
                            case 2:
                                for i in 0..<min(rankedWinnersInfo.count - 1, 3){
                                    for winner in rankedWinnersInfo[i]{
                                        resultTargetPos.append(winner.rcID)
                                    }
                                }
                                break
                            //3，最小
                            case 3:
                                for minWinner in rankedWinnersInfo[rankedWinnersInfo.count - 1]{
                                    resultTargetPos.append(minWinner.rcID)
                                }
                                break
                            //4，最小次小
                            case 4:
                                for i in 0..<min(rankedWinnersInfo.count - 1, 2){
                                    for winner in rankedWinnersInfo[rankedWinnersInfo.count - 1 - i]{
                                        resultTargetPos.append(winner.rcID)
                                        resultTargetRank.append(i)
                                    }
                                }
                                break
                            //5，排名（6名）
                            case 5:
                                for i in 0..<min(rankedWinnersInfo.count, 6){
                                    for winner in rankedWinnersInfo[i]{
                                        resultTargetPos.append(winner.rcID)
                                    }
                                }
                                break
                            //6，大1大2，小1小2
                            case 6:
                                //大1 大2
                                for i in 0..<min(rankedWinnersInfo.count - 1, 2){
                                    for winner in rankedWinnersInfo[i]{
                                        resultTargetPos.append(winner.rcID)
                                    }
                                }
                                break
                            default:
                                break
                            }
                            
                            //报平点
                            switch reportRule.DrawPointReport {
                            //0，算单轮平点
                            case 0:
                                currentResultInfo.hasDrawPoint = 0
                                for rankSet in rankedWinnersInfo {
                                    if rankSet.count > 1{
                                        currentResultInfo.hasDrawPoint += rankSet.count
                                    }
                                }
                                break
                            //2, 算多轮有多少家平点
                            case 1:
                                for rankSet in rankedWinnersInfo {
                                    if rankSet.count > 1 {
                                        multipleResultInfo.totalDrawNum += rankSet.count
                                    }
                                }
                                break
                            //平点，杂平点，双平点
                            case 2:
                                var drawNum: Int = 0
                                var drawType: Int = 0
                                var setPos: Int = 0
                                var drawSize: String = ""
                                
                                for rankSet in rankedWinnersInfo {
                                    if rankSet.count == 2 {
                                        drawNum += 1
                                        if  abs(rankSet[0].rcID - rankSet[1].rcID) == 2 {
                                            drawType = 2
                                            if setPos == 0 {
                                                drawSize = "大"
                                            } else if setPos == rankedWinnersInfo.count - 1 {
                                                drawSize = "小"
                                            }
                                        } else {
                                            drawType = 1
                                            if setPos == 0 {
                                                drawSize = "大"
                                            } else if setPos == rankedWinnersInfo.count - 1 {
                                                drawSize = "小"
                                            }
                                        }
                                        currentResultInfo.drawID = rankSet[0].rcID
                                    } else if rankSet.count == 3{
                                        if rankSet[0].rcDatasetRank == 2{
                                            drawType = 5
                                        } else if rankSet[0].rcDatasetRank == 1 {
                                            drawType = 4
                                        }
                                    }
                                    setPos += 1
                                }
                                //1,平点，2杂平点，3双平点，4三大一小，5三小一大
                                
                                currentResultInfo.drawSize = drawSize

                                //双平点
                                if drawNum == 2{
                                    currentResultInfo.drawType = 3
                                //三大一小
                                } else if drawType == 4{
                                    currentResultInfo.drawType = 4
                                //三小一大
                                } else if drawType == 5{
                                    currentResultInfo.drawType = 5
                                //平点
                                } else if drawType == 1{
                                    currentResultInfo.drawType = 1
                                //杂平点
                                } else if drawType == 2{
                                    currentResultInfo.drawType = 2
                                }
                                break
                                
                            default:
                                break
                            }
                            
                            
                            //报9点
                            switch reportRule.NPReport {
                            //0, 报无9点
                            case 0:
                                break
                            //1, 不打几
                            case 1:
                                let rankSet = rankedWinnersInfo[rankedWinnersInfo.count - 1]
                                currentResultInfo.NoColorNum = ReportManager.noColorDic[rankSet[0].rcID]! + rcNum
                                // print("不打几 \(currentResultInfo.NoColorNum)")
                                break
                            default:
                                break
                            }
                        }
                        
                        //报对子
                        switch reportRule.pairReport{
                        //几个对子
                        case 0,1:
                            for winner in winnersInfo{
                                if winner.isPair == 1{
                                    currentResultInfo.pairNum += 1
                                }
                            }
                            break
                        //2, 一共多少个对子
                        case 2:
                            for winner in winnersInfo{
                                if winner.isPair == 1 {
                                    multipleResultInfo.totalPairNum += 1
                                }
                            }
                            break
                        //save pair_player_ID, not cal color, no color, won't be wrong
                        case 3:
                            for winner in winnersInfo{
                                if winner.isPair == 1{
                                    currentResultInfo.pairIDList.append(winner.rcID)
                                }
                            }
                            break
                            
                        default:
                            break
                        }
                        
                        
                        
                        //报最大家牌
                        switch reportRule.isReportWinnerSingleFeatures{
                        //0，报最大家牌
                        case 0:
                            break
                        //1, 报各家点数
                        case 1:
                            break
                        default:
                            break
                        }
                        
                        
                        // 打色，位置转换
                        var resultPos:[Int] = []
                        for resultTargetPo in resultTargetPos {
                            if singlefeatureRank == 0{
                                resultPos.append(resultTargetPo % rcNum)
                            } else {
                                resultPos.append((singlefeatureRank + resultTargetPo - 1) % rcNum)
                            }
                        }
                        allReportResult.append(resultPos)
                        
                        //还原显示的rcID
                        for index in 0..<currentResultInfo.RCReturnInfoList.count {
                            if singlefeatureRank == 0 {
                                currentResultInfo.RCReturnInfoList[index].rcID = currentResultInfo.RCReturnInfoList[index].rcID % rcNum
                            } else {
                                currentResultInfo.RCReturnInfoList[index].rcID = (singlefeatureRank + currentResultInfo.RCReturnInfoList[index].rcID - 1) % rcNum
                            }
                            
                        }
                        currentResultInfo.RCReturnInfoList = currentResultInfo.RCReturnInfoList.sorted(by: {$0.rcID < $1.rcID} )
                        
                        
                        
                        //报活门
                        var upAlive: Bool = false
                        var downAlive: Bool = false
                        var halfUpAlive: Bool = false
                        var halfDownAlive: Bool = false
                        switch reportRule.aliveDeathReport{
                        case -1:
                            break
                        //算活门
                        case 0:
                            var winNextTime: Int = 0
                            var winPreTime: Int = 0
                            var drawTime : Int = 0
                        
                            let tempRCReturnInfoList = currentResultInfo.RCReturnInfoList + [currentResultInfo.RCReturnInfoList[0]]
                            for rcID in 0..<tempRCReturnInfoList.count - 1 {
                                let currentRCRank = tempRCReturnInfoList[rcID].rcDatasetRank
                                let nextRCRank = tempRCReturnInfoList[rcID + 1].rcDatasetRank
                                //比下家小
                                if currentRCRank > nextRCRank {
                                    winPreTime += 1
                                } else if currentRCRank < nextRCRank {
                                    winNextTime += 1
                                } else if currentRCRank == nextRCRank {
                                    drawTime += 1
                                }
                            }
                            
                            //赢下家概率大于 70 上活门
                            if (Double(winNextTime) / Double(rcNum)) > 0.7 {
                                upAlive = true
                            }
                            //win up prob > 70 downAlive
                            else if (Double(winPreTime) / Double(rcNum)) > 0.7 {
                                downAlive = true
                            }
                            else if (Double(winNextTime + drawTime) / Double(rcNum) > 0.7){
                                halfUpAlive = true
                            } else if (Double(winPreTime + drawTime) / Double(rcNum)) > 0.7 {
                                halfDownAlive = true
                            }
                            break
                        default:
                            break
                        }
                        
                        
                        var targets:[Int] = []
                        //目标
                        switch reportRule.positionToReport {
                        //0, 保目标位置
                        case 0:
                            targets.append(targetPos)
                            break
                        //1，保X
                        case 1:
                            targets.append(cutNumRangeSetting[0] - 1)
                            break
                        //2，保Y
                        case 2:
                            targets.append(cutNumRangeSetting[1] - 1)
                            break
                        //3，保X或者Y
                        case 3:
                            targets.append(cutNumRangeSetting[0] - 1)
                            targets.append(cutNumRangeSetting[1] - 1)
                            break
                        
                        default:
                            break
                        }
                        
                        var reportTargetFlag: Int = 0
                        //报什么
                        switch reportRule.reportTarget{
                        //报大小
                        case 0:
                            print("RC加入了 \(resultPos)")
                            currentResultInfo.targetRCList.append(resultPos)
                            
                            if colorSingleFeatureIndexList.count > 0 {
                                currentResultInfo.ColorSingleFeatures = colorSingleFeatureIndexList
                            }
                            if upAlive {
                                currentResultInfo.aliveNumber = 4
                                currentResultInfo.handCardAliveNumberList.append(4)
                            } else if downAlive {
                                currentResultInfo.aliveNumber = 2
                                currentResultInfo.handCardAliveNumberList.append(2)
                            } else if !upAlive && !downAlive{
                                currentResultInfo.handCardAliveNumberList.append(0)
                            }
                            
                            break
                        //保单个位置大小, 只报第一个
                        case 1:
                            if resultPos.contains(where: {$0 == targets[0]}) {
                                currentResultInfo.singlefeatureIndexToConfirmMaxMin[upDownID].append(singlefeatureIndex + 1)
                                currentResultInfo.flyTCSolution = (currentFlyTCSolution)
                                currentResultInfo.ColorSingleFeatures = colorSingleFeatureIndexList
                                reportTargetFlag = 1
                            }
                            break
                        //2,哪个位置拿最大最多
                        case 2:
                            for id in resultPos {
                                rcWinTimesDic[id]! += 1
                            }
                            break
                        //3, 保2个位置必有一家大小
                        case 3:
                            var X: Int = 0
                            var Y: Int = 0
                            if resultPos.contains(where: {$0 == targets[0]}){
                                X = 1
                                if currentResultInfo.RCReturnInfoList[targets[0]].rcDatasetRank == 1 {
                                    currentResultInfo.XorYMax[upDownID].append(targets[0] + 1)
                                }
                                
                            }
                            if resultPos.contains(where: {$0 == targets[1]}) {
                                Y = 1
                                if currentResultInfo.RCReturnInfoList[targets[1]].rcDatasetRank == 1 {
                                    currentResultInfo.XorYMax[upDownID].append(targets[1] + 1)
                                }                            }
                            
                            if X == 1 || Y == 1{
                                currentResultInfo.singlefeatureIndexToConfirmMaxMin[upDownID].append(singlefeatureIndex + 1)
                                currentResultInfo.flyTCSolution = (currentFlyTCSolution)
                                currentResultInfo.ColorSingleFeatures = colorSingleFeatureIndexList
                                reportTargetFlag = 1
                            }
                            break
                        //保位置活门,报最大
                        case 5:
                            if upAlive && targets[0] == 3 {
                                currentResultInfo.singlefeatureIndexToConfirmMaxMin[upDownID].append(singlefeatureIndex + 1)
                                currentResultInfo.flyTCSolution = (currentFlyTCSolution)
                                currentResultInfo.aliveNumber = 4
                                for id in resultPos {
                                    currentResultInfo.XorYMax[upDownID].append(id + 1)
                                }
                                reportTargetFlag = 1

                            } else if downAlive && targets[0] == 1 {
                                currentResultInfo.singlefeatureIndexToConfirmMaxMin[upDownID].append(singlefeatureIndex + 1)
                                currentResultInfo.flyTCSolution = (currentFlyTCSolution)
                                currentResultInfo.aliveNumber = 2
                                for id in resultPos {
                                    currentResultInfo.XorYMax[upDownID].append(id + 1)
                                }
                                reportTargetFlag = 1
                            }
                            break
                        //6，保有活门
                        case 6:
                            if upAlive {
                                currentResultInfo.singlefeatureIndexToConfirmAliveDeath[upDownID].append(singlefeatureIndex + 1)
                                currentResultInfo.flyTCSolution = (currentFlyTCSolution)
                                currentResultInfo.aliveNumber = 4
                                reportTargetFlag = 1
                            } else if downAlive {
                                currentResultInfo.singlefeatureIndexToConfirmAliveDeath[upDownID].append(singlefeatureIndex + 1)
                                currentResultInfo.flyTCSolution = (currentFlyTCSolution)
                                currentResultInfo.aliveNumber = 2
                                reportTargetFlag = 1
                            }
                            break
                        //保无牛或最多一家有牛
                        case 7:
                            var bullNum = 0
                            for winner in currentResultInfo.RCReturnInfoList{
                                if winner.rcSingleFeaturesType.hasPrefix("牛") {
                                    bullNum += 1
                                }
                            }
                            //一家
                            if bullNum == 1{
                                currentResultInfo.NoBullOrMaxOneBull = 1
                                reportTargetFlag = 1
                            } else if bullNum == 0 {
                                currentResultInfo.NoBullOrMaxOneBull = 2
                                reportTargetFlag = 1
                            }
                            
                            if reportTargetFlag == 1 {
                                currentResultInfo.singlefeatureIndexToConfirmMaxMin[upDownID].append(singlefeatureIndex + 1)
                            }
                            break
                        //保至少一家有牛牛
                        case 8:
                            for winner in currentResultInfo.RCReturnInfoList{
                                if winner.rcSingleFeaturesType == "牛牛" {
                                    currentResultInfo.BullBullRCID.append(winner.rcID)
                                }
                            }
                            if currentResultInfo.BullBullRCID.count > 0{
                                currentResultInfo.singlefeatureIndexToConfirmMaxMin[upDownID].append(singlefeatureIndex + 1)
                                reportTargetFlag = 1
                            }
                            break
                        //9，保单个位置大小, 遍历全部
                        case 9:
                            if resultPos.contains(where: {$0 == targets[0]}) {
                                currentResultInfo.singlefeatureIndexToConfirmMaxMin[upDownID].append(singlefeatureIndex + 1)
                            }
                            currentResultInfo.ColorSingleFeatures = colorSingleFeatureIndexList
                            break
                        //10, 保2个位置必有一家大小，遍历全部
                        case 10:
                            var X: Int = 0
                            var Y: Int = 0
                            if resultPos.contains(where: {$0 == targets[0]}){
                                X = 1
                                if currentResultInfo.RCReturnInfoList[targets[0]].rcDatasetRank == 1 {
                                    currentResultInfo.XorYMax[upDownID].append(targets[0] + 1)
                                }
                                
                            }
                            if resultPos.contains(where: {$0 == targets[1]}) {
                                Y = 1
                                if currentResultInfo.RCReturnInfoList[targets[1]].rcDatasetRank == 1 {
                                    currentResultInfo.XorYMax[upDownID].append(targets[1] + 1)
                                }                            }
                            
                            if X == 1 || Y == 1{
                                currentResultInfo.singlefeatureIndexToConfirmMaxMin[upDownID].append(singlefeatureIndex + 1)
                            }
                            currentResultInfo.ColorSingleFeatures = colorSingleFeatureIndexList
                            break
                        //保目标最小, 有且有两家同点
                        case 11:
                            if resultPos.contains(where: {$0 == targets[0]}) && currentResultInfo.hasDrawPoint == 2 {
                                currentResultInfo.singlefeatureIndexToConfirmMaxMin[upDownID].append(singlefeatureIndex + 1)
                                
                                currentResultInfo.ColorSingleFeatures = colorSingleFeatureIndexList
                                reportTargetFlag = 1
                            }
                            break
                        //report half alive gate
                        case 12:
                            currentResultInfo.targetRCList.append(resultPos)
                            
                            if colorSingleFeatureIndexList.count > 0 {
                                currentResultInfo.ColorSingleFeatures = colorSingleFeatureIndexList
                            }
                            if upAlive {
                                currentResultInfo.aliveNumber = 4
                                currentResultInfo.handCardAliveNumberList.append(4)
                            } else if downAlive {
                                currentResultInfo.aliveNumber = 2
                                currentResultInfo.handCardAliveNumberList.append(2)
                            } else if halfUpAlive {
                                currentResultInfo.aliveNumber = 3
                                currentResultInfo.handCardAliveNumberList.append(4)
                            } else if halfDownAlive {
                                currentResultInfo.aliveNumber = 1
                                currentResultInfo.handCardAliveNumberList.append(2)
                            } else {
                                currentResultInfo.handCardAliveNumberList.append(0)
                            }
                            
                            break
                        //保单个位置大小, 报多个, 多轮报单个(牌堆变化)
                        case 13:
                            if resultPos.contains(where: {$0 == targets[0]}) {
                                currentResultInfo.singlefeatureIndexToConfirmMaxMin[upDownID].append(singlefeatureIndex + 1)
                                currentResultInfo.ColorSingleFeatures = colorSingleFeatureIndexList
                                
                                if firstCutSaved == false {
                                    firstMultiCutFeatures = currentLeftSingleFeatures
                                    firstMultiCutRCreturnInfo = currentResultInfo.RCReturnInfoList
                                    firstMultiCutColorFeatures = currentResultInfo.ColorSingleFeatures
                                    firstCutSaved = true
                                }
                                if roundID > 1 {
                                    reportTargetFlag = 1
                                }
                                
                                print("轮次 \(roundID) 第几张 \(singlefeatureIndex + 1)")
                            }
                            
                            break
                        //保单个位置大小, 报多个, 多轮报多个(留色)
                        case 14:
                            if resultPos.contains(where: {$0 == targets[0]}) {
                                currentResultInfo.singlefeatureIndexToConfirmMaxMin[upDownID].append(singlefeatureIndex + 1)
                                currentResultInfo.ColorSingleFeatures = colorSingleFeatureIndexList
                                if firstCutSaved == false {
                                    firstMultiCutFeatures = currentLeftSingleFeatures
                                    firstMultiCutRCreturnInfo = currentResultInfo.RCReturnInfoList
                                    firstMultiCutColorFeatures = currentResultInfo.ColorSingleFeatures
                                    firstCutSaved = true
                                }
                                print("轮次 \(consecutiveNum) 第几张 \(singlefeatureIndex + 1)")
                            }
                            break
                        //有活门报活门多个，报多个，多轮报一个
                        case 15:
                            if upAlive {
                                currentResultInfo.singlefeatureIndexToConfirmAliveDeath[upDownID].append(singlefeatureIndex + 1)
                                currentResultInfo.flyTCSolution = (currentFlyTCSolution)
                                currentResultInfo.aliveNumber = 4
                                
                                if firstCutSaved == false {
                                    firstMultiCutFeatures = currentLeftSingleFeatures
                                    firstMultiCutRCreturnInfo = currentResultInfo.RCReturnInfoList
                                    firstMultiCutColorFeatures = currentResultInfo.ColorSingleFeatures
                                    firstCutSaved = true
                                }
                                
                            } else if downAlive {
                                currentResultInfo.singlefeatureIndexToConfirmAliveDeath[upDownID].append(singlefeatureIndex + 1)
                                currentResultInfo.flyTCSolution = (currentFlyTCSolution)
                                currentResultInfo.aliveNumber = 2
                                
                                if firstCutSaved == false {
                                    firstMultiCutFeatures = currentLeftSingleFeatures
                                    firstMultiCutRCreturnInfo = currentResultInfo.RCReturnInfoList
                                    firstMultiCutColorFeatures = currentResultInfo.ColorSingleFeatures
                                    firstCutSaved = true
                                }
                            }
                            break
                        //报xy大，多轮报一轮
                        case 16:
                            var X: Int = 0
                            var Y: Int = 0
                            if resultPos.contains(where: {$0 == targets[0]}){
                                X = 1
                                if currentResultInfo.RCReturnInfoList[targets[0]].rcDatasetRank == 1 {
                                    currentResultInfo.XorYMax[upDownID].append(targets[0] + 1)
                                }
                                
                            }
                            if resultPos.contains(where: {$0 == targets[1]}) {
                                Y = 1
                                if currentResultInfo.RCReturnInfoList[targets[1]].rcDatasetRank == 1 {
                                    currentResultInfo.XorYMax[upDownID].append(targets[1] + 1)
                                }                            }
                            
                            if X == 1 || Y == 1{
                                currentResultInfo.singlefeatureIndexToConfirmMaxMin[upDownID].append(singlefeatureIndex + 1)
                                currentResultInfo.flyTCSolution = (currentFlyTCSolution)
                                currentResultInfo.ColorSingleFeatures = colorSingleFeatureIndexList
                                
                                if firstCutSaved == false {
                                    firstMultiCutFeatures = currentLeftSingleFeatures
                                    firstMultiCutRCreturnInfo = currentResultInfo.RCReturnInfoList
                                    firstMultiCutColorFeatures = currentResultInfo.ColorSingleFeatures
                                    firstCutSaved = true
                                }
                            }
                            break
                        
                        //随意打色保单个位置大小, 记录最大次大
                        case 17:
                            if resultPos.contains(where: {$0 == targets[0]}) {
                                let pos = resultPos.firstIndex(of: targets[0])
                                if resultTargetRank[pos!] == 0 {
                                    //最大
                                    currentResultInfo.randomColorFlag.append(0)
                                } else {
                                    //次大
                                    currentResultInfo.randomColorFlag.append(1)
                                }
                                currentResultInfo.singlefeatureIndexToConfirmMaxMin[upDownID].append(singlefeatureIndex)
                                currentResultInfo.flyTCSolution = (currentFlyTCSolution)
                                currentResultInfo.ColorSingleFeatures = colorSingleFeatureIndexList
                            }
                            break
                            
                            //保单个位置大小, 记录最大次大
                            case 18:
                                if resultPos.contains(where: {$0 == targets[0]}) {
                                    let pos = resultPos.firstIndex(of: targets[0])
                                    if resultTargetRank[pos!] == 0 {
                                        //最大
                                        currentResultInfo.randomColorFlag.append(0)
                                    } else {
                                        //次大
                                        currentResultInfo.randomColorFlag.append(1)
                                    }
                                    currentResultInfo.singlefeatureIndexToConfirmMaxMin[upDownID].append(singlefeatureIndex)
                                    
                                    currentResultInfo.flyTCSolution = (currentFlyTCSolution)
                                    currentResultInfo.ColorSingleFeatures = colorSingleFeatureIndexList
                                }
                                break
                            //报4张单张
                            case 19:
                                let XValue = cutNumRangeSetting[0]
                                let featureNum = rcNum
                                let gapNum = targetPos + 1
                                let YValue = cutNumRangeSetting[1]
                                //如果反发
                                var tempInputFeatures: [Int] = []
                                if newArgs[1] != 0{
                                    tempInputFeatures = newInputSingleFeatures.reversed()
                                } else {
                                    tempInputFeatures = newInputSingleFeatures
                                }
                                for i in 0..<featureNum{
                                    
                                    let currentFeaturePos = i * gapNum + XValue - 1
                                    if currentFeaturePos > tempInputFeatures.count - 1 || currentFeaturePos < 0{
                                        continue
                                    }
                                    let currentFeatureIndex = tempInputFeatures[currentFeaturePos]
                                    let currentPoint = ClassifierSettingArgs.SingleFeatureNumberReportDic[currentFeatureIndex % 13 + 1]
                                    
                                    let currentColor = 3 - (currentFeatureIndex / 13)
                                    if YValue == 10 {
                                        currentResultInfo.fourCardReport += currentPoint! + " "
                                    } else {
                                        currentResultInfo.fourCardReport +=  ClassifierSettingArgs.SuitReportDix[currentColor]! + currentPoint! + " "
                                    }
                                }
                                break
                        default:
                            break
                        }
                        //找到了目标
                        if reportTargetFlag == 1 {
                            break
                        }
                        
                        //剩余的牌不够用
                        if leftSingleFeatures.count == 0 && reportRule.differentDeal == -1 {
                            break
                        }
                    }
                    upDownID += 1
                }
                
                if firstCutSaved {
                    print("传入第一次切牌牌堆")
                    leftSingleFeatures = firstMultiCutFeatures
                    currentResultInfo.RCReturnInfoList = firstMultiCutRCreturnInfo
                    currentResultInfo.ColorSingleFeatures = firstMultiCutColorFeatures
                    
                } else if firstCutSaved && reportRule.reportTarget == 13{
                    print("轮次 \(roundID) \(firstCutSaved)")
                    leftSingleFeatures = []
                
                }
                
                print("下一轮的牌堆 \(leftSingleFeatures)")
                multipleResultInfo.singleResultList.append(currentResultInfo)
                
            }
        }
        
        
        //结果整合，把需要的元素填入结果整合的函数中，最后合成一段reportResult字符串
        let reportResult = reportStringGenerator(reportID: reportID, multipleReportResultInfo: multipleResultInfo, cutNumRangeSetting: cutNumRangeSetting, rcNum: rcNum)
        
        multipleResultInfo.reportResult = reportResult
        
        if firstMultiCutFeatures.count != 0 {
            multipleResultInfo.leftSingleFeatures = firstMultiCutFeatures
            
        } else {
            multipleResultInfo.leftSingleFeatures = leftSingleFeatures
        }
        PrintSpeakResult(speakStructArray: reportResult)
        
        
        
        return (multipleResultInfo)
        
    }
    
    static func PrintSpeakResult(speakStructArray: [[SpeakResultStruct]]) {
        
        var roundId: Int = 0
        for speakList in speakStructArray {
            roundId += 1
            var reportString: String = ""
            for speakStruct in speakList {
                reportString += "声音: \(speakStruct.voiceType) 内容 \(speakStruct.content) "
            }
        }
    }
    
    
    static func reportStringGenerator(reportID:Int, multipleReportResultInfo: MultipleReportResultInfo, cutNumRangeSetting: [Int], rcNum: Int) -> [[SpeakResultStruct]]{
        var reportResult:[[SpeakResultStruct]] = []
        switch reportID{
//            0:"[1]:报最大",
//            1:"[2]:报最小",
//如果超过两家怎么办
//            2:"[3]:报最大次大",
//            3:"[4]:最小次小",
//            4:"[5]:报1大2大3大",
//            168: "[520]:底为色报位置最大次大",
//            169: "[521]:底为色报位置最大",
//            170: "[522]:底为色报位置最小次小",
//            171: "[523]:底为色报位置最小",
//            172: "[524]:底为色报位置排名",
//            174: "[526]:底2张相加为色报位置最大次大",
//            177: "[530]:面为色报位置最大次大",
//            178: "[531]:面为色报位置最大",
//            179: "[532]:面为色报位置最小次小",
//            180: "[533]:面为色报位置最小",
//            181: "[534]:面为色报位置排名",
//            182: "[540]:面为色去色报位置最大次大",
//            183: "[541]:面为色去色报位置最大",
//            184: "[5421:面为色去色报位置最小次小",
//            185: "[543]:面为色去色报位置最小",
//            186: "[544]:面为色去色报位置排名",
//            193: "[700]:去掉14张面牌报哪家最大",
//            194: "[701]:去掉14张面牌报哪家最小",
//            195: "[702]:去掉14张面牌报哪家最大次大",
//            196: "[703]:去掉14张面牌报哪家1大2大3大",
//            197: "[704]:去掉14张面牌报哪家最小次小",
//            198: "[705]:去掉14张面牌根据第14张牌点数再去牌报最大",
//            199: "[706]:去掉14张面牌根据第14张牌点数再去牌报最小",
//            200: "[707]:去面牌底牌根据面牌底牌点数和去牌报最大次大",
//            201: "[708]:固定去掉6、7、8、9张牌，以去牌数为色报位置最大",
//            203: "[719]:比第一张牌从最大牌继续发报最大次大",
//            204: "[720]:比第一张牌从最大牌继续发报最大",
//            205: "[721]:比第一张牌从最小牌继续发报最大",
//            206: "[722]:比第一张牌从最小牌继续发报最大次大",
//            214: "[758]:看色留色+色牌上X张为色报最大次大",
//            216: "[760]:看色留色报最大",
//            217: "[761]:看色留色报最大次大",
//            218: "[762]:看色留色报最小",
//            219: "[763]:看色留色报最小次小",
//            220: "[764]:看色留色报排名",
//            221: "[766]:看色牌去色全部报最大",
//            222: "[767]:看色牌去色全部报最大次大",
//            223: "[768]:看色牌去色全部报最小",
//            224: "[769]:看色牌去色全部报最小次小",
//            225: "[770]:看色牌去色全部报排名",
//            226: "[790]:固定第10张牌作色留色报最大",
//            227: "[791]:固定第10张牌作色留色报最大...",
//            228: "[793]:固定第10张牌作色留色报最小次小",
//            229: "[7941:固定第10张牌作色留色报排名",
//            232: "[800]:固定第10张牌作色去色全部报最大",
//            233: "[801]:固定第10张牌作色去色全部报最大次大",
//            234: "[802]:固定第10张牌作色去色全部报最小",
//            235: "[803]:固定第10张牌作色去色全部报最小次小",
//            236: "[804]:固定第10张牌作色去色全部报排名",
        //报法格式 "1轮最大/最小 2轮最大/最小“
        case 0...4, 168...172,174,177...186,193...201,203...206,214,216...229,232...236:
            
            for resultInfo in multipleReportResultInfo.singleResultList{
                var reportString = ""
                let voiceType = 1
                var currentReportStruct: [SpeakResultStruct] = []
                
                for rcID in resultInfo.targetRCList[0] {
                    reportString = String(rcID + 1)
                    currentReportStruct.append(SpeakResultStruct(voiceType: voiceType, content: reportString))
                }
                
                reportResult.append(currentReportStruct)
            }
//            5:"[6]:报活门",
//            报法格式：活门2，4或无
        case 5:
            for resultInfo in multipleReportResultInfo.singleResultList{
                var voiceType: Int = 1
                var reportString: String = "0"
                if resultInfo.aliveNumber != 0 {
                    voiceType = 1
                    reportString = String(resultInfo.aliveNumber)
                }
                reportResult.append([SpeakResultStruct(voiceType: voiceType, content: reportString)])
            }
            
            break
//            6:"[7]:报活门半活门对子*",
        case 6:
            for resultInfo in multipleReportResultInfo.singleResultList{
                var reportString = ""
                var voiceType = 1
                var currentResult : [SpeakResultStruct] = []
                
                switch resultInfo.aliveNumber {
                case 4, 2:
                    reportString = "活门" + String(resultInfo.aliveNumber)
                    break
                case 3, 1:
                    reportString = "活门" + String(resultInfo.aliveNumber + 1)
                    voiceType = 0
                default:
                    reportString = "0"
                }
                currentResult.append(SpeakResultStruct(voiceType: voiceType, content: reportString))
                
                if resultInfo.pairIDList.count > 0{
                    reportString = "对子"
                    voiceType = 0
                    for pairID in resultInfo.pairIDList {
                        reportString += String(pairID + 1)
                    }
                    currentResult.append(SpeakResultStruct(voiceType: voiceType, content: reportString))
                }
                
                reportResult.append(currentResult)
            }
            break
//            8:"[8_1]:报最大次大活门半活门平点对子*",
//            报: 最大次大 活门几 有对子报对子
        case 8:
            for resultInfo in multipleReportResultInfo.singleResultList{
                var reportString = ""
                var voiceType = 1
                var currentResult : [SpeakResultStruct] = []
                for rcID in resultInfo.targetRCList[0] {
                    reportString = String(rcID + 1)
                    currentResult.append(SpeakResultStruct(voiceType: voiceType, content: reportString))
                }
                
                switch resultInfo.aliveNumber {
                case 4, 2:
                    reportString = "活门" + String(resultInfo.aliveNumber)
                    break
                case 3, 1:
                    reportString = "半活门" + String(resultInfo.aliveNumber + 1)
                    voiceType = 0
                default:
                    reportString = "0"
                }
                currentResult.append(SpeakResultStruct(voiceType: voiceType, content: reportString))
                
                if resultInfo.pairIDList.count > 0{
                    reportString = "对子"
                    voiceType = 0
                    for pairID in resultInfo.pairIDList {
                        reportString += String(pairID + 1)
                    }
                    currentResult.append(SpeakResultStruct(voiceType: voiceType, content: reportString))
                }
                
                reportResult.append(currentResult)
            }
            break
//            7:"[8]:报最大次大和生死门",
//            报法格式：最大次大家+活门几

        case 7:
            for resultInfo in multipleReportResultInfo.singleResultList{
                var reportString = ""
                let voiceType = 1
                var currentResult : [SpeakResultStruct] = []
                for rcID in resultInfo.targetRCList[0] {
                    reportString = String(rcID + 1)
                    currentResult.append(SpeakResultStruct(voiceType: voiceType, content: reportString))
                }
                
                if resultInfo.aliveNumber != 0 {
                    reportString += "活门" + String(resultInfo.aliveNumber)
                    
                } else {
                    reportString = "0"
                }
                currentResult.append(SpeakResultStruct(voiceType: voiceType, content: reportString))

                reportResult.append(currentResult)
            }
            break
//            9:"[10]:报最大和最大家牌",
//            报法格式 最大玩家+最大牌型
        case 9:
            for resultInfo in multipleReportResultInfo.singleResultList{
                var reportString = ""
                let voiceType = 1
                var currentSpeakStruct: [SpeakResultStruct] = []
                for rcID in resultInfo.targetRCList[0] {
                    reportString = String(rcID + 1) + " "
                    reportString += resultInfo.RCReturnInfoList[rcID].rcSingleFeaturesType
                    currentSpeakStruct.append(SpeakResultStruct(voiceType: voiceType, content: reportString))
                }
                
                reportResult.append(currentSpeakStruct)
            }
            break
//            10:"[12]:报排名",
//        报法格式：玩家1排名玩家2排名。。。
        case 10:
            for resultInfo in multipleReportResultInfo.singleResultList{
                var reportString: String = ""
                let voiceType = 1
                var currentSpeakStruct: [SpeakResultStruct] = []
                for rcID in resultInfo.targetRCList[0] {
                    reportString = String(rcID + 1)
                    currentSpeakStruct.append(SpeakResultStruct(voiceType: voiceType, content: reportString))
                }
                
                reportResult.append(currentSpeakStruct)
            }

            break
//            11:"[13]:报原始排名 4432和生死门",
        case 11:
            if cutNumRangeSetting[1] == 10 {
                
            } else if cutNumRangeSetting[1] == 11{
                
            } else if cutNumRangeSetting[1] == 20{
                
            } else if cutNumRangeSetting[1] == 21{
                
            }
            break
//            12:"[14]:报最大次大不打几平点对子",
//      报法格式：最大次大，不打几（最小），（杂）平点，对子
        case 12:
            
            for resultInfo in multipleReportResultInfo.singleResultList{
                var reportString = ""
                let voiceType = 1
                var currentResult : [SpeakResultStruct] = []
                for rcID in resultInfo.targetRCList[0] {
                    reportString = String(rcID + 1)
                    currentResult.append(SpeakResultStruct(voiceType: voiceType, content: reportString))
                }
                //1,平点，2杂平点，3双平点，4三大一小，5三小一大

                // 不打几
                if resultInfo.drawType != 3 && resultInfo.drawType != 5 {
                    reportString = "不打"
                    reportString += String(resultInfo.NoColorNum)
                    currentResult.append(SpeakResultStruct(voiceType: voiceType, content: reportString))
                }
                
                
                //对子
                reportString = "对子"
                reportString += String(resultInfo.pairNum)
                if resultInfo.pairNum != 0 {
                    currentResult.append(SpeakResultStruct(voiceType: voiceType, content: reportString))
                }
                
                //pingdian
                switch resultInfo.drawType{
                case 1:
                    reportString = "平点"
//                    reportString += String(resultInfo.drawID + 1) + resultInfo.drawSize
                    reportString += resultInfo.drawSize
                    print("平点 \(reportString)")
                    break
                case 2:
                    reportString = "杂平点"
                    
//                    reportString += String(resultInfo.drawID + 1) + resultInfo.drawSize
                    reportString += resultInfo.drawSize
                    print("杂平点 \(reportString)")

                    break
                case 3:
                    reportString = "双平点"
                    break
                case 4,5:
                    reportString = "三平点"
                    break
                default:
                    break
                }
                if resultInfo.drawType != 0 {
                    
                    currentResult.append(SpeakResultStruct(voiceType: voiceType, content: reportString))
                }

                reportResult.append(currentResult)
            }
            break
//            13:"[45]:上10张打色留色再根据色牌点数去牌保位置最大",
//            14:"[46]:上10张打色留色再根据色牌点数去牌保位置最大次大",
//            15:"[47]:上10张打色去色全部再根据色牌点数去牌保位置最大",
//            16:"[48]:上10张打色去色全部再根据色牌点数去牌保位置最大次大",
//            17:"[49]:上10张打色留色保位置最大跑的快专用*",
//            18:"[50]:上10张打色留色保位置最大",
//            19:"[51]:上10张打色留色保位置最大次大",
//            20:"[52]:上10张打色留色保位置最小",
//            21:"[53]:上10张打色留色保位置最小次小",
//            22:"[54]:上10张打色去色全部+底为色保位置最大",
//            23:"[55]:上10张打色去色全部保位置最大",
//            24:"[56]:上10张打色去色全部保位置最大次大",
//            25:"[57]:上10张打色去色全部保位置最小",
//            26:"[58]:上10张打色去色全部保位置最小次",
//            27:"[60]:上10张打色去色1张保位置最大",
//            28:"[61]:上10张打色去色1张保位置最大次大",
//            29:"[62]:上10张打色去色1张保位置最小",
//            30:"[63]:上10张打色去色1张保位置最小次小",
//            31:"[64]:上10张打色去色1张+提前去掉的牌为色保庄最大*",
//            32:"[66]:上10张打色色牌先发保位置最大",
//            33:"[67]:上10张打色色牌先发保位置最大次大",
//            34:"[68]:上10张打色色牌先发保位置最小",
//            35:"[69]:上10张打色色牌先发保位置最小次小",
            //报法格式：1轮第几张处打色，2轮第几张打色
        case 13...35, 74...78:
            for resultInfo in multipleReportResultInfo.singleResultList{
                var currentSpeakStruct: [SpeakResultStruct] = []
                for subArray in resultInfo.singlefeatureIndexToConfirmMaxMin {
                    let voiceType:Int = 1
                    var reportString: String = ""
                    for singlefeatureIndex in subArray {
                        reportString += String(singlefeatureIndex) + " "
                    }
                    if resultInfo.singlefeatureIndexToConfirmMaxMin.count == 0 {
                        reportString = "0 "
                    }
                    currentSpeakStruct.append(SpeakResultStruct(voiceType: voiceType, content: reportString))
                    
                }
                reportResult.append(currentSpeakStruct)
            }
            break
//            36:"[70]:上10张去牌保多轮位置最大次大次数最多*",
//            37:"[71]:上10张去牌保位置最大",
//            38:"[71_1]:上10张去牌保位置最大对优先*",
//            39:"[72]:上10张去牌保位置最大次大",
//            40:"[73]:上10张去牌保位置最小",
//            41:"[74]:上10张去牌保位置最小次小",
        // 报法格式 去牌张数 女0 不用去牌，男0去多少张都没用
        case 36...41, 48, 52...57, 213, 251:
            for resultInfo in multipleReportResultInfo.singleResultList{
                var currentSpeakStruct: [SpeakResultStruct] = []

                for subArray in resultInfo.singlefeatureIndexToConfirmMaxMin {
                    var reportString: String = ""
                    var voiceType: Int = 1
                    if subArray.count == 0 {
                        voiceType = 0
                        reportString = "0"
                    }
                    for singlefeatureIndex in subArray {
                        if singlefeatureIndex == 1 {
                            voiceType = 1
                            reportString = "0"
                            
                        } else {
                            voiceType = 1
                            reportString += String(singlefeatureIndex - 1) + " "
                        }
                    }
                    currentSpeakStruct.append(SpeakResultStruct(voiceType: voiceType, content: reportString))
                }
                reportResult.append(currentSpeakStruct)
            }
            break
//            42:"[75]上10张去牌保有活门报括门*",
//        报法格式：去牌数➕活门几
        case 42:
            for resultInfo in multipleReportResultInfo.singleResultList {
                var currentSpeakStruct: [SpeakResultStruct] = []

                for subArray in resultInfo.singlefeatureIndexToConfirmAliveDeath {
                    var reportString: String = ""
                    var voiceType: Int = 1
                    if subArray.count == 0 {
                        voiceType = 0
                        reportString = "0"
                    }
                    for singlefeatureIndex in subArray {
                        if singlefeatureIndex == 1 {
                            voiceType = 1
                            reportString = "0"
                            
                        } else {
                            voiceType = 1
                            reportString += String(singlefeatureIndex - 1) + "活门" + String(resultInfo.aliveNumber) + " "
                        }
                    }
                    currentSpeakStruct.append(SpeakResultStruct(voiceType: voiceType, content: reportString))
                }
                
                reportResult.append(currentSpeakStruct)
            }
            break
//            43:"[76]:上10张去牌保有活门报最大*",
        case 43:
            for resultInfo in multipleReportResultInfo.singleResultList {
                var currentSpeakStruct :[SpeakResultStruct] = []
                for subArray in resultInfo.singlefeatureIndexToConfirmAliveDeath{
                    var reportString: String = ""
                    var voiceType: Int = 1
                    
                    if subArray.count == 0 {
                        voiceType = 0
                        reportString = "0"
                    }
                    
                    for singlefeatureIndex in subArray {
                        if singlefeatureIndex == 1 {
                            voiceType = 1
                            reportString += "0"
                            
                        } else {
                            voiceType = 1
                            reportString += String(singlefeatureIndex - 1) + " "
                        }
                        reportString += "活门" + String(resultInfo.aliveNumber) + " "
                    }
                    currentSpeakStruct.append(SpeakResultStruct(voiceType: voiceType, content: reportString))
                    //报最大家
                    voiceType = 1
                    reportString = ""
                    if subArray.count != 0 {
                        for rcReturnInfo in resultInfo.RCReturnInfoList{
                            if rcReturnInfo.rcDatasetRank == 1 {
                                reportString += String(rcReturnInfo.rcID + 1)
                            }
                        }
                        currentSpeakStruct.append(SpeakResultStruct(voiceType: voiceType, content: reportString))
                    }
                }
                reportResult.append(currentSpeakStruct)
            }
            break
//            44:"[77]:上10张去牌保多轮同点报最大次大生死门*",
        case 44:
            break
//            45:"[78_1]:上10张去牌保多轮同点且无9点*",
//            46:"[78]:上10张去牌保多轮同点且无对子*",
        case 45...46:
            break
//            47:"[79]:上10张去牌面为色去色保位置最大次大次数最多",
//            54:"[85]:上10张去牌保多轮位置最大次数最多*",
        case 47,54:
            let voiceType: Int = 1
            var reportString: String = ""
            reportString += String(multipleReportResultInfo.singlefeatureIndexForMultipleRound) + " "
            reportString += multipleReportResultInfo.winRoundIndex.reduce("") { $0 + "\($1)" } + " "
            reportResult.append([SpeakResultStruct(voiceType: voiceType, content: reportString)])
            break
//        49:"[81]:上10张去牌保位置最小无对子",
        case 49:
            break
//            50:"[82]:上10张去牌保34门有最大报最大",
//            51:"[83]:上10张去牌保34门最大次大",
        //报法格式：去牌+最大位置
        case 50...51:
            for resultInfo in multipleReportResultInfo.singleResultList{
                var currentSpeakStruct :[SpeakResultStruct] = []
                for i in 0..<resultInfo.singlefeatureIndexToConfirmMaxMin.count - 1 {
                    let voiceType: Int = 1
                    var reportString: String = ""
                    for j in 0..<resultInfo.singlefeatureIndexToConfirmMaxMin[i].count {
                        reportString += String(resultInfo.singlefeatureIndexToConfirmMaxMin[i][j])
                        if resultInfo.XorYMax[i].count > 0{
                            reportString += String(resultInfo.XorYMax[i][j]) + " "
                        }
                    }
                    currentSpeakStruct.append(SpeakResultStruct(voiceType: voiceType, content: reportString))
                }
                reportResult.append(currentSpeakStruct)
            }
            break
//           58:[91]上10张去牌面为色色先发保无牛或最多一家有牛
        //报法格式：去牌数（男1家有牛，女无牛）
        case 58:
            for resultInfo in multipleReportResultInfo.singleResultList{
                
                var voiceType: Int = 1
                var reportString: String = ""
                //1家
                if resultInfo.NoBullOrMaxOneBull == 1 {
                    voiceType = 0
                } else if resultInfo.NoBullOrMaxOneBull == 2 {
                    voiceType = 1
                }
                
                if resultInfo.singlefeatureIndexToConfirmMaxMin[0].count == 0 {
                    reportString = "有牛"
                }
                
                for singlefeatureIndex in resultInfo.singlefeatureIndexToConfirmMaxMin[0] {
                    reportString += String(singlefeatureIndex - 1) + " "
                }

                reportResult.append([SpeakResultStruct(voiceType: voiceType, content: reportString)])
            }
            
            break
//            59:"[92]:上10张去牌保至少一家有牛牛",
        //报法格式: 去牌➕第几家牛牛
        case 59:
            for resultInfo in multipleReportResultInfo.singleResultList{
                var currentSpeakStruct :[SpeakResultStruct] = []
                for subArray in resultInfo.singlefeatureIndexToConfirmMaxMin {
                    
                    var voiceType: Int = 1
                    var reportString: String = ""
                    for index in subArray {
                        reportString += String(index - 1)
                    }
                    for bullID in resultInfo.BullBullRCID{
                        reportString += String(bullID + 1)
                    }
                    currentSpeakStruct.append(SpeakResultStruct(voiceType: voiceType, content: reportString))
                }
                reportResult.append(currentSpeakStruct)
            }
            break
        //报法格式：上去牌数➕下去牌数（第x门最小且有2家同点）
        case 60...61:
            for resultInfo in multipleReportResultInfo.singleResultList {
                var currentSpeakStruct :[SpeakResultStruct] = []
                for subArray in resultInfo.singlefeatureIndexToConfirmMaxMin {
                    var voiceType: Int = 1
                    var reportString: String = ""
                    if subArray.count == 0 {
                        voiceType = 1
                        reportString += "0"
                    }
                    for i in subArray{
                        if i == 1 {
                            voiceType = 1
                            reportString += "0"
                        } else {
                            reportString += String(i - 1)
                        }
                    }
                    currentSpeakStruct.append(SpeakResultStruct(voiceType: voiceType, content: reportString))
                }
                reportResult.append(currentSpeakStruct)
            }
            break
        //报法格式, 上打色张数+下打色张数
        case 64...73:
            for resultInfo in multipleReportResultInfo.singleResultList {
                var currentSpeakStruct :[SpeakResultStruct] = []
                for subArray in resultInfo.singlefeatureIndexToConfirmMaxMin {
                    var voiceType: Int = 1
                    var reportString: String = ""
                    if subArray.count == 0{
                        voiceType = 1
                        reportString += "0"
                    }
                    for i in subArray{
                        reportString += String(i)
                    }
                    currentSpeakStruct.append(SpeakResultStruct(voiceType: voiceType, content: reportString))
                }
                reportResult.append(currentSpeakStruct)
            }
            break
            
        case 62...63:
            for resultInfo in multipleReportResultInfo.singleResultList {
                var currentSpeakStruct :[SpeakResultStruct] = []
                for upDownID in 0..<resultInfo.singlefeatureIndexToConfirmMaxMin.count {
                    var voiceType: Int = 1
                    var reportString: String = ""
                    let subArray = resultInfo.singlefeatureIndexToConfirmMaxMin[upDownID]
                    
                    if subArray.count == 0{
                        voiceType = 0
                        reportString += "0"
                    }
                    for i in 0..<subArray.count{
                        let singlefeatureIndex = subArray[i]
                        if singlefeatureIndex == 1 {
                            voiceType = 1
                            reportString += "0"
                        } else {
                            reportString += String(singlefeatureIndex - 1)
                        }
                    }
                    if resultInfo.XorYMax[upDownID].count > 0 {
                        for posINdex in resultInfo.XorYMax[upDownID]{
                            reportString += String(posINdex)
                        }
                    }
                    
                    currentSpeakStruct.append(SpeakResultStruct(voiceType: voiceType, content: reportString))
                }
                
                reportResult.append(currentSpeakStruct)
            }
            break
//            79:"[130]:看手牌报生死门*",
        case 79:
            for resultInfo in multipleReportResultInfo.singleResultList{
                var reportString = ""
                let voiceType = 1
                var currentReportStruct: [SpeakResultStruct] = []
                var dealPos: Int = 1
                for aliveNumber in resultInfo.handCardAliveNumberList{
                    let initialString : String = String(dealPos) + "张"
                    reportString = "\(aliveNumber)"
                    reportString = initialString + reportString
                    currentReportStruct.append(SpeakResultStruct(voiceType: voiceType, content: reportString))
                    dealPos += 1
                }
                reportResult.append(currentReportStruct)
            }
            break
            
//            87:"[145]:看手牌面为色留色报最大次大生死门*",
//            90:"[149]:看手牌面为色去色报最大次大生死门*",
//            82:"[133]:看手牌报最大次大生死门*",

        case 87, 90, 82:
            
            for resultInfo in multipleReportResultInfo.singleResultList{
                var reportString = ""
                let voiceType = 1
                var currentReportStruct: [SpeakResultStruct] = []
                var dealPos: Int = 1
                for handindex in 0..<resultInfo.targetRCList.count{
                    let subTargetRCList = resultInfo.targetRCList[handindex]
                    let aliveNumber = resultInfo.handCardAliveNumberList[handindex]
                    let initialString : String = String(dealPos) + "张"
                    reportString = ""
                    for rcID in subTargetRCList {
                        reportString += String(rcID + 1) + " "
                    }
                    reportString = initialString + reportString + "\(aliveNumber)"
                    currentReportStruct.append(SpeakResultStruct(voiceType: voiceType, content: reportString))
                    dealPos += 1
                }
                
                
                reportResult.append(currentReportStruct)
            }
            
//            80:"[131]:看手牌报最大*",
//            81:"[132]:看手牌报最大次大*",
//            83:"[134]:看手牌比第一张牌从最大牌继续发报最大*",
//            84:"[135]:看手牌比第一张牌从最大牌继续发报最大次大*",
//            85:"[143]:看手牌面为色留色报最大*",
//            86:"[144]:看手牌面为色留色报最大次大*",
//            88:"[147]:看手牌面为色去色报最大*",
//            89:"[148]:看手牌面为色去色报最大次大*",
        case 80...81, 83...86, 88...89:
            
            for resultInfo in multipleReportResultInfo.singleResultList{
                var reportString = ""
                let voiceType = 1
                var currentReportStruct: [SpeakResultStruct] = []
                var dealPos: Int = 1
                for subTargetRCList in resultInfo.targetRCList{
                    let initialString : String = String(dealPos) + "张"
                    reportString = ""
                    for rcID in subTargetRCList {
                        reportString += String(rcID + 1) + " "
                    }
                    reportString = initialString + reportString
                    currentReportStruct.append(SpeakResultStruct(voiceType: voiceType, content: reportString))
                    dealPos += 1
                }
                
                
                reportResult.append(currentReportStruct)
            }
            
            
            break
//            91:"[200]:飞2张保位置最大*",
//            92: "[201]:飞2张保位置最小*",
//                93: "[202]:飞2张打色留色保位置最大*",
//                94: "[203]:飞2张打色留色保位置最小*",
//                95: "[206]:飞2张打色去色1张保位置最大*",
//                96: "[207]:飞2张打色去色1张保位置最小*",
//                97: "[208]:飞2张打色色先发保位置最大*",
//                98: "[209]:飞2张打色色先发保位置最小*",
//                99: "[211]:飞2张骰子打色保位置最大*",
//                100: "[212]:飞2张面为色留色保位置最大*",
//                101: "[213]:飞张面为色留色保位置最小*",
//                102: "[214]:飞2张面为色去色保位置最大*",
//                103: "[215]:飞2张面为色去色保位置最小*",
//                104: "[216]:飞2张底为色保位置最大*",
//                105: "[217]:飞2张底为色保位置最小*",
//                106: "[218]:飞2张底2张相加为色保位置最大*",
//                107: "[221]:飞2张打色留色再看底保位置最大*",
//            257: "[226]:飞2张底为色 色先发保位置最大",
//            258: "[227]:飞2张底为色 色先发保位置最小",
//            259: "[228]:飞2张底2张相加为色保位置最小",
//            260: "[229]:飞2张看色留色再看底保位置最小",
        case 91...107, 257...260:
            for resultInfo in multipleReportResultInfo.singleResultList{
                let voiceType: Int = 1
                var reportString: String = ""
                var currentSpeakStruct: [SpeakResultStruct] = []
                for flyTCNode in resultInfo.flyTCSolution{
                    reportString = String(flyTCNode.X + 1) + " "
                    reportString += String(flyTCNode.Y + 1)
                    currentSpeakStruct.append(SpeakResultStruct(voiceType: voiceType, content: reportString))
                    
                }
                reportResult.append(currentSpeakStruct)
            }
            break
//            108: "[284]:固定范围切牌报对子和同点数目",
        //报法格式: 对子总数, 同点数目
        case 108:
            
            var reportString: String  = ""
            reportString += String(multipleReportResultInfo.totalPairNum) + "，"
            reportString += String(multipleReportResultInfo.totalDrawNum)
            reportResult.append([SpeakResultStruct(voiceType: 1, content: reportString)])
            break
//            109: "[285]:固定范围切牌报哪个位置拿最大最多",
//            110: "[286]:固定范围切牌报哪个位置拿最大次大最多",
        case 109...110:
            reportResult.append([SpeakResultStruct(voiceType: 1, content: String(multipleReportResultInfo.maxWinPosition))])
            
            break
//            111: "[289]:范围切牌保指定2家有最大",
//            112: "[290]:范围切牌保有最好活门*",
//            113: "[291]:范围切牌保有最好死门*",
//            114: "[292]:范围切牌保位置活门",
//            115: "[293]:范围切牌保位置死门",
//            116: "[296]:范围切牌保位置最小次小",
//            117: "[297]:范围切牌面为色去色保位置最大次大",
//            118: "[298]:范围切牌面为色色先发保位置最大次大",
//            119: "[299_1]:范围切牌保位置最大",
//            120: "[299]:范围切牌保位置最大次大",
//            121: "[300]:范围打色留色保位置最大",
//            122: "[301]:范围打色留色保位置最大次大",
//            123: "[304]:范围打色去色全部保位置最大",
//            124: "[305]:范围打色去色全部保位置最大次大",
//            125: "[310]:范围打色去色1张保位置最大",
//            126: "[3111:范围打色去色1张保位置最大次大",
//            127: "[316]:范围打色色先发保位置最大",
//            128: "[317]:范围打色色先发保位置最大次大",
//            129: "[330]:范围打色留色保位置最小",
//            130: "[331]:范围打色留色保位置最小次小",
//            131: "[334]:范围打色去色全部保位置最小",
//            132: "[335]:范围打色去色全部保位置最小次小",
//            133: "[338]:范围打色去色1张保位置最小",
//            134: "[339]:范围打色去色1张保位置最小次小",
//            135: "[342]:范围打色色先发保位置最小",
//            136: "[343]:范围打色色先发保位置最小次小",
        //报法格式：切牌范围1，切牌范围2
        case 111...136:
            for resultInfo in multipleReportResultInfo.singleResultList{
                
                
                
                var reportString: String = ""
                
                var allGaps: [[Int]] = []
                var cutIndexList: [Int] = []
                
                if reportID >= 112 && reportID <= 115 {
                    cutIndexList = resultInfo.singlefeatureIndexToConfirmAliveDeath[0]
                } else {
                    cutIndexList = resultInfo.singlefeatureIndexToConfirmMaxMin[0]
                }
                var currentGap:[Int] = []
                for i in 0..<cutIndexList.count {
                    if i == 0 {
                        currentGap = [cutIndexList[0], cutIndexList[0]]
                        continue
                    }
                    if cutIndexList[i] - currentGap[1] == 1 {
                        currentGap[1] = cutIndexList[i]
                    } else {
                        allGaps.append(currentGap)
                        currentGap = [cutIndexList[i], cutIndexList[i]]
                    }
                    if i == cutIndexList.count - 1 {
                        allGaps.append(currentGap)
                    }
                }
                
                var maxLength: Int = 0
                var maxGapID: Int = 0
                for gapID in 0..<allGaps.count - 1{
                    if allGaps[gapID][1] - allGaps[gapID][0] >= maxLength {
                        maxGapID = gapID
                        maxLength = allGaps[gapID][1] - allGaps[gapID][0]
                    }
                }
                
                var currentSpeakStruct: [SpeakResultStruct] = []
                for boundary in allGaps[maxGapID] {
                    currentSpeakStruct.append(SpeakResultStruct(voiceType: 1, content: String(boundary)))
                }
                
                reportResult.append(currentSpeakStruct)
            }
            
            
            break
//            137: "[400]:随意打色留色保位置最大次大",
//            138: "[401]:随意打色留色保位童最小次小",
//            139: "[402]:随意打色去色全部保位置最大次大",
//            140: "[403]:随意打色去色全部保位置最小次小",
//            141: "[410]:随意打色去色1保位置最大次大",
//            142: "[411]:随意打色去色1保位置最小次小",
//            143: "[415]:随意打色色先发保位置最大次大",
//            144: "[416]:随意打色色先发保位置最小次小",
        case 137...144:
            break
//            145: "[420]:随意混合打色保位置最大次大",
//            146: "[421]:随意混合打色保位置最小次小",
        case 145...146:
            for resultInfo in multipleReportResultInfo.singleResultList{
                var currentSpeakStruct: [SpeakResultStruct] = []
                for subArray in resultInfo.singlefeatureIndexToConfirmMaxMin {
                    var voiceType:Int = 1
                    var reportString: String = ""
                    var i = 0
                    for singlefeatureIndex in subArray {
//                       放回
                        reportString += "\(singlefeatureIndex + 1)" + " "
                        
                        if resultInfo.randomColorFlag[i] == 0 {
                            voiceType = 1
                        } else {
                            voiceType = 0
                        }
                        i += 1
                    }
                    
                    currentSpeakStruct.append(SpeakResultStruct(voiceType: voiceType, content: reportString))
                    print("返回的string \(reportString)")
                    
                }
                reportResult.append(currentSpeakStruct)
            }
            break
//            147: "[422]:随意混合打色报大1大2小1小2",
        case 147:
            for resultInfo in multipleReportResultInfo.singleResultList{
                var currentSpeakStruct: [SpeakResultStruct] = []
                for subArray in resultInfo.singlefeatureIndexToConfirmMaxMin {
                    let voiceType:Int = 1
                    var reportString: String = ""
                    var i = 0
                    for singlefeatureIndex in subArray {
//                       放回
                        if singlefeatureIndex == 0 {
                            reportString += "大"
//                        放底部
                        } else if singlefeatureIndex == 1 {
                            reportString += "小"
                        }
                        
                        if resultInfo.randomColorFlag[i] == 0 {
                            reportString += "1"
                        } else {
                            reportString += "2"
                        }
                        i += 1
                    }
                    
                    currentSpeakStruct.append(SpeakResultStruct(voiceType: voiceType, content: reportString))
                    
                }
                reportResult.append(currentSpeakStruct)
            }
            break
//            148: "[450]:指定底牌报最大次大",
//            149: "[451]:指定底牌报最大",
//            150: "[452]:指定底牌报最小次小",
//            151: "[453]:指定底牌报最小",
//            152: "[454]:指定底牌报生死门",
//            153: "[500]:指定顶牌报最大次大",
//            154: "[501]:指定顶牌报最大",
//            155: "[502]:指定顶牌报最小次小",
//            156: "[503]:指定顶牌报最小",
//            157: "[504]:指定顶牌报生死门",
//            158: "[510]:指定顶牌底牌为色报位置最大次大",
//            159: "[511]:指定顶牌底牌为色报位置最大",
//            160: "[512]:指定顶牌底牌为色报位置最小次小",
//            161: "[513]:指定顶牌底牌为色报位置最小",
//            162: "[514]:指定牌上一张打色留色报位置最大次大",
//            163: "[515]:指定牌上一张打色去色全部报位置最大次大",
//            164: "[516]:指定牌下一张打色留色报位置最大次大",
//            165: "[517]:指定牌下一张打色去色全部报位置最大次大",
        case 148...165:
            for resultInfo in multipleReportResultInfo.singleResultList{
                var reportString: String = ""
                reportString += String(resultInfo.specialSingleFeaturePos) + " "
                if resultInfo.targetRCList.count > 0 {
                    for rcID in resultInfo.targetRCList[0]{
                        reportString += String(rcID + 1)
                    }
                }
                reportResult.append([SpeakResultStruct(voiceType: 1, content: reportString)])
            }
            break
//            166: "[518]:底为色4种发牌方式报最小*",
//            167: "[519]:底为色4种发牌方式报最大*",
        case 166...167:
            break
        case 187:
            for resultInfo in multipleReportResultInfo.singleResultList{
                var reportString: String = ""
                reportString = resultInfo.fourCardReport
                reportResult.append([SpeakResultStruct(voiceType: 1, content: reportString)])
                print("670 报法\(reportString)")
            }
            break
        default:
            break
            
        }

        
        //jq替换
        for speakContent in reportResult {
            for contentStruct in speakContent {
                contentStruct.content = contentStruct.content.replacingOccurrences(of: "J", with: "勾")
                contentStruct.content = contentStruct.content.replacingOccurrences(of: "Q", with: "圈")
                contentStruct.content = contentStruct.content.replacingOccurrences(of: "A", with: "尖")
            }
        }
        
        return reportResult
        
    }
    
}
